[
    {
        "Modified": "2023-04-28T17:47:00",
        "Published": "2023-04-19T00:15:00",
        "access": {},
        "assigner": "security-advisories@github.com",
        "cvss": null,
        "cwe": "CWE-74",
        "id": "CVE-2023-29519",
        "impact": {},
        "last-modified": "2023-04-28T17:47:00",
        "references": [
            "https://github.com/xwiki/xwiki-platform/security/advisories/GHSA-3hjg-cghv-22ww",
            "https://github.com/xwiki/xwiki-platform/commit/5e8725b4272cd3e5be09d3ca84273be2da6869c1",
            "https://jira.xwiki.org/browse/XWIKI-20364"
        ],
        "summary": "XWiki Platform is a generic wiki platform offering runtime services for applications built on top of it. A registered user can perform remote code execution leading to privilege escalation by injecting the proper code in the \"property\" field of an attachment selector, as a gadget of their own dashboard.  Note that the vulnerability does not impact comments of a wiki. The vulnerability has been patched in XWiki 13.10.11, 14.4.8, 14.10.2, 15.0-rc-1. Users are advised to upgrade. There are no known workarounds for this vulnerability."
    },
    {
        "Modified": "2023-04-28T17:45:00",
        "Published": "2023-04-19T15:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "NVD-CWE-noinfo",
        "id": "CVE-2023-29586",
        "impact": {},
        "last-modified": "2023-04-28T17:45:00",
        "references": [
            "https://cwe.mitre.org/data/definitions/285.html",
            "https://securityandstuff.com/posts/teracopy_arbitrary_read/"
        ],
        "summary": "Code Sector TeraCopy 3.9.7 does not perform proper access validation on the source folder during a copy operation. This leads to Arbitrary File Read by allowing any user to copy any directory in the system to a directory they control."
    },
    {
        "Modified": "2023-04-28T17:43:00",
        "Published": "2023-04-28T17:15:00",
        "access": {},
        "assigner": "hp-security-alert@hp.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-1526",
        "impact": {},
        "last-modified": "2023-04-28T17:43:00",
        "references": [
            "https://support.hp.com/us-en/document/ish_7869666-7869691-16/hpsbpi03837"
        ],
        "summary": "Certain DesignJet and PageWide XL TAA compliant models may have risk of potential information disclosure if the hard disk drive is physically removed from the printer."
    },
    {
        "Modified": "2023-04-28T17:43:00",
        "Published": "2023-04-28T17:15:00",
        "access": {},
        "assigner": "hp-security-alert@hp.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-27973",
        "impact": {},
        "last-modified": "2023-04-28T17:43:00",
        "references": [
            "https://support.hp.com/us-en/document/ish_7920137-7920161-16/hpsbpi03841"
        ],
        "summary": "Certain HP LaserJet Pro print products are potentially vulnerable to Heap Overflow and/or Remote Code Execution."
    },
    {
        "Modified": "2023-04-28T17:43:00",
        "Published": "2023-04-28T17:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-404",
        "id": "CVE-2023-2379",
        "impact": {},
        "last-modified": "2023-04-28T17:43:00",
        "references": [
            "https://vuldb.com/?ctiid.227655",
            "https://vuldb.com/?id.227655",
            "https://github.com/leetsun/IoT/tree/main/EdgeRouterX/DoS"
        ],
        "summary": "A vulnerability classified as critical has been found in Ubiquiti EdgeRouter X up to 2.0.9-hotfix.6. This affects an unknown part of the component Web Service. The manipulation leads to denial of service. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used. The associated identifier of this vulnerability is VDB-227655."
    },
    {
        "Modified": "2023-04-28T17:43:00",
        "Published": "2023-04-28T17:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-404",
        "id": "CVE-2023-2380",
        "impact": {},
        "last-modified": "2023-04-28T17:43:00",
        "references": [
            "https://github.com/leetsun/IoT/tree/main/Netgear-SRX5308/17",
            "https://vuldb.com/?id.227658",
            "https://vuldb.com/?ctiid.227658"
        ],
        "summary": "A vulnerability, which was classified as problematic, was found in Netgear SRX5308 up to 4.3.5-3. Affected is an unknown function. The manipulation leads to denial of service. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used. VDB-227658 is the identifier assigned to this vulnerability. NOTE: The vendor was contacted early about this disclosure but did not respond in any way."
    },
    {
        "Modified": "2023-04-28T17:43:00",
        "Published": "2023-04-28T17:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-79",
        "id": "CVE-2023-2381",
        "impact": {},
        "last-modified": "2023-04-28T17:43:00",
        "references": [
            "https://github.com/leetsun/IoT/tree/main/Netgear-SRX5308/6",
            "https://vuldb.com/?id.227659",
            "https://vuldb.com/?ctiid.227659"
        ],
        "summary": "A vulnerability has been found in Netgear SRX5308 up to 4.3.5-3 and classified as problematic. Affected by this vulnerability is an unknown functionality of the file scgi-bin/platform.cgi?page=bandwidth_profile.htm of the component Web Management Interface. The manipulation of the argument BandWidthProfile.ProfileName leads to cross site scripting. The attack can be launched remotely. The exploit has been disclosed to the public and may be used. The associated identifier of this vulnerability is VDB-227659. NOTE: The vendor was contacted early about this disclosure but did not respond in any way."
    },
    {
        "Modified": "2023-04-28T17:43:00",
        "Published": "2023-04-28T17:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-79",
        "id": "CVE-2023-2382",
        "impact": {},
        "last-modified": "2023-04-28T17:43:00",
        "references": [
            "https://vuldb.com/?id.227660",
            "https://vuldb.com/?ctiid.227660",
            "https://github.com/leetsun/IoT/tree/main/Netgear-SRX5308/1"
        ],
        "summary": "A vulnerability was found in Netgear SRX5308 up to 4.3.5-3 and classified as problematic. Affected by this issue is some unknown functionality of the file scgi-bin/platform.cgi?page=firewall_logs_email.htm of the component Web Management Interface. The manipulation of the argument sysLogInfo.serverName leads to cross site scripting. The attack may be launched remotely. The exploit has been disclosed to the public and may be used. The identifier of this vulnerability is VDB-227660. NOTE: The vendor was contacted early about this disclosure but did not respond in any way."
    },
    {
        "Modified": "2023-04-28T17:40:00",
        "Published": "2023-04-19T00:15:00",
        "access": {},
        "assigner": "security-advisories@github.com",
        "cvss": null,
        "cwe": "CWE-74",
        "id": "CVE-2023-29518",
        "impact": {},
        "last-modified": "2023-04-28T17:40:00",
        "references": [
            "https://jira.xwiki.org/browse/XWIKI-20283",
            "https://github.com/xwiki/xwiki-platform/security/advisories/GHSA-px54-3w5j-qjg9",
            "https://github.com/xwiki/xwiki-platform/commit/3d055a0a5ec42fdebce4d71ee98f94553fdbfebf"
        ],
        "summary": "XWiki Platform is a generic wiki platform offering runtime services for applications built on top of it. Any user with view rights can execute arbitrary Groovy, Python or Velocity code in XWiki leading to full access to the XWiki installation. The root cause is improper escaping of `Invitation.InvitationCommon`. This page is installed by default. The vulnerability has been patched in XWiki 15.0-rc-1, 14.10.1, 14.4.8, and 13.10.11. Users are advised to upgrade. There are no known workarounds for this issue."
    },
    {
        "Modified": "2023-04-28T17:28:00",
        "Published": "2023-04-19T00:15:00",
        "access": {},
        "assigner": "security-advisories@github.com",
        "cvss": null,
        "cwe": "CWE-200",
        "id": "CVE-2023-29517",
        "impact": {},
        "last-modified": "2023-04-28T17:28:00",
        "references": [
            "https://github.com/xwiki/xwiki-platform/security/advisories/GHSA-m3c3-9qj7-7xmx",
            "https://jira.xwiki.org/browse/XWIKI-20449",
            "https://jira.xwiki.org/browse/XWIKI-20447",
            "https://jira.xwiki.org/browse/XWIKI-20324"
        ],
        "summary": "XWiki Platform is a generic wiki platform offering runtime services for applications built on top of it. The office document viewer macro was allowing anyone to see any file content from the hosting server, provided that the office server was connected and depending on the permissions of the user running the servlet engine (e.g. tomcat) running XWiki. The same vulnerability also allowed to perform internal requests to resources from the hosting server. The problem has been patched in XWiki 13.10.11, 14.10.1, 14.4.8, 15.0-rc-1. Users are advised to upgrade. It might be possible to workaround this vulnerability by running XWiki in a sandbox with a user with very low privileges on the machine.\n\n"
    },
    {
        "Modified": "2023-04-28T17:26:00",
        "Published": "2023-04-19T00:15:00",
        "access": {},
        "assigner": "security-advisories@github.com",
        "cvss": null,
        "cwe": "CWE-74",
        "id": "CVE-2023-29516",
        "impact": {},
        "last-modified": "2023-04-28T17:26:00",
        "references": [
            "https://github.com/xwiki/xwiki-platform/security/advisories/GHSA-3989-4c6x-725f",
            "https://github.com/xwiki/xwiki-platform/commit/aca1d677c58563bbe6e35c9e1c29fd8b12ebb996",
            "https://jira.xwiki.org/browse/XWIKI-20275"
        ],
        "summary": "XWiki Platform is a generic wiki platform offering runtime services for applications built on top of it. Any user with view rights on `XWiki.AttachmentSelector` can execute arbitrary Groovy, Python or Velocity code in XWiki leading to full access to the XWiki installation. The root cause is improper escaping in the \"Cancel and return to page\" button. This page is installed by default. This vulnerability has been patched in XWiki 15.0-rc-1, 14.10.1, 14.4.8, and 13.10.11. There are no known workarounds for this vulnerability.\n"
    },
    {
        "Modified": "2023-04-28T17:23:00",
        "Published": "2023-04-19T00:15:00",
        "access": {},
        "assigner": "security-advisories@github.com",
        "cvss": null,
        "cwe": "CWE-79",
        "id": "CVE-2023-29515",
        "impact": {},
        "last-modified": "2023-04-28T17:23:00",
        "references": [
            "https://github.com/xwiki/xwiki-platform/commit/e73b890623efa604adc484ad82f37e31596fe1a6",
            "https://github.com/xwiki/xwiki-platform/security/advisories/GHSA-44h9-xxvx-pg6x",
            "https://jira.xwiki.org/browse/XWIKI-20190"
        ],
        "summary": "XWiki Platform is a generic wiki platform offering runtime services for applications built on top of it. Any user who can create a space can become admin of that space through App Within Minutes. The admin right implies the script right and thus allows JavaScript injection. The vulnerability can be exploited by creating an app in App Within Minutes. If the button should be disabled because the user doesn't have global edit right, the app can also be created by directly opening `/xwiki/bin/view/AppWithinMinutes/CreateApplication?wizard=true` on the XWiki installation. This has been patched in XWiki 13.10.11, 14.4.8, 14.10.1 and 15.0 RC1 by not granting the space admin right if the user doesn't have script right on the space where the app is created. Error message are displayed to warn the user that the app will be broken in this case. Users who became space admin through this vulnerability won't loose the space admin right due to the fix, so it is advised to check if all users who created AWM apps should keep their space admin rights. Users are advised to upgrade. There are no known workarounds for this vulnerability."
    },
    {
        "Modified": "2023-04-28T17:06:00",
        "Published": "2023-04-28T16:15:00",
        "access": {},
        "assigner": "hp-security-alert@hp.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-27971",
        "impact": {},
        "last-modified": "2023-04-28T17:06:00",
        "references": [
            "https://support.hp.com/us-en/document/ish_7919962-7920003-16/hpsbpi03839"
        ],
        "summary": "Certain HP LaserJet Pro print products are potentially vulnerable to Buffer Overflow and/or Elevation of Privilege."
    },
    {
        "Modified": "2023-04-28T17:06:00",
        "Published": "2023-04-28T16:15:00",
        "access": {},
        "assigner": "hp-security-alert@hp.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-27972",
        "impact": {},
        "last-modified": "2023-04-28T17:06:00",
        "references": [
            "https://support.hp.com/us-en/document/ish_7920078-7920104-16/hpsbpi03840"
        ],
        "summary": "Certain HP LaserJet Pro print products are potentially vulnerable to Buffer Overflow and/or Remote Code Execution."
    },
    {
        "Modified": "2023-04-28T17:06:00",
        "Published": "2023-04-28T16:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-77",
        "id": "CVE-2023-2377",
        "impact": {},
        "last-modified": "2023-04-28T17:06:00",
        "references": [
            "https://vuldb.com/?id.227653",
            "https://vuldb.com/?ctiid.227653",
            "https://github.com/leetsun/IoT/tree/main/EdgeRouterX/CI/9"
        ],
        "summary": "A vulnerability was found in Ubiquiti EdgeRouter X up to 2.0.9-hotfix.6. It has been declared as critical. Affected by this vulnerability is an unknown functionality of the component Web Management Interface. The manipulation of the argument name leads to command injection. The attack can be launched remotely. The exploit has been disclosed to the public and may be used. The identifier VDB-227653 was assigned to this vulnerability."
    },
    {
        "Modified": "2023-04-28T17:06:00",
        "Published": "2023-04-28T16:15:00",
        "access": {},
        "assigner": "security-advisories@github.com",
        "cvss": null,
        "cwe": "CWE-200",
        "id": "CVE-2023-30853",
        "impact": {},
        "last-modified": "2023-04-28T17:06:00",
        "references": [
            "https://github.com/gradle/gradle-build-action/security/advisories/GHSA-h3qr-39j9-4r5v",
            "https://github.com/gradle/gradle-build-action/releases/tag/v2.4.2"
        ],
        "summary": "Gradle Build Action allows users to execute a Gradle Build in their GitHub Actions workflow. A vulnerability impacts GitHub workflows using the Gradle Build Action prior to version 2.4.2 that have executed the Gradle Build Tool with the configuration cache enabled, potentially exposing secrets configured for the repository.\n\nSecrets configured for GitHub Actions are normally passed to the Gradle Build Tool via environment variables. Due to the way that the Gradle Build Tool records these environment variables, they may be persisted into an entry in the GitHub Actions cache. This data stored in the GitHub Actions cache can be read by a GitHub Actions workflow running in an untrusted context, such as that running for a Pull Request submitted by a developer via a repository fork.\n\nThis vulnerability was discovered internally through code review, and we have not seen any evidence of it being exploited in the wild. However, in addition to upgrading the Gradle Build Action, affected users should delete any potentially vulnerable cache entries and may choose to rotate any potentially affected secrets.\n\nGradle Build Action v2.4.2 and newer no longer saves this sensitive data for later use, preventing ongoing leakage of secrets via the GitHub Actions Cache.\n\nWhile upgrading to the latest version of the Gradle Build Action will prevent leakage of secrets going forward, additional actions may be required due to current or previous GitHub Actions Cache entries containing this information.\n\nCurrent cache entries will remain vulnerable until they are forcibly deleted or they expire naturally after 7 days of not being used. Potentially vulnerable entries can be easily identified in the GitHub UI by searching for a cache entry with key matching `configuration-cache-*`. The maintainers recommend that users of the Gradle Build Action inspect their list of cache entries and manually delete any that match this pattern.\n\nWhile maintainers have not seen any evidence of this vulnerability being exploited, they recommend cycling any repository secrets if you cannot be certain that these have not been compromised. Compromise could occur if a user runs a GitHub Actions workflow for a pull request attempting to exploit this data. \nWarning signs to look for in a pull request include:\n- Making changes to GitHub Actions workflow files in a way that may attempt to read/extract data from the Gradle User Home or `<project-root>/.gradle` directories.\n- Making changes to Gradle build files or other executable files that may be invoked by a GitHub Actions workflow, in a way that may attempt to read/extract information from these locations.\n\nSome workarounds to limit the impact of this vulnerability are available:\n- If the Gradle project does not opt-in to using the configuration cache, then it is not vulnerable. \n- If the Gradle project does opt-in to using the configuration-cache by default, then the `--no-configuration-cache` command-line argument can be used to disable this feature in a GitHub Actions workflow.\n\nIn any case, we recommend that users carefully inspect any pull request before approving the execution of GitHub Actions workflows. It may be prudent to require approval for all PRs from external contributors."
    },
    {
        "Modified": "2023-04-28T17:06:00",
        "Published": "2023-04-28T16:15:00",
        "access": {},
        "assigner": "security-advisories@github.com",
        "cvss": null,
        "cwe": "CWE-78",
        "id": "CVE-2023-30854",
        "impact": {},
        "last-modified": "2023-04-28T17:06:00",
        "references": [
            "https://github.com/WWBN/AVideo/security/advisories/GHSA-6vrj-ph27-qfp3"
        ],
        "summary": "AVideo is an open source video platform. Prior to version 12.4, an OS Command Injection vulnerability in an authenticated endpoint `/plugin/CloneSite/cloneClient.json.php` allows attackers to achieve Remote Code Execution. This issue is fixed in version 12.4."
    },
    {
        "Modified": "2023-04-28T17:06:00",
        "Published": "2023-04-28T16:15:00",
        "access": {},
        "assigner": "security-advisories@github.com",
        "cvss": null,
        "cwe": "CWE-1385",
        "id": "CVE-2023-30856",
        "impact": {},
        "last-modified": "2023-04-28T17:06:00",
        "references": [
            "https://github.com/GitSquared/edex-ui/security/advisories/GHSA-q8xc-f2wf-ffh9",
            "https://christian-schneider.net/CrossSiteWebSocketHijacking.html",
            "https://github.com/GitSquared/edex-ui/blob/04a00c4079908788b371c6ecdefff96d0d9950f8/src/classes/terminal.class.js#L458"
        ],
        "summary": "eDEX-UI is a science fiction terminal emulator. Versions 2.2.8 and prior are vulnerable to cross-site websocket hijacking. When running eDEX-UI and browsing the web, a malicious website can connect to eDEX's internal terminal control websocket, and send arbitrary commands to the shell. The project has been archived since 2021, and as of time of publication there are no plans to patch this issue and release a new version. Some workarounds are available, including shutting down eDEX-UI when browsing the web and ensuring the eDEX terminal runs with lowest possible privileges."
    },
    {
        "Modified": "2023-04-28T17:06:00",
        "Published": "2023-04-28T16:15:00",
        "access": {},
        "assigner": "hp-security-alert@hp.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2022-31643",
        "impact": {},
        "last-modified": "2023-04-28T17:06:00",
        "references": [
            "https://support.hp.com/us-en/document/ish_7013183-7013209-16/hpsbhf03812"
        ],
        "summary": "A potential security vulnerability has been identified in the system BIOS for certain HP PC products which may allow loss of integrity. HP is releasing firmware updates to mitigate the potential vulnerability."
    },
    {
        "Modified": "2023-04-28T17:06:00",
        "Published": "2023-04-28T16:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-77",
        "id": "CVE-2023-2376",
        "impact": {},
        "last-modified": "2023-04-28T17:06:00",
        "references": [
            "https://vuldb.com/?id.227652",
            "https://vuldb.com/?ctiid.227652",
            "https://github.com/leetsun/IoT/tree/main/EdgeRouterX/CI/8"
        ],
        "summary": "A vulnerability was found in Ubiquiti EdgeRouter X up to 2.0.9-hotfix.6. It has been classified as critical. Affected is an unknown function of the component Web Management Interface. The manipulation of the argument dpi leads to command injection. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used. The identifier of this vulnerability is VDB-227652."
    },
    {
        "Modified": "2023-04-28T17:06:00",
        "Published": "2023-04-28T16:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-77",
        "id": "CVE-2023-2378",
        "impact": {},
        "last-modified": "2023-04-28T17:06:00",
        "references": [
            "https://vuldb.com/?id.227654",
            "https://vuldb.com/?ctiid.227654",
            "https://github.com/leetsun/IoT/tree/main/EdgeRouterX/CI/4"
        ],
        "summary": "A vulnerability was found in Ubiquiti EdgeRouter X up to 2.0.9-hotfix.6. It has been rated as critical. Affected by this issue is some unknown functionality of the component Web Management Interface. The manipulation of the argument suffix-rate-up leads to command injection. The attack may be launched remotely. The exploit has been disclosed to the public and may be used. VDB-227654 is the identifier assigned to this vulnerability."
    },
    {
        "Modified": "2023-04-28T17:06:00",
        "Published": "2023-04-28T14:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-28471",
        "impact": {},
        "last-modified": "2023-04-28T17:06:00",
        "references": [
            "https://concretecms.com",
            "https://www.concretecms.org/about/project-news/security/concrete-cms-security-advisory-2023-04-20"
        ],
        "summary": "Concrete CMS (previously concrete5) before 9.2 is vulnerable to Stored XSS via a container name."
    },
    {
        "Modified": "2023-04-28T17:06:00",
        "Published": "2023-04-28T14:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-28472",
        "impact": {},
        "last-modified": "2023-04-28T17:06:00",
        "references": [
            "https://concretecms.com",
            "https://www.concretecms.org/about/project-news/security/concrete-cms-security-advisory-2023-04-20"
        ],
        "summary": "Concrete CMS (previously concrete5) before 9.2 does not have Secure and HTTP only attributes set for ccmPoll cookies."
    },
    {
        "Modified": "2023-04-28T17:06:00",
        "Published": "2023-04-28T14:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-28476",
        "impact": {},
        "last-modified": "2023-04-28T17:06:00",
        "references": [
            "https://concretecms.com",
            "https://www.concretecms.org/about/project-news/security/concrete-cms-security-advisory-2023-04-20"
        ],
        "summary": "Concrete CMS (previously concrete5) before 9.2 is vulnerable to Stored XSS on Tags on uploaded files."
    },
    {
        "Modified": "2023-04-28T17:06:00",
        "Published": "2023-04-28T14:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-28477",
        "impact": {},
        "last-modified": "2023-04-28T17:06:00",
        "references": [
            "https://concretecms.com",
            "https://www.concretecms.org/about/project-news/security/concrete-cms-security-advisory-2023-04-20"
        ],
        "summary": "Concrete CMS (previously concrete5) before 9.2 is vulnerable to stored XSS on API Integrations via the name parameter."
    },
    {
        "Modified": "2023-04-28T17:06:00",
        "Published": "2023-04-28T14:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-89",
        "id": "CVE-2023-2370",
        "impact": {},
        "last-modified": "2023-04-28T17:06:00",
        "references": [
            "https://vuldb.com/?id.227646",
            "https://github.com/aieouZZ/bug_report/blob/main/SQLi-1.md",
            "https://vuldb.com/?ctiid.227646"
        ],
        "summary": "A vulnerability classified as critical has been found in SourceCodester Online DJ Management System 1.0. Affected is an unknown function of the file admin/events/manage_event.php of the component GET Parameter Handler. The manipulation of the argument id leads to sql injection. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used. VDB-227646 is the identifier assigned to this vulnerability."
    },
    {
        "Modified": "2023-04-28T17:06:00",
        "Published": "2023-04-28T14:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-89",
        "id": "CVE-2023-2371",
        "impact": {},
        "last-modified": "2023-04-28T17:06:00",
        "references": [
            "https://github.com/yoyoyoyoyohane/bug_report/blob/main/SQLi-1.md",
            "https://vuldb.com/?id.227647",
            "https://vuldb.com/?ctiid.227647"
        ],
        "summary": "A vulnerability classified as critical was found in SourceCodester Online DJ Management System 1.0. Affected by this vulnerability is an unknown functionality of the file admin/inquiries/view_details.php of the component GET Parameter Handler. The manipulation of the argument id leads to sql injection. The attack can be launched remotely. The exploit has been disclosed to the public and may be used. The associated identifier of this vulnerability is VDB-227647."
    },
    {
        "Modified": "2023-04-28T17:06:00",
        "Published": "2023-04-28T14:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-30123",
        "impact": {},
        "last-modified": "2023-04-28T17:06:00",
        "references": [
            "https://github.com/wuzhicms/wuzhicms/issues/205#issue-1635153937"
        ],
        "summary": "wuzhicms v4.1.0 is vulnerable to Cross Site Scripting (XSS) in the Member Center, Account Settings."
    },
    {
        "Modified": "2023-04-28T17:06:00",
        "Published": "2023-04-28T14:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-30125",
        "impact": {},
        "last-modified": "2023-04-28T17:06:00",
        "references": [
            "https://github.com/weng-xianhu/eyoucms/issues/40"
        ],
        "summary": "EyouCms V1.6.1-UTF8-sp1 is vulnerable to Cross Site Scripting (XSS)."
    },
    {
        "Modified": "2023-04-28T17:06:00",
        "Published": "2023-04-28T15:15:00",
        "access": {},
        "assigner": "security@hypr.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-0834",
        "impact": {},
        "last-modified": "2023-04-28T17:06:00",
        "references": [
            "https://www.hypr.com/security-advisories"
        ],
        "summary": "Incorrect Permission Assignment for Critical Resource vulnerability in HYPR Workforce Access on MacOS allows Privilege Escalation.This issue affects Workforce Access: from 6.12 before 8.1.\n\n"
    },
    {
        "Modified": "2023-04-28T17:06:00",
        "Published": "2023-04-28T15:15:00",
        "access": {},
        "assigner": "security@hypr.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-1477",
        "impact": {},
        "last-modified": "2023-04-28T17:06:00",
        "references": [
            "https://www.hypr.com/security-advisories"
        ],
        "summary": "Improper Authentication vulnerability in HYPR Keycloak Authenticator Extension allows Authentication Abuse.This issue affects HYPR Keycloak Authenticator Extension: before 7.10.2, before 8.0.3.\n\n"
    },
    {
        "Modified": "2023-04-28T17:06:00",
        "Published": "2023-04-28T15:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-29815",
        "impact": {},
        "last-modified": "2023-04-28T17:06:00",
        "references": [
            "https://github.com/chshcms/mccms/issues/3"
        ],
        "summary": "mccms v2.6.3 is vulnerable to Cross Site Request Forgery (CSRF)."
    },
    {
        "Modified": "2023-04-28T17:06:00",
        "Published": "2023-04-28T15:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-77",
        "id": "CVE-2023-2374",
        "impact": {},
        "last-modified": "2023-04-28T17:06:00",
        "references": [
            "https://vuldb.com/?id.227650",
            "https://vuldb.com/?ctiid.227650",
            "https://github.com/leetsun/IoT/tree/main/EdgeRouterX/CI/6"
        ],
        "summary": "A vulnerability has been found in Ubiquiti EdgeRouter X up to 2.0.9-hotfix.6 and classified as critical. This vulnerability affects unknown code of the component Web Management Interface. The manipulation of the argument ecn-down leads to command injection. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used. VDB-227650 is the identifier assigned to this vulnerability."
    },
    {
        "Modified": "2023-04-28T17:06:00",
        "Published": "2023-04-28T15:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-77",
        "id": "CVE-2023-2375",
        "impact": {},
        "last-modified": "2023-04-28T17:06:00",
        "references": [
            "https://vuldb.com/?id.227651",
            "https://vuldb.com/?ctiid.227651",
            "https://github.com/leetsun/IoT/tree/main/EdgeRouterX/CI/7"
        ],
        "summary": "A vulnerability was found in Ubiquiti EdgeRouter X up to 2.0.9-hotfix.6 and classified as critical. This issue affects some unknown processing of the component Web Management Interface. The manipulation of the argument src leads to command injection. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. The associated identifier of this vulnerability is VDB-227651."
    },
    {
        "Modified": "2023-04-28T17:06:00",
        "Published": "2023-04-28T14:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-28473",
        "impact": {},
        "last-modified": "2023-04-28T17:06:00",
        "references": [
            "https://concretecms.com",
            "https://www.concretecms.org/about/project-news/security/concrete-cms-security-advisory-2023-04-20"
        ],
        "summary": "Concrete CMS (previously concrete5) before 9.2 is vulnerable to possible Auth bypass in the jobs section."
    },
    {
        "Modified": "2023-04-28T17:06:00",
        "Published": "2023-04-28T14:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-28474",
        "impact": {},
        "last-modified": "2023-04-28T17:06:00",
        "references": [
            "https://concretecms.com",
            "https://www.concretecms.org/about/project-news/security/concrete-cms-security-advisory-2023-04-20"
        ],
        "summary": "Concrete CMS (previously concrete5) before 9.2 is vulnerable to Stored XSS on Saved Presets on search."
    },
    {
        "Modified": "2023-04-28T17:06:00",
        "Published": "2023-04-28T14:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-28475",
        "impact": {},
        "last-modified": "2023-04-28T17:06:00",
        "references": [
            "https://concretecms.com",
            "https://www.concretecms.org/about/project-news/security/concrete-cms-security-advisory-2023-04-20"
        ],
        "summary": "Concrete CMS (previously concrete5) before 9.2 is vulnerable to Reflected XSS on the Reply form because msgID was not sanitized."
    },
    {
        "Modified": "2023-04-28T17:06:00",
        "Published": "2023-04-28T14:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-28819",
        "impact": {},
        "last-modified": "2023-04-28T17:06:00",
        "references": [
            "https://github.com/concretecms/concretecms/releases",
            "https://www.concretecms.org/about/project-news/security/concrete-cms-security-advisory-2023-04-20"
        ],
        "summary": "Concrete CMS (previously concrete5) before 9.1 is vulnerable to Stored XSS in uploaded file and folder names."
    },
    {
        "Modified": "2023-04-28T17:06:00",
        "Published": "2023-04-28T14:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-28820",
        "impact": {},
        "last-modified": "2023-04-28T17:06:00",
        "references": [
            "https://github.com/concretecms/concretecms/releases",
            "https://www.concretecms.org/about/project-news/security/concrete-cms-security-advisory-2023-04-20"
        ],
        "summary": "Concrete CMS (previously concrete5) before 9.1 is vulnerable to stored XSS in RSS Displayer via the href attribute because the link element input was not sanitized."
    },
    {
        "Modified": "2023-04-28T17:06:00",
        "Published": "2023-04-28T14:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-28821",
        "impact": {},
        "last-modified": "2023-04-28T17:06:00",
        "references": [
            "https://github.com/concretecms/concretecms/releases",
            "https://www.concretecms.org/about/project-news/security/concrete-cms-security-advisory-2023-04-20"
        ],
        "summary": "Concrete CMS (previously concrete5) before 9.1 did not have a rate limit for password resets."
    },
    {
        "Modified": "2023-04-28T17:06:00",
        "Published": "2023-04-28T14:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-79",
        "id": "CVE-2023-2372",
        "impact": {},
        "last-modified": "2023-04-28T17:06:00",
        "references": [
            "https://vuldb.com/?id.227648",
            "https://github.com/yoyoyoyoyohane/bug_report/blob/main/XSS-1.md",
            "https://vuldb.com/?ctiid.227648"
        ],
        "summary": "A vulnerability, which was classified as problematic, has been found in SourceCodester Online DJ Management System 1.0. Affected by this issue is some unknown functionality of the file classes/Master.php?f=save_event. The manipulation of the argument name leads to cross site scripting. The attack may be launched remotely. The exploit has been disclosed to the public and may be used. The identifier of this vulnerability is VDB-227648."
    },
    {
        "Modified": "2023-04-28T17:06:00",
        "Published": "2023-04-28T14:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-77",
        "id": "CVE-2023-2373",
        "impact": {},
        "last-modified": "2023-04-28T17:06:00",
        "references": [
            "https://vuldb.com/?id.227649",
            "https://github.com/leetsun/IoT/tree/main/EdgeRouterX/CI/5",
            "https://vuldb.com/?ctiid.227649"
        ],
        "summary": "A vulnerability, which was classified as critical, was found in Ubiquiti EdgeRouter X up to 2.0.9-hotfix.6. This affects an unknown part of the component Web Management Interface. The manipulation of the argument ecn-up leads to command injection. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used. The identifier VDB-227649 was assigned to this vulnerability."
    },
    {
        "Modified": "2023-04-28T17:06:00",
        "Published": "2023-04-28T14:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-30183",
        "impact": {},
        "last-modified": "2023-04-28T17:06:00",
        "references": [
            "https://github.com/xnx3/wangmarket/issues/7"
        ],
        "summary": "Wangmarket CMS v4.10 was discovered to contain a SQL injection vulnerability via the component /plugin/dataDictionary/tableView.do?tableName=."
    },
    {
        "Modified": "2023-04-28T17:06:00",
        "Published": "2020-06-10T17:15:00",
        "access": {
            "authentication": "NONE",
            "complexity": "LOW",
            "vector": "LOCAL"
        },
        "assigner": "productcert@siemens.com",
        "cvss": 7.2,
        "cvss-time": "2023-04-28T17:06:00",
        "cvss-vector": "AV:L/AC:L/Au:N/C:C/I:C/A:C",
        "cwe": "CWE-428",
        "id": "CVE-2020-7580",
        "impact": {
            "availability": "COMPLETE",
            "confidentiality": "COMPLETE",
            "integrity": "COMPLETE"
        },
        "last-modified": "2023-04-28T17:06:00",
        "references": [
            "https://cert-portal.siemens.com/productcert/pdf/ssa-312271.pdf",
            "https://us-cert.cisa.gov/ics/advisories/icsa-20-161-04"
        ],
        "summary": "A vulnerability has been identified in SIMATIC Automation Tool (All versions < V4 SP2), SIMATIC NET PC Software V14 (All versions < V14 SP1 Update 14), SIMATIC NET PC Software V15 (All versions), SIMATIC NET PC Software V16 (All versions < V16 Upd3), SIMATIC PCS neo (All versions < V3.0 SP1), SIMATIC ProSave (All versions < V17), SIMATIC S7-1500 Software Controller (All versions < V21.8), SIMATIC STEP 7 (TIA Portal) V13 (All versions < V13 SP2 Update 4), SIMATIC STEP 7 (TIA Portal) V14 (All versions < V14 SP1 Update 10), SIMATIC STEP 7 (TIA Portal) V15 (All versions < V15.1 Update 5), SIMATIC STEP 7 (TIA Portal) V16 (All versions < V16 Update 2), SIMATIC STEP 7 V5 (All versions < V5.6 SP2 HF3), SIMATIC WinCC OA V3.16 (All versions < V3.16 P018), SIMATIC WinCC OA V3.17 (All versions < V3.17 P003), SIMATIC WinCC Runtime Advanced (All versions < V16 Update 2), SIMATIC WinCC Runtime Professional V13 (All versions < V13 SP2 Update 4), SIMATIC WinCC Runtime Professional V14 (All versions < V14 SP1 Update 10), SIMATIC WinCC Runtime Professional V15 (All versions < V15.1 Update 5), SIMATIC WinCC Runtime Professional V16 (All versions < V16 Update 2), SIMATIC WinCC V7.4 (All versions < V7.4 SP1 Update 14), SIMATIC WinCC V7.5 (All versions < V7.5 SP1 Update 3), SINAMICS STARTER (All Versions < V5.4 HF2), SINAMICS Startdrive (All Versions < V16 Update 3), SINEC NMS (All versions < V1.0 SP2), SINEMA Server (All versions < V14 SP3), SINUMERIK ONE virtual (All Versions < V6.14), SINUMERIK Operate (All Versions < V6.14). A common component used by the affected applications regularly calls a helper binary with SYSTEM privileges while the call path is not quoted. This could allow a local attacker to execute arbitrary code with SYTEM privileges."
    },
    {
        "Modified": "2023-04-28T16:15:00",
        "Published": "2023-04-21T15:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "CWE-89",
        "id": "CVE-2023-26876",
        "impact": {},
        "last-modified": "2023-04-28T16:15:00",
        "references": [
            "https://gist.github.com/rodnt/a190d14d1715890d8df19bad58b90693",
            "https://piwigo.com",
            "https://www.tempest.com.br",
            "http://seclists.org/fulldisclosure/2023/Apr/13",
            "http://packetstormsecurity.com/files/172059/Piwigo-13.5.0-SQL-Injection.html"
        ],
        "summary": "SQL injection vulnerability found in Piwigo v.13.5.0 and before allows a remote attacker to execute arbitrary code via the filter_user_id parameter to the admin.php?page=history&filter_image_id=&filter_user_id endpoint."
    },
    {
        "Modified": "2023-04-28T15:56:00",
        "Published": "2023-04-17T07:15:00",
        "access": {},
        "assigner": "security@apache.org",
        "cvss": null,
        "cwe": "CWE-287",
        "id": "CVE-2023-24831",
        "impact": {},
        "last-modified": "2023-04-28T15:56:00",
        "references": [
            "https://lists.apache.org/thread/3dgvzgstycf8b5hyf4z3n7cqdhcyln3l"
        ],
        "summary": "Improper Authentication vulnerability in Apache Software Foundation Apache IoTDB.This issue affects Apache IoTDB Grafana Connector: from 0.13.0 through 0.13.3.\n\nAttackers could login without authorization. This is fixed in 0.13.4."
    },
    {
        "Modified": "2023-04-28T15:15:00",
        "Published": "2023-04-24T15:15:00",
        "access": {},
        "assigner": "security@huntr.dev",
        "cvss": null,
        "cwe": "CWE-248",
        "id": "CVE-2023-2251",
        "impact": {},
        "last-modified": "2023-04-28T15:15:00",
        "references": [
            "https://github.com/eemeli/yaml/commit/984f5781ffd807e58cad3b5c8da1f940dab75fba",
            "https://huntr.dev/bounties/4b494e99-5a3e-40d9-8678-277f3060e96c"
        ],
        "summary": "Uncaught Exception in GitHub repository eemeli/yaml prior to 2.0.0-4."
    },
    {
        "Modified": "2023-04-28T15:15:00",
        "Published": "2023-04-19T00:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "CWE-20",
        "id": "CVE-2023-27043",
        "impact": {},
        "last-modified": "2023-04-28T15:15:00",
        "references": [
            "https://github.com/python/cpython/issues/102988",
            "http://python.org"
        ],
        "summary": "The e-mail module of Python 0 - 2.7.18, 3.x - 3.11 incorrectly parses e-mail addresses which contain a special character. This vulnerability allows attackers to send messages from e-ail addresses that would otherwise be rejected."
    },
    {
        "Modified": "2023-04-28T15:03:00",
        "Published": "2023-03-14T17:15:00",
        "access": {},
        "assigner": "secure@microsoft.com",
        "cvss": null,
        "cwe": "NVD-CWE-noinfo",
        "id": "CVE-2023-24911",
        "impact": {},
        "last-modified": "2023-04-28T15:03:00",
        "references": [
            "https://msrc.microsoft.com/update-guide/vulnerability/CVE-2023-24911"
        ],
        "summary": "Microsoft PostScript and PCL6 Class Printer Driver Information Disclosure Vulnerability"
    },
    {
        "Modified": "2023-04-28T15:02:00",
        "Published": "2023-03-14T17:15:00",
        "access": {},
        "assigner": "secure@microsoft.com",
        "cvss": null,
        "cwe": "NVD-CWE-noinfo",
        "id": "CVE-2023-24922",
        "impact": {},
        "last-modified": "2023-04-28T15:02:00",
        "references": [
            "https://msrc.microsoft.com/update-guide/vulnerability/CVE-2023-24922"
        ],
        "summary": "Microsoft Dynamics 365 Information Disclosure Vulnerability"
    },
    {
        "Modified": "2023-04-28T14:32:00",
        "Published": "2023-04-17T22:15:00",
        "access": {},
        "assigner": "sirt@juniper.net",
        "cvss": null,
        "cwe": "CWE-434",
        "id": "CVE-2023-28962",
        "impact": {},
        "last-modified": "2023-04-28T14:32:00",
        "references": [
            "https://supportportal.juniper.net/JSA70587"
        ],
        "summary": "An Improper Authentication vulnerability in upload-file.php, used by the J-Web component of Juniper Networks Junos OS allows an unauthenticated, network-based attacker to upload arbitrary files to temporary folders on the device. This issue affects Juniper Networks Junos OS: All versions prior to 19.4R3-S11; 20.1 version 20.1R1 and later versions; 20.2 versions prior to 20.2R3-S7; 20.3 version 20.3R1 and later versions; 20.4 versions prior to 20.4R3-S6; 21.1 version 21.1R1 and later versions; 21.2 versions prior to 21.2R3-S4; 21.3 versions prior to 21.3R3-S3; 21.4 versions prior to 21.4R3-S3; 22.1 versions prior to 22.1R3-S1; 22.2 versions prior to 22.2R2-S1, 22.2R3; 22.3 versions prior to 22.3R1-S2, 22.3R2."
    },
    {
        "Modified": "2023-04-28T14:31:00",
        "Published": "2023-04-17T22:15:00",
        "access": {},
        "assigner": "sirt@juniper.net",
        "cvss": null,
        "cwe": "NVD-CWE-Other",
        "id": "CVE-2023-28961",
        "impact": {},
        "last-modified": "2023-04-28T14:31:00",
        "references": [
            "https://supportportal.juniper.net/JSA70586"
        ],
        "summary": "An Improper Handling of Unexpected Data Type vulnerability in IPv6 firewall filter processing of Juniper Networks Junos OS on the ACX Series devices will prevent a firewall filter with the term 'from next-header ah' from being properly installed in the packet forwarding engine (PFE). There is no immediate indication of an incomplete firewall filter commit shown at the CLI, which could allow an attacker to send valid packets to or through the device that were explicitly intended to be dropped. An indication that the filter was not installed can be identified with the following logs: fpc0 ACX_DFW_CFG_FAILED: ACX Error (dfw):dnx_dfw_rule_prepare : Config failed: Unsupported Ip-protocol 51 in the filter lo0.0-inet6-i fpc0 ACX_DFW_CFG_FAILED: ACX Error (dfw):dnx_dfw_rule_prepare : Please detach the filter, remove unsupported match and re-attach fpc0 ACX_DFW_CFG_FAILED: ACX Error (dfw):dnx_dfw_process_rule : Status:104 dnx_dfw_rule_prepare failed fpc0 ACX_DFW_CFG_FAILED: ACX Error (dfw):dnx_dfw_process_filter : Status:104 dnx_dfw_process_rule failed fpc0 ACX_DFW_CFG_FAILED: ACX Error (dfw):dnx_dfw_update_filter_in_hw : Status:104 Could not process filter(lo0.0-inet6-i) for rule expansion Unsupported match, action present. fpc0 ACX_DFW_CFG_FAILED: ACX Error (dfw):dnx_dfw_create_hw_instance : Status:104 Could not program dfw(lo0.0-inet6-i) type(IFP_DFLT_INET6_Lo0_FILTER)! [104] fpc0 ACX_DFW_CFG_FAILED: ACX Error (dfw):dnx_dfw_bind_shim : [104] Could not create dfw(lo0.0-inet6-i) type(IFP_DFLT_INET6_Lo0_FILTER) fpc0 ACX_DFW_CFG_FAILED: ACX Error (dfw):dnx_dfw_update_resolve : [100] Failed to bind filter(3) to bind point fpc0 ACX_DFW_CFG_FAILED: ACX Error (dfw):dnx_dfw_change_end : dnx_dfw_update_resolve (resolve type) failed This issue affects Juniper Networks Junos OS on ACX Series: All versions prior to 20.2R3-S7; 20.4 versions prior to 20.4R3-S4; 21.1 versions prior to 21.1R3-S3; 21.2 versions prior to 21.2R3-S4; 21.3 versions prior to 21.3R3; 21.4 versions prior to 21.4R3; 22.1 versions prior to 22.1R2."
    },
    {
        "Modified": "2023-04-28T14:28:00",
        "Published": "2023-04-17T22:15:00",
        "access": {},
        "assigner": "sirt@juniper.net",
        "cvss": null,
        "cwe": "CWE-732",
        "id": "CVE-2023-28960",
        "impact": {},
        "last-modified": "2023-04-28T14:28:00",
        "references": [
            "https://supportportal.juniper.net/JSA70585"
        ],
        "summary": "An Incorrect Permission Assignment for Critical Resource vulnerability in Juniper Networks Junos OS Evolved allows a local, authenticated low-privileged attacker to copy potentially malicious files into an existing Docker container on the local system. A follow-on administrator could then inadvertently start the Docker container leading to the malicious files being executed as root. This issue only affects systems with Docker configured and enabled, which is not enabled by default. Systems without Docker started are not vulnerable to this issue. This issue affects Juniper Networks Junos OS Evolved: 20.4 versions prior to 20.4R3-S5-EVO; 21.2 versions prior to 21.2R3-EVO; 21.3 versions prior to 21.3R3-EVO; 21.4 versions prior to 21.4R2-EVO. This issue does not affect Juniper Networks Junos OS Evolved versions prior to 19.2R1-EVO."
    },
    {
        "Modified": "2023-04-28T14:28:00",
        "Published": "2023-04-17T22:15:00",
        "access": {},
        "assigner": "sirt@juniper.net",
        "cvss": null,
        "cwe": "CWE-703",
        "id": "CVE-2023-28959",
        "impact": {},
        "last-modified": "2023-04-28T14:28:00",
        "references": [
            "https://supportportal.juniper.net/JSA70584"
        ],
        "summary": "An Improper Check or Handling of Exceptional Conditions vulnerability in packet processing of Juniper Networks Junos OS on QFX10002 allows an unauthenticated, adjacent attacker on the local broadcast domain sending a malformed packet to the device, causing all PFEs other than the inbound PFE to wedge and to eventually restart, resulting in a Denial of Service (DoS) condition. Continued receipt and processing of this packet will create a sustained Denial of Service (DoS) condition. This issue can only be triggered by sending a specific malformed packet to the device. Transit traffic does not trigger this issue. An indication of this issue occurring can be seen through the following log messages: fpc0 expr_hostbound_packet_handler: Receive pe 73? fpc0 Cmerror Op Set: PE Chip: PE0[0]: PGQ:misc_intr: 0x00000020: Enqueue of a packet with out-of-range VOQ in 192K-VOQ mode (URI: /fpc/0/pfe/0/cm/0/PE_Chip/0/PECHIP_CMERROR_PGQ_MISC_INT_EVENTS_ENQ_192K_VIOL) The logs list below can also be observed when this issue occurs fpc0 Error: /fpc/0/pfe/0/cm/0/PE_Chip/0/PECHIP_CMERROR_PGQ_MISC_INT_EVENTS_ENQ_192K_VIOL (0x210107), scope: pfe, category: functional, severity: major, module: PE Chip, type: Description for PECHIP_CMERROR_PGQ_MISC_INT_EVENTS_ENQ_192K_VIOL fpc0 Performing action cmalarm for error /fpc/0/pfe/0/cm/0/PE_Chip/0/PECHIP_CMERROR_PGQ_MISC_INT_EVENTS_ENQ_192K_VIOL (0x210107) in module: PE Chip with scope: pfe category: functional level: major fpc0 Error: /fpc/0/pfe/0/cm/0/PE_Chip/0/PECHIP_CMERROR_CM_INT_REG_DCHK_PIPE (0x21011a), scope: pfe, category: functional, severity: fatal, module: PE Chip, type: Description for PECHIP_CMERROR_CM_INT_REG_DCHK_PIPE fpc0 Performing action cmalarm for error /fpc/0/pfe/0/cm/0/PE_Chip/0/PECHIP_CMERROR_CM_INT_REG_DCHK_PIPE (0x21011a) in module: PE Chip with scope: pfe category: functional level: fatal fpc0 Performing action disable-pfe for error /fpc/0/pfe/0/cm/0/PE_Chip/0/PECHIP_CMERROR_CM_INT_REG_DCHK_PIPE (0x21011a) in module: PE Chip with scope: pfe category: functional level: fatal This issue affects Juniper Networks Junos OS on QFX10002: All versions prior to 19.1R3-S10; 19.4 versions prior to 19.4R3-S11; 20.2 versions prior to 20.2R3-S7; 20.4 versions prior to 20.4R3-S6; 21.1 versions prior to 21.1R3-S4; 21.2 versions prior to 21.2R3-S4; 21.3 versions prior to 21.3R3-S3; 21.4 versions prior to 21.4R3-S2; 22.1 versions prior to 22.1R3-S1; 22.2 versions prior to 22.2R2-S1, 22.2R3; 22.3 versions prior to 22.3R1-S2, 22.3R2."
    },
    {
        "Modified": "2023-04-28T14:28:00",
        "Published": "2023-04-17T20:15:00",
        "access": {},
        "assigner": "disclosures@halborn.com",
        "cvss": null,
        "cwe": "NVD-CWE-noinfo",
        "id": "CVE-2023-30769",
        "impact": {},
        "last-modified": "2023-04-28T14:28:00",
        "references": [
            "https://www.halborn.com/disclosures",
            "https://www.halborn.com/blog/post/halborn-discovers-zero-day-impacting-dogecoin-and-280-networks"
        ],
        "summary": "Vulnerability discovered is related to the peer-to-peer (p2p) communications, attackers can craft consensus messages, send it to individual nodes and take them offline. An attacker can crawl the network peers using getaddr message and attack the unpatched nodes."
    },
    {
        "Modified": "2023-04-28T14:27:00",
        "Published": "2023-04-17T11:15:00",
        "access": {},
        "assigner": "info@starlabs.sg",
        "cvss": null,
        "cwe": "CWE-94",
        "id": "CVE-2023-2017",
        "impact": {},
        "last-modified": "2023-04-28T14:27:00",
        "references": [
            "https://docs.shopware.com/en/shopware-6-en/security-updates/security-update-04-2023",
            "https://github.com/shopware/platform/security/advisories/GHSA-7v2v-9rm4-7m8f",
            "https://starlabs.sg/advisories/23/23-2017/"
        ],
        "summary": "Server-side Template Injection (SSTI) in Shopware 6 (<= v6.4.20.0, v6.5.0.0-rc1 <= v6.5.0.0-rc4), affecting both shopware/core and shopware/platform GitHub repositories, allows remote attackers with access to a Twig environment without the Sandbox extension to bypass the validation checks in `Shopware\\Core\\Framework\\Adapter\\Twig\\SecurityExtension` and call any arbitrary PHP function and thus execute arbitrary code/commands via usage of fully-qualified names, supplied as array of strings, when referencing callables. Users are advised to upgrade to v6.4.20.1 to resolve this issue. This is a bypass of CVE-2023-22731.\n"
    },
    {
        "Modified": "2023-04-28T14:27:00",
        "Published": "2023-04-15T02:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "CWE-290",
        "id": "CVE-2022-47522",
        "impact": {},
        "last-modified": "2023-04-28T14:27:00",
        "references": [
            "https://psirt.global.sonicwall.com/vuln-detail/SNWLID-2023-0006",
            "https://papers.mathyvanhoef.com/usenix2023-wifi.pdf",
            "https://www.wi-fi.org/discover-wi-fi/passpoint"
        ],
        "summary": "The IEEE 802.11 specifications through 802.11ax allow physically proximate attackers to intercept (possibly cleartext) target-destined frames by spoofing a target's MAC address, sending Power Save frames to the access point, and then sending other frames to the access point (such as authentication frames or re-association frames) to remove the target's original security context. This behavior occurs because the specifications do not require an access point to purge its transmit queue before removing a client's pairwise encryption key."
    },
    {
        "Modified": "2023-04-28T14:25:00",
        "Published": "2023-04-17T22:15:00",
        "access": {},
        "assigner": "sirt@juniper.net",
        "cvss": null,
        "cwe": "CWE-754",
        "id": "CVE-2023-28974",
        "impact": {},
        "last-modified": "2023-04-28T14:25:00",
        "references": [
            "https://supportportal.juniper.net/JSA70599"
        ],
        "summary": "An Improper Check for Unusual or Exceptional Conditions vulnerability in the bbe-smgd of Juniper Networks Junos OS allows an unauthenticated, adjacent attacker to cause a Denial of Service (DoS). In a Broadband Edge / Subscriber Management scenario on MX Series when a specifically malformed ICMP packet addressed to the device is received from a subscriber the bbe-smgd will crash, affecting the subscriber sessions that are connecting, updating, or terminating. Continued receipt of such packets will lead to a sustained DoS condition. When this issue happens the below log can be seen if the traceoptions for the processes smg-service are enabled: BBE_TRACE(TRACE_LEVEL_INFO, \"%s: Dropped unsupported ICMP PKT ... This issue affects Juniper Networks Junos OS on MX Series: All versions prior to 19.4R3-S11; 20.2 versions prior to 20.2R3-S7; 20.3 versions prior to 20.3R3-S6; 20.4 versions prior to 20.4R3-S6; 21.1 versions prior to 21.1R3-S4; 21.2 versions prior to 21.2R3-S4; 21.3 versions prior to 21.3R3-S3; 21.4 versions prior to 21.4R3-S2; 22.1 versions prior to 22.1R2-S2, 22.1R3; 22.2 versions prior to 22.2R2; 22.3 versions prior to 22.3R1-S2, 22.3R2."
    },
    {
        "Modified": "2023-04-28T14:24:00",
        "Published": "2023-04-17T22:15:00",
        "access": {},
        "assigner": "sirt@juniper.net",
        "cvss": null,
        "cwe": "CWE-287",
        "id": "CVE-2023-28973",
        "impact": {},
        "last-modified": "2023-04-28T14:24:00",
        "references": [
            "https://supportportal.juniper.net/JSA70597"
        ],
        "summary": "An Improper Authorization vulnerability in the 'sysmanctl' shell command of Juniper Networks Junos OS Evolved allows a local, authenticated attacker to execute administrative commands that could impact the integrity of the system or system availability. Administrative functions such as daemon restarting, routing engine (RE) switchover, and node shutdown can all be performed through exploitation of the 'sysmanctl' command. Access to the 'sysmanctl' command is only available from the Junos shell. Neither direct nor indirect access to 'sysmanctl' is available from the Junos CLI. This issue affects Juniper Networks Junos OS Evolved: All versions prior to 20.4R3-S5-EVO; 21.2 versions prior to 21.2R3-EVO; 21.3 versions prior to 21.3R2-EVO; 21.4 versions prior to 21.4R1-S2-EVO, 21.4R2-EVO."
    },
    {
        "Modified": "2023-04-28T14:23:00",
        "Published": "2023-04-17T22:15:00",
        "access": {},
        "assigner": "sirt@juniper.net",
        "cvss": null,
        "cwe": "CWE-59",
        "id": "CVE-2023-28972",
        "impact": {},
        "last-modified": "2023-04-28T14:23:00",
        "references": [
            "https://supportportal.juniper.net/JSA70596"
        ],
        "summary": "An Improper Link Resolution Before File Access vulnerability in console port access of Juniper Networks Junos OS on NFX Series allows an attacker to bypass console access controls. When \"set system ports console insecure\" is enabled, root login is disallowed for Junos OS as expected. However, the root password can be changed using \"set system root-authentication plain-text-password\" on NFX Series systems, leading to a possible administrative bypass with physical access to the console. Password recovery, changing the root password from a console, should not have been allowed from an insecure console. This is similar to the vulnerability described in CVE-2019-0035 but affects different platforms and in turn requires a different fix. This issue affects Juniper Networks Junos OS on NFX Series: 19.2 versions prior to 19.2R3-S7; 19.3 versions prior to 19.3R3-S8; 19.4 versions prior to 19.4R3-S12; 20.2 versions prior to 20.2R3-S8; 20.4 versions prior to 20.4R3-S7; 21.1 versions prior to 21.1R3-S5; 21.2 versions prior to 21.2R3-S4; 21.3 versions prior to 21.3R3-S3; 21.4 versions prior to 21.4R3-S2; 22.1 versions prior to 22.1R3-S1; 22.2 versions prior to 22.2R2-S1, 22.2R3; 22.3 versions prior to 22.3R1-S2, 22.3R2."
    },
    {
        "Modified": "2023-04-28T14:11:00",
        "Published": "2023-04-28T13:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2022-38583",
        "impact": {},
        "last-modified": "2023-04-28T14:11:00",
        "references": [
            "http://sage.com",
            "https://www.controlgap.com/blog/sage-300-case-study"
        ],
        "summary": "On versions of Sage 300 2017 - 2022 (6.4.x - 6.9.x) which are setup in a \"Windows Peer-to-Peer Network\" or \"Client Server Network\" configuration, a low-privileged Sage 300 workstation user could abuse their access to the \"SharedData\" folder on the connected Sage 300 server to view and/or modify the credentials associated with Sage 300 users and SQL accounts to impersonate users and/or access the SQL database as a system administrator. With system administrator-level access to the Sage 300 MS SQL database it would be possible to create, update, and delete all records associated with the program and, depending on the configuration, execute code on the underlying database server."
    },
    {
        "Modified": "2023-04-28T14:11:00",
        "Published": "2023-04-28T13:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2022-41397",
        "impact": {},
        "last-modified": "2023-04-28T14:11:00",
        "references": [
            "https://www.sage.com/en-ca/products/sage-300/"
        ],
        "summary": "The optional Web Screens and Global Search features for Sage 300 through version 2022 use a hard-coded 40-byte blowfish key (\"LandlordPassKey\") to encrypt and decrypt secrets stored in configuration files and in database tables."
    },
    {
        "Modified": "2023-04-28T14:11:00",
        "Published": "2023-04-28T13:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2022-41398",
        "impact": {},
        "last-modified": "2023-04-28T14:11:00",
        "references": [
            "https://www.sage.com/en-ca/products/sage-300/"
        ],
        "summary": "The optional Global Search feature for Sage 300 through version 2022 uses a set of hard-coded credentials for the accompanying Apache Solr instance. This issue could allow attackers to login to the Solr dashboard with admin privileges and access sensitive information."
    },
    {
        "Modified": "2023-04-28T14:11:00",
        "Published": "2023-04-28T13:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2022-41399",
        "impact": {},
        "last-modified": "2023-04-28T14:11:00",
        "references": [
            "https://www.sage.com/en-ca/products/sage-300/"
        ],
        "summary": "The optional Web Screens feature for Sage 300 through version 2022 uses a hard-coded 40-byte blowfish key (\"PASS_KEY\") to encrypt and decrypt the database connection string for the PORTAL database found in the \"dbconfig.xml\". This issue could allow attackers to obtain access to the SQL database."
    },
    {
        "Modified": "2023-04-28T14:11:00",
        "Published": "2023-04-28T13:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2022-41400",
        "impact": {},
        "last-modified": "2023-04-28T14:11:00",
        "references": [
            "https://www.sage.com/en-ca/products/sage-300/"
        ],
        "summary": "Sage 300 through 2022 uses a hard-coded 40-byte blowfish key to encrypt and decrypt user passwords and SQL connection strings stored in ISAM database files in the shared data directory. This issue could allow attackers to decrypt user passwords and SQL connection strings."
    },
    {
        "Modified": "2023-04-28T14:11:00",
        "Published": "2023-04-28T13:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-89",
        "id": "CVE-2023-2367",
        "impact": {},
        "last-modified": "2023-04-28T14:11:00",
        "references": [
            "https://vuldb.com/?id.227643",
            "https://vuldb.com/?ctiid.227643",
            "https://github.com/f0llow/bug_report/blob/main/vendors/oretnom23/faculty-evaluation-system/SQLi-1.md"
        ],
        "summary": "A vulnerability was found in SourceCodester Faculty Evaluation System 1.0. It has been classified as critical. This affects an unknown part of the file /admin/manage_academic.php. The manipulation of the argument id leads to sql injection. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used. The associated identifier of this vulnerability is VDB-227643."
    },
    {
        "Modified": "2023-04-28T14:11:00",
        "Published": "2023-04-28T13:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-89",
        "id": "CVE-2023-2368",
        "impact": {},
        "last-modified": "2023-04-28T14:11:00",
        "references": [
            "https://vuldb.com/?ctiid.227644",
            "https://github.com/f0llow/bug_report/blob/main/vendors/oretnom23/faculty-evaluation-system/SQLi-2.md",
            "https://vuldb.com/?id.227644"
        ],
        "summary": "A vulnerability was found in SourceCodester Faculty Evaluation System 1.0. It has been declared as critical. This vulnerability affects unknown code of the file index.php?page=manage_questionnaire. The manipulation of the argument id leads to sql injection. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used. The identifier of this vulnerability is VDB-227644."
    },
    {
        "Modified": "2023-04-28T14:11:00",
        "Published": "2023-04-28T13:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-89",
        "id": "CVE-2023-2369",
        "impact": {},
        "last-modified": "2023-04-28T14:11:00",
        "references": [
            "https://vuldb.com/?ctiid.227645",
            "https://github.com/f0llow/bug_report/blob/main/vendors/oretnom23/faculty-evaluation-system/SQLi-3.md",
            "https://vuldb.com/?id.227645"
        ],
        "summary": "A vulnerability was found in SourceCodester Faculty Evaluation System 1.0. It has been rated as critical. This issue affects some unknown processing of the file admin/manage_restriction.php. The manipulation of the argument id leads to sql injection. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. The identifier VDB-227645 was assigned to this vulnerability."
    },
    {
        "Modified": "2023-04-28T14:11:00",
        "Published": "2023-04-28T13:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-30024",
        "impact": {},
        "last-modified": "2023-04-28T14:11:00",
        "references": [
            "https://www.magicjack.com/",
            "https://samuraisecurity.co.uk/red-teaming-0x01-click-rce-via-voip-usb/",
            "https://drive.google.com/drive/folders/1cKd8hksThK610GPtBQ3du8DEkwKywlAi?usp=sharing",
            "https://pastebin.com/raw/irWcawp8"
        ],
        "summary": "Insecure Permissions vulnerability found in MagicJack A921 USB Phone Jack Rev 3.0 v.1.4 allows a physically proximate attacker to escalate privileges and gain access to sensitive information via the NAND flash memory."
    },
    {
        "Modified": "2023-04-28T14:04:00",
        "Published": "2023-04-18T16:15:00",
        "access": {},
        "assigner": "bugreport@qualys.com",
        "cvss": null,
        "cwe": "NVD-CWE-noinfo",
        "id": "CVE-2023-28141",
        "impact": {},
        "last-modified": "2023-04-28T14:04:00",
        "references": [
            "https://www.qualys.com/security-advisories/"
        ],
        "summary": "\nAn NTFS Junction condition exists in the Qualys Cloud Agent\nfor Windows platform in versions before 4.8.0.31. Attackers may write files to\narbitrary locations via a local attack vector. This allows attackers to assume\nthe privileges of the process, and they may delete or otherwise on unauthorized\nfiles, allowing for the potential modification or deletion of sensitive files\nlimited only to that specific directory/file object. This vulnerability is\nbounded to the time of installation/uninstallation and can only be exploited locally.\n\n\n\nAt the time of this disclosure, versions before 4.0 are\nclassified as End of Life.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
    },
    {
        "Modified": "2023-04-28T14:02:00",
        "Published": "2023-04-17T22:15:00",
        "access": {},
        "assigner": "sirt@juniper.net",
        "cvss": null,
        "cwe": "CWE-754",
        "id": "CVE-2023-28975",
        "impact": {},
        "last-modified": "2023-04-28T14:02:00",
        "references": [
            "https://supportportal.juniper.net/JSA70600"
        ],
        "summary": "An Unexpected Status Code or Return Value vulnerability in the kernel of Juniper Networks Junos OS allows an unauthenticated attacker with physical access to the device to cause a Denial of Service (DoS). When certain USB devices are connected to a USB port of the routing-engine (RE), the kernel will crash leading to a reboot of the device. The device will continue to crash as long as the USB device is connected. This issue affects Juniper Networks Junos OS: All versions prior to 19.4R3-S10; 20.2 versions prior to 20.2R3-S7; 20.3 versions prior to 20.3R3-S6; 20.4 versions prior to 20.4R3-S5; 21.1 versions prior to 21.1R3-S4; 21.2 versions prior to 21.2R3-S4; 21.3 versions prior to 21.3R3-S3; 21.4 versions prior to 21.4R3-S2; 22.1 versions prior to 22.1R2-S2, 22.1R3; 22.2 versions prior to 22.2R2, 22.2R3; 22.3 versions prior to 22.3R1-S1, 22.3R2; 22.4 versions prior to 22.4R2."
    },
    {
        "Modified": "2023-04-28T13:52:00",
        "Published": "2023-04-18T16:15:00",
        "access": {},
        "assigner": "bugreport@qualys.com",
        "cvss": null,
        "cwe": "CWE-427",
        "id": "CVE-2023-28140",
        "impact": {},
        "last-modified": "2023-04-28T13:52:00",
        "references": [
            "https://www.qualys.com/security-advisories/"
        ],
        "summary": "\nAn Executable Hijacking condition exists in the\nQualys Cloud Agent for Windows platform in versions before 4.5.3.1. Attackers\nmay load a malicious copy of a Dependency Link Library (DLL) via a local\nattack vector instead of the DLL that the application was expecting, when\nprocesses are running with escalated privileges. This vulnerability\nis bounded only to the time of uninstallation and can only be exploited\nlocally.\n\n\n\nAt the time of this disclosure, versions before 4.0 are classified as End of\nLife.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
    },
    {
        "Modified": "2023-04-28T13:36:00",
        "Published": "2023-04-18T18:15:00",
        "access": {},
        "assigner": "cybersecurity@schneider-electric.com",
        "cvss": null,
        "cwe": "CWE-287",
        "id": "CVE-2023-25556",
        "impact": {},
        "last-modified": "2023-04-28T13:36:00",
        "references": [
            "https://download.schneider-electric.com/files?p_Doc_Ref=SEVD-2023-045-03&p_enDocType=Security+and+Safety+Notice&p_File_Name=SEVD-2023-045-03.pdf"
        ],
        "summary": "\nA CWE-287: Improper Authentication vulnerability exists that could allow a device to be\ncompromised when a key of less than seven digits is entered and the attacker has access to the\nKNX installation.\n\n"
    },
    {
        "Modified": "2023-04-28T13:31:00",
        "Published": "2023-04-18T21:15:00",
        "access": {},
        "assigner": "cybersecurity@schneider-electric.com",
        "cvss": null,
        "cwe": "CWE-306",
        "id": "CVE-2023-29411",
        "impact": {},
        "last-modified": "2023-04-28T13:31:00",
        "references": [
            "https://download.schneider-electric.com/files?p_Doc_Ref=SEVD-2023-101-04&p_enDocType=Security+and+Safety+Notice&p_File_Name=SEVD-2023-101-04.pdf"
        ],
        "summary": "\nA CWE-306: Missing Authentication for Critical Function vulnerability exists that could allow\nchanges to administrative credentials, leading to potential remote code execution without\nrequiring prior authentication on the Java RMI interface. \n\n\n\n"
    },
    {
        "Modified": "2023-04-28T13:30:00",
        "Published": "2023-04-18T21:15:00",
        "access": {},
        "assigner": "cybersecurity@schneider-electric.com",
        "cvss": null,
        "cwe": "CWE-78",
        "id": "CVE-2023-29412",
        "impact": {},
        "last-modified": "2023-04-28T13:30:00",
        "references": [
            "https://download.schneider-electric.com/files?p_Doc_Ref=SEVD-2023-101-04&p_enDocType=Security+and+Safety+Notice&p_File_Name=SEVD-2023-101-04.pdf"
        ],
        "summary": "\n\n\nA CWE-78: Improper Handling of Case Sensitivity vulnerability exists that could cause remote\ncode execution when manipulating internal methods through Java RMI interface.\n\n \n\n\n\n"
    },
    {
        "Modified": "2023-04-28T13:26:00",
        "Published": "2023-04-18T21:15:00",
        "access": {},
        "assigner": "cybersecurity@schneider-electric.com",
        "cvss": null,
        "cwe": "CWE-306",
        "id": "CVE-2023-29413",
        "impact": {},
        "last-modified": "2023-04-28T13:26:00",
        "references": [
            "https://download.schneider-electric.com/files?p_Doc_Ref=SEVD-2023-101-04&p_enDocType=Security+and+Safety+Notice&p_File_Name=SEVD-2023-101-04.pdf"
        ],
        "summary": "\nA CWE-306: Missing Authentication for Critical Function vulnerability exists that could cause\nDenial-of-Service when accessed by an unauthenticated user on the Schneider UPS Monitor\nservice. \n\n \n\n\n\n"
    },
    {
        "Modified": "2023-04-28T13:24:00",
        "Published": "2023-04-18T22:15:00",
        "access": {},
        "assigner": "cybersecurity@schneider-electric.com",
        "cvss": null,
        "cwe": "CWE-129",
        "id": "CVE-2023-28004",
        "impact": {},
        "last-modified": "2023-04-28T13:24:00",
        "references": [
            "https://download.schneider-electric.com/files?p_Doc_Ref=SEVD-2023-073-02&p_enDocType=Security+and+Safety+Notice&p_File_Name=SEVD-2023-073-02.pdf"
        ],
        "summary": "\n\n\nA CWE-129: Improper validation of an array index vulnerability exists where a specially crafted\nEthernet request could result in denial of service or remote code execution. \n\n \n\n \n\n\n\n"
    },
    {
        "Modified": "2023-04-28T13:18:00",
        "Published": "2023-04-18T16:15:00",
        "access": {},
        "assigner": "bugreport@qualys.com",
        "cvss": null,
        "cwe": "CWE-362",
        "id": "CVE-2023-28142",
        "impact": {},
        "last-modified": "2023-04-28T13:18:00",
        "references": [
            "https://www.qualys.com/security-advisories/"
        ],
        "summary": "\nA Race Condition exists in the Qualys Cloud Agent for Windows\nplatform in versions from 3.1.3.34 and before 4.5.3.1. This allows attackers to\nescalate privileges limited on the local machine during uninstallation of the\nQualys Cloud Agent for Windows. Attackers may gain SYSTEM level privileges on\nthat asset to run arbitrary commands.\n\n\n\nAt the time of this disclosure, versions before 4.0 are classified as End\nof Life.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
    },
    {
        "Modified": "2023-04-28T13:15:00",
        "Published": "2023-04-26T00:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-26735",
        "impact": {},
        "last-modified": "2023-04-28T13:15:00",
        "references": [
            "http://blackboxexporter.com",
            "https://github.com/prometheus/blackbox_exporter/issues/1025",
            "https://github.com/prometheus/blackbox_exporter/issues/1024",
            "http://prometheus.com",
            "https://github.com/prometheus/blackbox_exporter/issues/1026",
            "https://github.com/prometheus/blackbox_exporter#tls-and-basic-authentication"
        ],
        "summary": "** DISPUTED ** blackbox_exporter v0.23.0 was discovered to contain an access control issue in its probe interface. This vulnerability allows attackers to detect intranet ports and services, as well as download resources. NOTE: this is disputed by third parties because authentication can be configured."
    },
    {
        "Modified": "2023-04-28T12:58:00",
        "Published": "2023-04-28T12:15:00",
        "access": {},
        "assigner": "security@acronis.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-2360",
        "impact": {},
        "last-modified": "2023-04-28T12:58:00",
        "references": [
            "https://security-advisory.acronis.com/advisories/SEC-4215"
        ],
        "summary": "Sensitive information disclosure due to CORS misconfiguration. The following products are affected: Acronis Cyber Infrastructure (ACI) before build 5.2.0-135."
    },
    {
        "Modified": "2023-04-28T12:58:00",
        "Published": "2023-04-28T12:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-89",
        "id": "CVE-2023-2365",
        "impact": {},
        "last-modified": "2023-04-28T12:58:00",
        "references": [
            "https://vuldb.com/?id.227641",
            "https://vuldb.com/?ctiid.227641",
            "https://github.com/oV201/cve_report/blob/main/vendors/oretnom23/faculty-evaluation-system/SQLi-1.md"
        ],
        "summary": "A vulnerability has been found in SourceCodester Faculty Evaluation System 1.0 and classified as critical. Affected by this vulnerability is an unknown functionality of the file ajax.php?action=delete_subject. The manipulation of the argument id leads to sql injection. The attack can be launched remotely. The exploit has been disclosed to the public and may be used. The identifier VDB-227641 was assigned to this vulnerability."
    },
    {
        "Modified": "2023-04-28T12:58:00",
        "Published": "2023-04-28T12:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-89",
        "id": "CVE-2023-2366",
        "impact": {},
        "last-modified": "2023-04-28T12:58:00",
        "references": [
            "https://vuldb.com/?id.227642",
            "https://github.com/oV201/cve_report/blob/main/vendors/oretnom23/faculty-evaluation-system/SQLi-2.md",
            "https://vuldb.com/?ctiid.227642"
        ],
        "summary": "A vulnerability was found in SourceCodester Faculty Evaluation System 1.0 and classified as critical. Affected by this issue is some unknown functionality of the file ajax.php?action=delete_class. The manipulation of the argument id leads to sql injection. The attack may be launched remotely. The exploit has been disclosed to the public and may be used. VDB-227642 is the identifier assigned to this vulnerability."
    },
    {
        "Modified": "2023-04-28T12:58:00",
        "Published": "2023-04-28T10:15:00",
        "access": {},
        "assigner": "security@jetbrains.com",
        "cvss": null,
        "cwe": "CWE-691",
        "id": "CVE-2022-48481",
        "impact": {},
        "last-modified": "2023-04-28T12:58:00",
        "references": [
            "https://www.jetbrains.com/privacy-security/issues-fixed/"
        ],
        "summary": "In JetBrains Toolbox App before 1.28 a DYLIB injection on macOS was possible"
    },
    {
        "Modified": "2023-04-28T12:58:00",
        "Published": "2023-04-28T11:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-89",
        "id": "CVE-2023-2363",
        "impact": {},
        "last-modified": "2023-04-28T12:58:00",
        "references": [
            "https://vuldb.com/?id.227639",
            "https://vuldb.com/?ctiid.227639",
            "https://github.com/navaidzansari/CVE_Demo/blob/main/2023/Resort_Reservation_System-SQL-Injection-1.md"
        ],
        "summary": "A vulnerability, which was classified as critical, has been found in SourceCodester Resort Reservation System 1.0. This issue affects some unknown processing of the file view_room.php. The manipulation of the argument id leads to sql injection. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. The associated identifier of this vulnerability is VDB-227639."
    },
    {
        "Modified": "2023-04-28T12:58:00",
        "Published": "2023-04-28T11:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-79",
        "id": "CVE-2023-2364",
        "impact": {},
        "last-modified": "2023-04-28T12:58:00",
        "references": [
            "https://vuldb.com/?id.227640",
            "https://vuldb.com/?ctiid.227640",
            "https://github.com/navaidzansari/CVE_Demo/blob/main/2023/Resort_Reservation_System-Stored-Cross-Site-Scripting-1.md"
        ],
        "summary": "A vulnerability, which was classified as problematic, was found in SourceCodester Resort Reservation System 1.0. Affected is an unknown function of the file registration.php. The manipulation of the argument fullname leads to cross site scripting. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used. The identifier of this vulnerability is VDB-227640."
    },
    {
        "Modified": "2023-04-28T12:58:00",
        "Published": "2023-04-28T11:15:00",
        "access": {},
        "assigner": "vdisclose@cert-in.org.in",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-30466",
        "impact": {},
        "last-modified": "2023-04-28T12:58:00",
        "references": [
            "https://www.cert-in.org.in/s2cMainServlet?pageid=PUBVLNOTES01&VLCODE=CIVN-2023-0121"
        ],
        "summary": "This vulnerability exists in Milesight 4K/H.265 Series NVR models (MS-Nxxxx-xxG, MS-Nxxxx-xxE, MS-Nxxxx-xxT, MS-Nxxxx-xxH and MS-Nxxxx-xxC), due to a weak password reset mechanism at the Milesight NVR web-based management interface. A remote attacker could exploit this vulnerability by sending a specially crafted http requests on the targeted device.\n\nSuccessful exploitation of this vulnerability could allow remote attacker to account takeover on the targeted device.\n\n\n\n\n\n\n\n\n\n\n"
    },
    {
        "Modified": "2023-04-28T12:58:00",
        "Published": "2023-04-28T11:15:00",
        "access": {},
        "assigner": "vdisclose@cert-in.org.in",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-30467",
        "impact": {},
        "last-modified": "2023-04-28T12:58:00",
        "references": [
            "https://www.cert-in.org.in/s2cMainServlet?pageid=PUBVLNOTES01&VLCODE=CIVN-2023-0121"
        ],
        "summary": "This vulnerability exists in Milesight 4K/H.265 Series NVR models (MS-Nxxxx-xxG, MS-Nxxxx-xxE, MS-Nxxxx-xxT, MS-Nxxxx-xxH and MS-Nxxxx-xxC), due to improper authorization at the Milesight NVR web-based management interface. A remote attacker could exploit this vulnerability by sending a specially crafted http requests on the targeted device.\n\nSuccessful exploitation of this vulnerability could allow remote attacker to perform unauthorized activities on the targeted device.\n\n\n\n\n\n\n\n\n\n\n"
    },
    {
        "Modified": "2023-04-28T12:58:00",
        "Published": "2023-04-28T08:15:00",
        "access": {},
        "assigner": "security@huntr.dev",
        "cvss": null,
        "cwe": "CWE-79",
        "id": "CVE-2023-2361",
        "impact": {},
        "last-modified": "2023-04-28T12:58:00",
        "references": [
            "https://huntr.dev/bounties/24d91b83-c3df-48f5-a713-9def733f2de7",
            "https://github.com/pimcore/pimcore/commit/6970649f5d3790a1db9ef4324bece0d4cb95366a"
        ],
        "summary": "Cross-site Scripting (XSS) - Stored in GitHub repository pimcore/pimcore prior to 10.5.21."
    },
    {
        "Modified": "2023-04-28T12:58:00",
        "Published": "2023-04-28T00:15:00",
        "access": {},
        "assigner": "security@huntr.dev",
        "cvss": null,
        "cwe": "CWE-23",
        "id": "CVE-2023-2356",
        "impact": {},
        "last-modified": "2023-04-28T12:58:00",
        "references": [
            "https://github.com/mlflow/mlflow/commit/f73147496e05c09a8b83d95fb4f1bf86696c6342",
            "https://huntr.dev/bounties/7b5d130d-38eb-4133-8c7d-0dfc9a9d9896"
        ],
        "summary": "Relative Path Traversal in GitHub repository mlflow/mlflow prior to 2.3.1."
    },
    {
        "Modified": "2023-04-28T12:58:00",
        "Published": "2023-04-28T01:15:00",
        "access": {},
        "assigner": "psirt@us.ibm.com",
        "cvss": null,
        "cwe": "CWE-770",
        "id": "CVE-2023-27556",
        "impact": {},
        "last-modified": "2023-04-28T12:58:00",
        "references": [
            "https://https://www.ibm.com/support/pages/node/6985601",
            "https://exchange.xforce.ibmcloud.com/vulnerabilities/249190"
        ],
        "summary": "IBM Counter Fraud Management for Safer Payments 6.1.0.00, 6.2.0.00, 6.3.0.00 through 6.3.1.03, 6.4.0.00 through 6.4.2.02 and 6.5.0.00 does not properly allocate resources without limits or throttling which could allow a remote attacker to cause a denial of service.  IBM X-Force ID:  249190."
    },
    {
        "Modified": "2023-04-28T12:58:00",
        "Published": "2023-04-28T02:15:00",
        "access": {},
        "assigner": "psirt@us.ibm.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2020-4729",
        "impact": {},
        "last-modified": "2023-04-28T12:58:00",
        "references": [
            "https://www.ibm.com/support/pages/node/6985595",
            "https://exchange.xforce.ibmcloud.com/vulnerabilities/188052"
        ],
        "summary": "IBM Counter Fraud Management for Safer Payments 5.7.0.00 through 5.7.0.10, 6.0.0.00 through 6.0.0.07, 6.1.0.00 through 6.1.0.05, and 6.2.0.00 through 6.2.1.00 could allow an authenticated attacker under special circumstances to send multiple specially crafted API requests that could cause the application to crash.  IBM X-Force ID:  188052."
    },
    {
        "Modified": "2023-04-28T12:58:00",
        "Published": "2023-04-28T02:15:00",
        "access": {},
        "assigner": "psirt@us.ibm.com",
        "cvss": null,
        "cwe": "CWE-327",
        "id": "CVE-2023-27557",
        "impact": {},
        "last-modified": "2023-04-28T12:58:00",
        "references": [
            "https://exchange.xforce.ibmcloud.com/vulnerabilities/249192",
            "https://www.ibm.com/support/pages/node/6985603"
        ],
        "summary": "IBM Counter Fraud Management for Safer Payments 6.1.0.00 through 6.1.1.02, 6.2.0.00 through 6.2.2.02, 6.3.0.00 through 6.3.1.02, 6.4.0.00 through 6.4.2.01, and 6.5.0.00 uses weaker than expected cryptographic algorithms that could allow an attacker to decrypt highly sensitive information.  IBM X-Force ID:  249192."
    },
    {
        "Modified": "2023-04-28T12:58:00",
        "Published": "2023-04-28T02:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-31436",
        "impact": {},
        "last-modified": "2023-04-28T12:58:00",
        "references": [
            "https://github.com/torvalds/linux/commit/3037933448f60f9acb705997eae62013ecb81e0d",
            "https://cdn.kernel.org/pub/linux/kernel/v6.x/ChangeLog-6.2.13",
            "https://www.spinics.net/lists/stable-commits/msg294885.html"
        ],
        "summary": "qfq_change_class in net/sched/sch_qfq.c in the Linux kernel before 6.2.13 allows an out-of-bounds write because lmax can exceed QFQ_MIN_LMAX."
    },
    {
        "Modified": "2023-04-28T12:58:00",
        "Published": "2023-04-28T03:15:00",
        "access": {},
        "assigner": "psirt@us.ibm.com",
        "cvss": null,
        "cwe": "CWE-78",
        "id": "CVE-2023-28528",
        "impact": {},
        "last-modified": "2023-04-28T12:58:00",
        "references": [
            "https://exchange.xforce.ibmcloud.com/vulnerabilities/251207",
            "https://www.ibm.com/support/pages/node/6983232"
        ],
        "summary": "IBM AIX 7.1, 7.2, 7.3, and VIOS 3.1 could allow a non-privileged local user to exploit a vulnerability in the invscout command to execute arbitrary commands.  IBM X-Force ID:  251207."
    },
    {
        "Modified": "2023-04-28T12:58:00",
        "Published": "2023-04-28T04:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-28882",
        "impact": {},
        "last-modified": "2023-04-28T12:58:00",
        "references": [
            "https://www.trustwave.com/en-us/resources/security-resources/software-updates/announcing-modsecurity-version-309/"
        ],
        "summary": "Trustwave ModSecurity 3.0.5 through 3.0.8 before 3.0.9 allows a denial of service (worker crash and unresponsiveness) because some inputs cause a segfault in the Transaction class for some configurations."
    },
    {
        "Modified": "2023-04-28T12:58:00",
        "Published": "2023-04-27T22:15:00",
        "access": {},
        "assigner": "ics-cert@hq.dhs.gov",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-1967",
        "impact": {},
        "last-modified": "2023-04-28T12:58:00",
        "references": [
            "https://www.cisa.gov/news-events/ics-advisories/icsa-23-115-01"
        ],
        "summary": "Keysight N8844A Data Analytics Web Service deserializes untrusted data without sufficiently verifying the resulting data will be valid. "
    },
    {
        "Modified": "2023-04-28T12:58:00",
        "Published": "2023-04-27T22:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-30380",
        "impact": {},
        "last-modified": "2023-04-28T12:58:00",
        "references": [
            "https://github.com/Howard512966/DedeCMS-v5.7.107-Directory-Traversal"
        ],
        "summary": "An issue in the component /dialog/select_media.php of DedeCMS v5.7.107 allows attackers to execute a directory traversal."
    },
    {
        "Modified": "2023-04-28T12:58:00",
        "Published": "2023-04-27T23:15:00",
        "access": {},
        "assigner": "ics-cert@hq.dhs.gov",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-28384",
        "impact": {},
        "last-modified": "2023-04-28T12:58:00",
        "references": [
            "https://www.cisa.gov/news-events/ics-advisories/icsa-23-096-06"
        ],
        "summary": "mySCADA myPRO versions 8.26.0 and prior has parameters which an authenticated user could exploit to inject arbitrary operating system commands."
    },
    {
        "Modified": "2023-04-28T12:58:00",
        "Published": "2023-04-27T23:15:00",
        "access": {},
        "assigner": "ics-cert@hq.dhs.gov",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-28400",
        "impact": {},
        "last-modified": "2023-04-28T12:58:00",
        "references": [
            "https://www.cisa.gov/news-events/ics-advisories/icsa-23-096-06"
        ],
        "summary": "mySCADA myPRO versions 8.26.0 and prior has parameters which an authenticated user could exploit to inject arbitrary operating system commands. "
    },
    {
        "Modified": "2023-04-28T12:58:00",
        "Published": "2023-04-27T23:15:00",
        "access": {},
        "assigner": "ics-cert@hq.dhs.gov",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-28716",
        "impact": {},
        "last-modified": "2023-04-28T12:58:00",
        "references": [
            "https://www.cisa.gov/news-events/ics-advisories/icsa-23-096-06"
        ],
        "summary": "mySCADA myPRO versions 8.26.0 and prior has parameters which an authenticated user could exploit to inject arbitrary operating system commands. "
    }
]