[
    {
        "Modified": "2023-05-01T19:55:00",
        "Published": "2023-04-19T20:15:00",
        "access": {},
        "assigner": "disclosure@vulncheck.com",
        "cvss": null,
        "cwe": "CWE-330",
        "id": "CVE-2023-30797",
        "impact": {},
        "last-modified": "2023-05-01T19:55:00",
        "references": [
            "https://vulncheck.com/advisories/netflix-lemur-weak-rng",
            "https://github.com/Netflix/lemur/commit/666d853212174ee7f4e6f8b3b4b389ede1872238",
            "https://github.com/Netflix/lemur/security/advisories/GHSA-5fqv-mpj8-h7gm",
            "https://github.com/Netflix/security-bulletins/blob/master/advisories/nflx-2023-001.md"
        ],
        "summary": "\n\nNetflix Lemur before version 1.3.2 used insufficiently random values when generating default credentials. The insufficiently random values may allow an attacker to guess the credentials and gain access to resources managed by Lemur.\n\n\n"
    },
    {
        "Modified": "2023-05-01T19:18:00",
        "Published": "2023-04-19T21:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "CWE-120",
        "id": "CVE-2021-33974",
        "impact": {},
        "last-modified": "2023-05-01T19:18:00",
        "references": [
            "https://MemoryCorruptor.blogspot.com/p/vulnerabilities-disclosures.html",
            "https://pastebin.com/ms1ivjYe"
        ],
        "summary": "Qihoo 360 (https://www.360.cn/) Qihoo 360 Safeguard (https://www.360.cn/) Qihoo 360 Chrome (https://browser.360.cn/ee/) is affected by: Buffer Overflow. The impact is: execute arbitrary code (remote). The component is: This is a set of vulnerabilities affecting popular software, and the installation packages correspond to versions \"360 Safeguard(12.1.0.1004,12.1.0.1005,13.1.0.1001)\" , \"360 Total Security(10.8.0.1060,10.8.0.1213)\", \"360 Safe Browser & 360 Chrome(12. The attack vector is: On the browser vulnerability, just open a link to complete the vulnerability exploitation remotely; on the client software, you need to locally execute the vulnerability exploitation program, which of course can be achieved with the full chain of browser vulnerability. ¶¶ This is a set of the most serious vulnerabilities that exist on Qihoo 360's PC client multiple popular software, remote vulnerabilities can be accomplished by opening a link to arbitrary code execution on both security browsers, in conjunction with the exploitation of local vulnerabilities that allow spyware to persist without being scanned to permanently reside on the target PC computer (because local vulnerabilities target Qihoo 360 company's antivirus software kernel flaws); this set of remote and local vulnerabilities in perfect coordination, to achieve an information security fallacy, on Qihoo 360's antivirus software vulnerability, not only can not be scanned out of the virus, but will help the virus persistently control the target computer, while Qihoo 360 claims to be a secure browser, which exists in the kernel vulnerability but help the composition of the remote vulnerability.(Security expert \"Memory Corruptor\" have reported this set of vulnerabilities to the corresponding vendor, all vulnerabilities have been fixed and the vendor rewarded thousands of dollars to this security expert)"
    },
    {
        "Modified": "2023-05-01T19:07:00",
        "Published": "2023-04-17T22:15:00",
        "access": {},
        "assigner": "sirt@juniper.net",
        "cvss": null,
        "cwe": "CWE-416",
        "id": "CVE-2023-28984",
        "impact": {},
        "last-modified": "2023-05-01T19:07:00",
        "references": [
            "https://supportportal.juniper.net/JSA70610"
        ],
        "summary": "A Use After Free vulnerability in the Layer 2 Address Learning Manager (l2alm) of Juniper Networks Junos OS on QFX Series allows an adjacent attacker to cause the Packet Forwarding Engine to crash and restart, leading to a Denial of Service (DoS). The PFE may crash when a lot of MAC learning and aging happens, but due to a Race Condition (Concurrent Execution using Shared Resource with Improper Synchronization) that is outside the attackers direct control. This issue affects: Juniper Networks Junos OS versions prior to 19.4R3-S10 on QFX Series; 20.2 versions prior to 20.2R3-S7 on QFX Series; 20.3 versions prior to 20.3R3-S6 on QFX Series; 20.4 versions prior to 20.4R3-S5 on QFX Series; 21.1 versions prior to 21.1R3-S4 on QFX Series; 21.2 versions prior to 21.2R3-S3 on QFX Series; 21.3 versions prior to 21.3R3-S3 on QFX Series; 21.4 versions prior to 21.4R3 on QFX Series; 22.1 versions prior to 22.1R3 on QFX Series; 22.2 versions prior to 22.2R2 on QFX Series."
    },
    {
        "Modified": "2023-05-01T19:01:00",
        "Published": "2023-04-19T19:15:00",
        "access": {},
        "assigner": "security@nortonlifelock.com",
        "cvss": null,
        "cwe": "CWE-367",
        "id": "CVE-2023-1585",
        "impact": {},
        "last-modified": "2023-05-01T19:01:00",
        "references": [
            "https://support.norton.com/sp/static/external/tools/security-advisories.html"
        ],
        "summary": "Avast and AVG Antivirus for Windows were susceptible to a Time-of-check/Time-of-use (TOCTOU)  vulnerability in the Quarantine process, leading to arbitrary file/directory deletion. The issue was fixed with Avast and AVG Antivirus version 22.11 and virus definitions from 14 February 2023 or later.  "
    },
    {
        "Modified": "2023-05-01T19:01:00",
        "Published": "2023-04-19T19:15:00",
        "access": {},
        "assigner": "security@nortonlifelock.com",
        "cvss": null,
        "cwe": "CWE-367",
        "id": "CVE-2023-1586",
        "impact": {},
        "last-modified": "2023-05-01T19:01:00",
        "references": [
            "https://support.norton.com/sp/static/external/tools/security-advisories.html"
        ],
        "summary": "Avast and AVG Antivirus for Windows were susceptible to a Time-of-check/Time-of-use (TOCTOU)  vulnerability in the restore process leading to arbitrary file creation. The issue was fixed with Avast and AVG Antivirus version 22.11"
    },
    {
        "Modified": "2023-05-01T18:56:00",
        "Published": "2023-04-20T16:15:00",
        "access": {},
        "assigner": "security@apache.org",
        "cvss": null,
        "cwe": "CWE-287",
        "id": "CVE-2023-25601",
        "impact": {},
        "last-modified": "2023-05-01T18:56:00",
        "references": [
            "https://lists.apache.org/thread/25g77jqczp3t8cz56hk1p65q7m6c64rf",
            "http://www.openwall.com/lists/oss-security/2023/04/20/10"
        ],
        "summary": "On version 3.0.0 through 3.1.1, Apache DolphinScheduler's python gateway suffered from improper authentication: an attacker could use a socket bytes attack without authentication. This issue has been fixed from version 3.1.2 onwards. For users who use version 3.0.0 to 3.1.1, you can turn off the python-gateway function by changing the value `python-gateway.enabled=false` in configuration file `application.yaml`. If you are using the python gateway, please upgrade to version 3.1.2 or above.\n"
    },
    {
        "Modified": "2023-05-01T18:51:00",
        "Published": "2023-04-20T21:15:00",
        "access": {},
        "assigner": "security@vmware.com",
        "cvss": null,
        "cwe": "NVD-CWE-noinfo",
        "id": "CVE-2023-20873",
        "impact": {},
        "last-modified": "2023-05-01T18:51:00",
        "references": [
            "https://spring.io/security/cve-2023-20873"
        ],
        "summary": "In Spring Boot versions 3.0.0 - 3.0.5, 2.7.0 - 2.7.10, and older unsupported versions, an application that is deployed to Cloud Foundry could be susceptible to a security bypass. Users of affected versions should apply the following mitigation: 3.0.x users should upgrade to 3.0.6+. 2.7.x users should upgrade to 2.7.11+. Users of older, unsupported versions should upgrade to 3.0.6+ or 2.7.11+."
    },
    {
        "Modified": "2023-05-01T18:46:00",
        "Published": "2023-04-20T18:15:00",
        "access": {},
        "assigner": "security-advisories@github.com",
        "cvss": null,
        "cwe": "CWE-352",
        "id": "CVE-2023-30616",
        "impact": {},
        "last-modified": "2023-05-01T18:46:00",
        "references": [
            "https://github.com/epiphyt/form-block/security/advisories/GHSA-j4c2-7p87-q824",
            "https://github.com/epiphyt/form-block/commit/cf0012fa0710d906c594346ba775c5dc433a9426"
        ],
        "summary": "Form block is a wordpress plugin designed to make form creation easier. Versions prior to 1.0.2 are subject to a Cross-Site Request Forgery due to a missing nonce check. There is potential for a Cross Site Request Forgery for all form blocks, since it allows to send requests to the forms from any website without a user noticing. Users are advised to upgrade to version 1.0.2. There are no known workarounds for this vulnerability."
    },
    {
        "Modified": "2023-05-01T18:44:00",
        "Published": "2023-04-20T20:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "CWE-79",
        "id": "CVE-2023-27090",
        "impact": {},
        "last-modified": "2023-05-01T18:44:00",
        "references": [
            "https://gitee.com/xiaobingby/TeaCMS/issues/I6L9Z2",
            "https://gitee.com/xiaobingby/TeaCMS/issues/I6GDDN"
        ],
        "summary": "Cross Site Scripting vulnerability found in TeaCMS storage allows attacker to cause a leak of sensitive information via the article title parameter."
    },
    {
        "Modified": "2023-05-01T18:39:00",
        "Published": "2023-04-19T20:15:00",
        "access": {},
        "assigner": "security@vmware.com",
        "cvss": null,
        "cwe": "CWE-459",
        "id": "CVE-2023-20862",
        "impact": {},
        "last-modified": "2023-05-01T18:39:00",
        "references": [
            "https://spring.io/security/cve-2023-20862"
        ],
        "summary": "In Spring Security, versions 5.7.x prior to 5.7.8, versions 5.8.x prior to 5.8.3, and versions 6.0.x prior to 6.0.3, the logout support does not properly clean the security context if using serialized versions. Additionally, it is not possible to explicitly save an empty security context to the HttpSessionSecurityContextRepository. This vulnerability can keep users authenticated even after they performed logout. Users of affected versions should apply the following mitigation. 5.7.x users should upgrade to 5.7.8. 5.8.x users should upgrade to 5.8.3. 6.0.x users should upgrade to 6.0.3."
    },
    {
        "Modified": "2023-05-01T18:39:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-416",
        "id": "CVE-2022-37381",
        "impact": {},
        "last-modified": "2023-05-01T18:39:00",
        "references": [
            "https://www.foxit.com/support/security-bulletins.html",
            "https://www.zerodayinitiative.com/advisories/ZDI-22-1053/"
        ],
        "summary": "This vulnerability allows remote attackers to execute arbitrary code on affected installations of Foxit PDF Reader. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file. The specific flaw exists within the AFSpecial_KeystrokeEx method. The issue results from the lack of validating the existence of an object prior to performing operations on the object. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-17110."
    },
    {
        "Modified": "2023-05-01T18:15:00",
        "Published": "2023-03-23T20:15:00",
        "access": {},
        "assigner": "psirt@adobe.com",
        "cvss": null,
        "cwe": "CWE-284",
        "id": "CVE-2023-26360",
        "impact": {},
        "last-modified": "2023-05-01T18:15:00",
        "references": [
            "https://helpx.adobe.com/security/products/coldfusion/apsb23-25.html",
            "http://packetstormsecurity.com/files/172079/Adobe-ColdFusion-Unauthenticated-Remote-Code-Execution.html"
        ],
        "summary": "Adobe ColdFusion versions 2018 Update 15 (and earlier) and 2021 Update 5 (and earlier) are affected by an Improper Access Control vulnerability that could result in arbitrary code execution in the context of the current user. Exploitation of this issue does not require user interaction."
    },
    {
        "Modified": "2023-05-01T18:14:00",
        "Published": "2023-04-19T18:15:00",
        "access": {},
        "assigner": "security-advisories@github.com",
        "cvss": null,
        "cwe": "CWE-416",
        "id": "CVE-2023-30612",
        "impact": {},
        "last-modified": "2023-05-01T18:14:00",
        "references": [
            "https://github.com/cloud-hypervisor/cloud-hypervisor/security/advisories/GHSA-g6mw-f26h-4jgp",
            "https://github.com/cloud-hypervisor/cloud-hypervisor/pull/5350",
            "https://github.com/cloud-hypervisor/cloud-hypervisor/pull/5373",
            "https://oss-fuzz.com/testcase-detail/5260873569796096",
            "https://oss-fuzz.com/testcase-detail/5426283514560512"
        ],
        "summary": "Cloud hypervisor is a Virtual Machine Monitor for Cloud workloads. This vulnerability allows users to close arbitrary open file descriptors in the Cloud Hypervisor process via sending malicious HTTP request through the HTTP API socket. As a result, the Cloud Hypervisor process can be easily crashed, causing Deny-of-Service (DoS). This can also be a potential Use-After-Free (UAF) vulnerability. Users require to have the write access to the API socket file to trigger this vulnerability.  Impacted versions of Cloud Hypervisor include upstream main branch, v31.0, and v30.0. The vulnerability was initially detected by our `http_api_fuzzer` via oss-fuzz. This issue has been addressed in versions 30.1 and 31.1. Users unable to upgrade may mitigate this issue by ensuring the write access to the API socket file is granted to trusted users only."
    },
    {
        "Modified": "2023-05-01T18:14:00",
        "Published": "2023-04-19T18:15:00",
        "access": {},
        "assigner": "security-advisories@github.com",
        "cvss": null,
        "cwe": "CWE-79",
        "id": "CVE-2023-30614",
        "impact": {},
        "last-modified": "2023-05-01T18:14:00",
        "references": [
            "https://github.com/pay-rails/pay/security/advisories/GHSA-cqf3-vpx7-rxhw",
            "https://github.com/pay-rails/pay/commit/5d6283a24062bd272a524ec48415f536a67ad57f"
        ],
        "summary": "Pay is a payments engine for Ruby on Rails 6.0 and higher. In versions prior to 6.3.2 a payments info page of Pay is susceptible to reflected Cross-site scripting. An attacker could create a working URL that renders a javascript link to a user on a Rails application that integrates Pay. This URL could be distributed via email to specifically target certain individuals. If the targeted application contains a functionality to submit user-generated content (such as comments) the attacker could even distribute the URL using that functionality. This has been patched in version 6.3.2 and above. Users are advised to upgrade. There are no known workarounds for this vulnerability."
    },
    {
        "Modified": "2023-05-01T18:12:00",
        "Published": "2023-04-19T18:15:00",
        "access": {},
        "assigner": "security-advisories@github.com",
        "cvss": null,
        "cwe": "NVD-CWE-noinfo",
        "id": "CVE-2023-30611",
        "impact": {},
        "last-modified": "2023-05-01T18:12:00",
        "references": [
            "https://github.com/discourse/discourse-reactions/security/advisories/GHSA-4cgc-c7vh-94g6",
            "https://github.com/discourse/discourse-reactions/commit/01aca15b2774c088f3673118e92e9469f37d2fb6"
        ],
        "summary": "Discourse-reactions is a plugin that allows user to add their reactions to the post in the Discourse messaging platform. In affected versions data about what reactions were performed on a post in a private topic could be leaked. This issue has been addressed in version 0.3. Users are advised to upgrade. Users unable to upgrade should disable the discourse-reactions plugin to fully mitigate the issue."
    },
    {
        "Modified": "2023-05-01T18:11:00",
        "Published": "2023-04-19T18:15:00",
        "access": {},
        "assigner": "security-advisories@github.com",
        "cvss": null,
        "cwe": "CWE-670",
        "id": "CVE-2021-43819",
        "impact": {},
        "last-modified": "2023-05-01T18:11:00",
        "references": [
            "https://github.com/stargate-bukkit/Stargate-Bukkit/security/advisories/GHSA-64r2-hfr9-849j"
        ],
        "summary": "Stargate-Bukkit is a mod for the minecraft video game which adds a portal focused environment. In affected versions Minecarts with chests will drop their items when teleporting through a portal; when they reappear, they will still have their items impacting the integrity of the game world. The teleport code has since been rewritten and is available in release `0.11.5.1`. Users are advised to upgrade. There are no known workarounds for this issue."
    },
    {
        "Modified": "2023-05-01T18:11:00",
        "Published": "2023-04-19T18:15:00",
        "access": {},
        "assigner": "security-advisories@github.com",
        "cvss": null,
        "cwe": "CWE-532",
        "id": "CVE-2023-30610",
        "impact": {},
        "last-modified": "2023-05-01T18:11:00",
        "references": [
            "https://github.com/awslabs/aws-sdk-rust/security/advisories/GHSA-mjv9-vp6w-3rc9"
        ],
        "summary": "aws-sigv4 is a rust library for low level request signing in the aws cloud platform. The `aws_sigv4::SigningParams` struct had a derived `Debug` implementation. When debug-formatted, it would include a user's AWS access key, AWS secret key, and security token in plaintext. When TRACE-level logging is enabled for an SDK, `SigningParams` is printed, thereby revealing those credentials to anyone with access to logs. All users of the AWS SDK for Rust who enabled TRACE-level logging, either globally (e.g. `RUST_LOG=trace`), or for the `aws-sigv4` crate specifically are affected. This issue has been addressed in a set of new releases. Users are advised to upgrade. Users unable to upgrade should disable TRACE-level logging for AWS Rust SDK crates.\n"
    },
    {
        "Modified": "2023-05-01T18:10:00",
        "Published": "2023-04-19T16:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "CWE-287",
        "id": "CVE-2023-22893",
        "impact": {},
        "last-modified": "2023-05-01T18:10:00",
        "references": [
            "https://www.ghostccamm.com/blog/multi_strapi_vulns/",
            "https://github.com/strapi/strapi/releases",
            "https://strapi.io/blog/security-disclosure-of-vulnerabilities-cve"
        ],
        "summary": "Strapi through 4.5.5 does not verify the access or ID tokens issued during the OAuth flow when the AWS Cognito login provider is used for authentication. A remote attacker could forge an ID token that is signed using the 'None' type algorithm to bypass authentication and impersonate any user that use AWS Cognito for authentication."
    },
    {
        "Modified": "2023-05-01T18:10:00",
        "Published": "2023-04-19T16:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "CWE-312",
        "id": "CVE-2023-22894",
        "impact": {},
        "last-modified": "2023-05-01T18:10:00",
        "references": [
            "https://www.ghostccamm.com/blog/multi_strapi_vulns/",
            "https://github.com/strapi/strapi/releases",
            "https://strapi.io/blog/security-disclosure-of-vulnerabilities-cve"
        ],
        "summary": "Strapi through 4.5.5 allows attackers (with access to the admin panel) to discover sensitive user details by exploiting the query filter. The attacker can filter users by columns that contain sensitive information and infer a value from API responses. If the attacker has super admin access, then this can be exploited to discover the password hash and password reset token of all users. If the attacker has admin panel access to an account with permission to access the username and email of API users with a lower privileged role (e.g., Editor or Author), then this can be exploited to discover sensitive information for all API users but not other admin accounts."
    },
    {
        "Modified": "2023-05-01T18:09:00",
        "Published": "2023-04-19T16:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "CWE-74",
        "id": "CVE-2023-22621",
        "impact": {},
        "last-modified": "2023-05-01T18:09:00",
        "references": [
            "https://www.ghostccamm.com/blog/multi_strapi_vulns/",
            "https://github.com/strapi/strapi/releases",
            "https://strapi.io/blog/security-disclosure-of-vulnerabilities-cve"
        ],
        "summary": "Strapi through 4.5.5 allows authenticated Server-Side Template Injection (SSTI) that can be exploited to execute arbitrary code on the server. A remote attacker with access to the Strapi admin panel can inject a crafted payload that executes code on the server into an email template that bypasses the validation checks that should prevent code execution."
    },
    {
        "Modified": "2023-05-01T17:39:00",
        "Published": "2023-04-19T22:15:00",
        "access": {},
        "assigner": "security@ubuntu.com",
        "cvss": null,
        "cwe": "CWE-532",
        "id": "CVE-2022-2084",
        "impact": {},
        "last-modified": "2023-05-01T17:39:00",
        "references": [
            "https://github.com/canonical/cloud-init/commit/4d467b14363d800b2185b89790d57871f11ea88c",
            "https://ubuntu.com/security/notices/USN-5496-1"
        ],
        "summary": "Sensitive data could be exposed in world readable logs of cloud-init before version 22.3 when schema failures are reported. This leak could include hashed passwords."
    },
    {
        "Modified": "2023-05-01T17:27:00",
        "Published": "2023-04-19T00:15:00",
        "access": {},
        "assigner": "security-advisories@github.com",
        "cvss": null,
        "cwe": "CWE-74",
        "id": "CVE-2023-29524",
        "impact": {},
        "last-modified": "2023-05-01T17:27:00",
        "references": [
            "https://jira.xwiki.org/browse/XWIKI-20295",
            "https://github.com/xwiki/xwiki-platform/security/advisories/GHSA-fc42-5w56-qw7h",
            "https://jira.xwiki.org/browse/XWIKI-20462"
        ],
        "summary": "XWiki Platform is a generic wiki platform offering runtime services for applications built on top of it. It's possible to execute anything with the right of the Scheduler Application sheet page. A user without script or programming rights, edit your user profile with the object editor and add a new object of type XWiki.SchedulerJobClass, In \"Job Script\", groovy code can be added and will be executed in the server context on viewing. This has been patched in XWiki 14.10.3 and 15.0 RC1. Users are advised to upgrade. There are no known workarounds for this issue."
    },
    {
        "Modified": "2023-05-01T17:27:00",
        "Published": "2023-04-19T00:15:00",
        "access": {},
        "assigner": "security-advisories@github.com",
        "cvss": null,
        "cwe": "CWE-74",
        "id": "CVE-2023-29525",
        "impact": {},
        "last-modified": "2023-05-01T17:27:00",
        "references": [
            "https://github.com/xwiki/xwiki-platform/commit/6d74e2e4aa03d19f0be385ab63ae9e0f0e90a766",
            "https://github.com/xwiki/xwiki-platform/commit/8e7c7f90f2ddaf067cb5b83b181af41513028754#diff-4e13f4ee4a42938bf1201b7ee71ca32edeacba22559daf0bcb89d534e0225949R70",
            "https://github.com/xwiki/xwiki-platform/security/advisories/GHSA-jgg7-w2rj-58cj",
            "https://jira.xwiki.org/browse/XWIKI-20287"
        ],
        "summary": "XWiki Platform is a generic wiki platform offering runtime services for applications built on top of it. Affected versions of xwiki are subject to code injection in the `since` parameter of the `/xwiki/bin/view/XWiki/Notifications/Code/LegacyNotificationAdministration` endpoint. This provides an XWiki syntax injection attack via the since-parameter, allowing privilege escalation from view to programming rights and subsequent code execution privilege. The vulnerability has been patched in XWiki 15.0-rc-1, 14.10.3, 14.4.8 and 14.10.3. Users are advised to upgrade. Users unable to upgrade may modify the page `XWiki.Notifications.Code.LegacyNotificationAdministration` to add the missing escaping. For versions < 14.6-rc-1 a workaround is to modify the file `<xwikiwebapp>/templates/distribution/eventmigration.wiki` to add the missing escaping."
    },
    {
        "Modified": "2023-05-01T17:27:00",
        "Published": "2023-04-19T00:15:00",
        "access": {},
        "assigner": "security-advisories@github.com",
        "cvss": null,
        "cwe": "CWE-74",
        "id": "CVE-2023-29527",
        "impact": {},
        "last-modified": "2023-05-01T17:27:00",
        "references": [
            "https://github.com/xwiki/xwiki-platform/security/advisories/GHSA-jgrg-qvpp-9vwr",
            "https://jira.xwiki.org/browse/XWIKI-20423"
        ],
        "summary": "XWiki Platform is a generic wiki platform offering runtime services for applications built on top of it. In affected versions a user without script or programming right may edit a user profile (or any other document) with the wiki editor and add groovy script content. Viewing the document after saving it will execute the groovy script in the server context which provides code execution. This vulnerability has been patched in XWiki 15.0-rc-1 and 14.10.3. Users are advised to upgrade. There are no known workarounds for this issue."
    },
    {
        "Modified": "2023-05-01T17:27:00",
        "Published": "2023-04-19T00:15:00",
        "access": {},
        "assigner": "security-advisories@github.com",
        "cvss": null,
        "cwe": "CWE-89",
        "id": "CVE-2023-30556",
        "impact": {},
        "last-modified": "2023-05-01T17:27:00",
        "references": [
            "https://github.com/hhyo/Archery/security/advisories/GHSA-6pv9-9gq7-hr68"
        ],
        "summary": "Archery is an open source SQL audit platform. The Archery project contains multiple SQL injection vulnerabilities, that may allow an attacker to query the connected databases. Affected versions are subject to SQL injection in the `optimize_sqltuningadvisor` method of `sql_optimize.py`. User input coming from the `db_name` parameter value in `sql_optimize.py` is passed to the `sqltuningadvisor` method in `oracle.py`for execution. To mitigate escape the variables accepted via user input when used in `sql_optimize.py`. Users may also use prepared statements when dealing with SQL as a mitigation for this issue. This issue is also indexed as `GHSL-2022-107`."
    },
    {
        "Modified": "2023-05-01T17:22:00",
        "Published": "2023-04-19T00:15:00",
        "access": {},
        "assigner": "security-advisories@github.com",
        "cvss": null,
        "cwe": "CWE-89",
        "id": "CVE-2023-30557",
        "impact": {},
        "last-modified": "2023-05-01T17:22:00",
        "references": [
            "https://github.com/hhyo/Archery/blob/bc86cda4c3b7d59f759d0d23bb63a54f52616752/sql/data_dictionary.py#L47-L86",
            "https://github.com/hhyo/Archery/security/advisories/GHSA-9pvw-f8jv-xxjr"
        ],
        "summary": "Archery is an open source SQL audit platform. The Archery project contains multiple SQL injection vulnerabilities, that may allow an attacker to query the connected databases. Affected versions are subject to SQL injection in the `data_dictionary.py` `table_info`. User input coming from the `db_name` in and the `tb_name` parameter values in the `sql/data_dictionary.py` `table_info` endpoint is passed to the following methods in the given SQL engine implementations, which concatenate user input unsafely into a SQL query and afterwards pass it to the `query` method of each database engine for execution.The methods are `get_table_meta_data ` in `sql/engines/mssql.py` which passes unsafe user input to the `sql/engines/mssql.py` `query` method, `get_table_desc_data` in `sql/engines/mssql.py`which passes unsafe user input to the `sql/engines/mssql.py` `query`, `get_table_index_data` in `sql/engines/mssql.py`which passes unsafe user input to the `sql/engines/mssql.py` `query` method, `get_table_meta_data` in `sql/engines/oracle.py`which concatenates input which is passed to execution on the database in the `sql/engines/oracle.py` `query` method, `get_table_desc_data` in `sql/engines/oracle.py`which concatenates input which is passed to execution on the database in the `sql/engines/oracle.py` `query` method, and `get_table_index_data` in `sql/engines/oracle.py` which concatenates input which is passed to execution on the database in the `sql/engines/oracle.py` `query` method. Each of these issues may be mitigated by escaping user input or by using prepared statements when executing SQL queries. This issue is also indexed as `GHSL-2022-106`."
    },
    {
        "Modified": "2023-05-01T17:21:00",
        "Published": "2023-04-19T00:15:00",
        "access": {},
        "assigner": "security-advisories@github.com",
        "cvss": null,
        "cwe": "CWE-89",
        "id": "CVE-2023-30555",
        "impact": {},
        "last-modified": "2023-05-01T17:21:00",
        "references": [
            "https://github.com/hhyo/Archery/security/advisories/GHSA-349r-2663-cr3w"
        ],
        "summary": "Archery is an open source SQL audit platform. The Archery project contains multiple SQL injection vulnerabilities, that may allow an attacker to query the connected databases.Affected versions are subject to SQL injection in the `explain` method in `sql_optimize.py`. User input coming from the `db_name` parameter value in the `explain` endpoint is passed to the following `query` methods of each database engine for execution. `query` in `sql/engines/mssql.py`, and `query` in `sql/engines/oracle.py`. Each of these issues may be mitigated by escaping user input or by using prepared statements when executing SQL queries. This issue is also indexed as `GHSL-2022-108`."
    },
    {
        "Modified": "2023-05-01T17:17:00",
        "Published": "2023-04-19T00:15:00",
        "access": {},
        "assigner": "security-advisories@github.com",
        "cvss": null,
        "cwe": "CWE-89",
        "id": "CVE-2023-30554",
        "impact": {},
        "last-modified": "2023-05-01T17:17:00",
        "references": [
            "https://github.com/hhyo/Archery/security/advisories/GHSA-3p43-89m6-7x5w"
        ],
        "summary": "Archery is an open source SQL audit platform. The Archery project contains multiple SQL injection vulnerabilities, that may allow an attacker to query the connected databases. Affected versions are subject to SQL injection in the `sql_api/api_workflow.py` endpoint `ExecuteCheck` which passes unfiltered input to the `explain_check` method in `sql/engines/oracle.py`. User input coming from the `db_name` parameter value in the `api_workflow.py` `ExecuteCheck` endpoint is passed through the `oracle.py` `execute_check` method and to the `explain_check` method for execution. Each of these issues may be mitigated by escaping user input or by using prepared statements when executing SQL queries. This issue is also indexed as `GHSL-2022-103`."
    },
    {
        "Modified": "2023-05-01T17:15:00",
        "Published": "2023-05-01T17:15:00",
        "access": {},
        "assigner": "security@atlassian.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-22503",
        "impact": {},
        "last-modified": "2023-05-01T17:15:00",
        "references": [
            "https://jira.atlassian.com/browse/CONFSERVER-82403"
        ],
        "summary": "Affected versions of Atlassian Confluence Server and Data Center allow anonymous remote attackers to view the names of attachments and labels in a private Confluence space. This occurs via an Information Disclosure vulnerability in the macro preview feature.\r\n\r\nThis vulnerability was reported by Rojan Rijal of the Tinder Security Engineering team.\r\n\r\nThe affected versions are before version 7.13.15, from version 7.14.0 before 7.19.7, and from version 7.20.0 before 8.2.0."
    },
    {
        "Modified": "2023-05-01T17:15:00",
        "Published": "2023-05-01T17:15:00",
        "access": {},
        "assigner": "security@zyxel.com.tw",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-22919",
        "impact": {},
        "last-modified": "2023-05-01T17:15:00",
        "references": [
            "https://www.zyxel.com/global/en/support/security-advisories/zyxel-security-advisory-for-post-authentication-command-injection-vulnerability-in-nbg6604-home-router"
        ],
        "summary": "The post-authentication command injection vulnerability in the Zyxel NBG6604 firmware version V1.01(ABIR.0)C0 could allow an authenticated attacker to execute some OS commands remotely by sending a crafted HTTP request."
    },
    {
        "Modified": "2023-05-01T17:15:00",
        "Published": "2023-05-01T17:15:00",
        "access": {},
        "assigner": "security@zyxel.com.tw",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-22921",
        "impact": {},
        "last-modified": "2023-05-01T17:15:00",
        "references": [
            "https://www.zyxel.com/global/en/support/security-advisories/zyxel-security-advisory-for-multiple-vulnerabilities-in-nbg-418n-v2-home-router"
        ],
        "summary": "A cross-site scripting (XSS) vulnerability in the Zyxel NBG-418N v2 firmware versions prior to V1.00(AARP.14)C0 could allow a remote authenticated attacker with administrator privileges to store malicious scripts using a web management interface parameter, resulting in denial-of-service (DoS) conditions on an affected device."
    },
    {
        "Modified": "2023-05-01T17:15:00",
        "Published": "2023-05-01T17:15:00",
        "access": {},
        "assigner": "security@zyxel.com.tw",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-22922",
        "impact": {},
        "last-modified": "2023-05-01T17:15:00",
        "references": [
            "https://www.zyxel.com/global/en/support/security-advisories/zyxel-security-advisory-for-multiple-vulnerabilities-in-nbg-418n-v2-home-router"
        ],
        "summary": "A buffer overflow vulnerability in the Zyxel NBG-418N v2 firmware versions prior to V1.00(AARP.14)C0 could allow a remote unauthenticated attacker to cause DoS conditions by sending crafted packets if Telnet is enabled on a vulnerable device."
    },
    {
        "Modified": "2023-05-01T17:15:00",
        "Published": "2023-05-01T17:15:00",
        "access": {},
        "assigner": "security@zyxel.com.tw",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-22923",
        "impact": {},
        "last-modified": "2023-05-01T17:15:00",
        "references": [
            "https://www.zyxel.com/global/en/support/security-advisories/zyxel-security-advisory-for-multiple-vulnerabilities-in-nbg-418n-v2-home-router"
        ],
        "summary": "A format string vulnerability in a binary of the Zyxel NBG-418N v2 firmware versions prior to V1.00(AARP.14)C0 could allow a remote authenticated attacker to cause denial-of-service (DoS) conditions on an affected device."
    },
    {
        "Modified": "2023-05-01T17:15:00",
        "Published": "2023-05-01T17:15:00",
        "access": {},
        "assigner": "security@zyxel.com.tw",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-22924",
        "impact": {},
        "last-modified": "2023-05-01T17:15:00",
        "references": [
            "https://www.zyxel.com/global/en/support/security-advisories/zyxel-security-advisory-for-multiple-vulnerabilities-in-nbg-418n-v2-home-router"
        ],
        "summary": "A buffer overflow vulnerability in the Zyxel NBG-418N v2 firmware versions prior to V1.00(AARP.14)C0 could allow a remote authenticated attacker with administrator privileges to cause denial-of-service (DoS) conditions by executing crafted CLI commands on a vulnerable device."
    },
    {
        "Modified": "2023-05-01T17:11:00",
        "Published": "2023-04-19T00:15:00",
        "access": {},
        "assigner": "security-advisories@github.com",
        "cvss": null,
        "cwe": "CWE-89",
        "id": "CVE-2023-30553",
        "impact": {},
        "last-modified": "2023-05-01T17:11:00",
        "references": [
            "https://github.com/hhyo/Archery/security/advisories/GHSA-hvcq-r2r2-34ch"
        ],
        "summary": "Archery is an open source SQL audit platform. The Archery project contains multiple SQL injection vulnerabilities, that may allow an attacker to query the connected databases. Affected versions are subject to multiple SQL injections in the `sql_api/api_workflow.py` endpoint `ExecuteCheck`. User input coming from the `db_name` parameter value and the `full_sql` parameter value in the `api_workflow.py` `ExecuteCheck` endpoint is passed to the methods that follow in given SQL engine implementations, which concatenate user input unsafely into a SQL query and afterwards pass it to the `query` method of each database engine for execution. The affected methods are `execute_check` in `sql/engines/clickhouse.py` which concatenates input which is passed to execution on the database in the `sql/engines/clickhouse.py` `query` method, `execute_check` in `sql/engines/goinception.py`which concatenates input which is passed to execution on the database in the `sql/engines/goinception.py` `query` method, `execute_check` in `sql/engines/oracle.py`which passes unsafe user input into the `object_name_check` method in `sql/engines/oracle.py` which in turn is passed to execution on the database in the `sql/engines/oracle.py` `query` method. Each of these issues may be mitigated by escaping user input or by using prepared statements when executing SQL queries. This issue is also indexed as `GHSL-2022-102`."
    },
    {
        "Modified": "2023-05-01T16:48:00",
        "Published": "2023-04-19T00:15:00",
        "access": {},
        "assigner": "security-advisories@github.com",
        "cvss": null,
        "cwe": "CWE-89",
        "id": "CVE-2023-30552",
        "impact": {},
        "last-modified": "2023-05-01T16:48:00",
        "references": [
            "https://github.com/hhyo/Archery/security/advisories/GHSA-9jvj-8h33-6cqp"
        ],
        "summary": "Archery is an open source SQL audit platform. The Archery project contains multiple SQL injection vulnerabilities, that may allow an attacker to query the connected databases. Affected versions are subject to SQL injection in the `sql/instance.py` endpoint's `describe` method. In several cases, user input coming from the `tb_name` parameter value,  the `db_name` parameter value or the `schema_name` value in the `sql/instance.py` `describe` endpoint is passed to the `describe_table` methods in given SQL engine implementations, which concatenate user input unsafely into a SQL query and afterwards pass it to the `query` method of each database engine for execution. Please take into account that in some cases all three parameter values are concatenated, in other only one or two of them. The affected methods are: `describe_table` in `sql/engines/clickhouse.py`which concatenates input which is passed to execution on the database in the  `query` method in `sql/engines/clickhouse.py`, `describe_table` in `sql/engines/mssql.py` which concatenates input which is passed to execution on the database in the `query` methods in `sql/engines/mssql.py`, `describe_table` in `sql/engines/mysql.py`which concatenates input which is passed to execution on the database in the `query` method in `sql/engines/mysql.py`, `describe_table` in `sql/engines/oracle.py` which concatenates input which is passed to execution on the database in the `query` methods in `sql/engines/oracle.py`, `describe_table` in `sql/engines/pgsql.py`which concatenates input which is passed to execution on the database in the `query` methods in `sql/engines/pgsql.py`, `describe_table` in `sql/engines/phoenix.py` which concatenates input which is passed to execution on the database in the  `query` method in `sql/engines/phoenix.py`. Each of these issues may be mitigated by escaping user input or by using prepared statements when executing SQL queries. This issue is also indexed as `GHSL-2022-101`.\n"
    },
    {
        "Modified": "2023-05-01T16:38:00",
        "Published": "2023-04-17T22:15:00",
        "access": {},
        "assigner": "security-advisories@github.com",
        "cvss": null,
        "cwe": "CWE-436",
        "id": "CVE-2023-30536",
        "impact": {},
        "last-modified": "2023-05-01T16:38:00",
        "references": [
            "https://github.com/slimphp/Slim-Psr7/security/advisories/GHSA-q2qj-628g-vhfw",
            "https://www.rfc-editor.org/rfc/rfc7230#section-3.2.4",
            "https://github.com/slimphp/Slim-Psr7/commit/ed1d553225dd190875d8814c47460daed4b550bb"
        ],
        "summary": "slim/psr7 is a PSR-7 implementation for use with Slim 4. In versions prior to 1.6.1 an attacker could sneak in a newline (\\n) into both the header names and values. While the specification states that \\r\\n\\r\\n is used to terminate the header list, many servers in the wild will also accept \\n\\n. An attacker that is able to control the header names that are passed to Slilm-Psr7 would be able to intentionally craft invalid messages, possibly causing application errors or invalid HTTP requests being sent out with an PSR-18 HTTP client. The latter might present a denial of service vector if a remote service’s web application firewall bans the application due to the receipt of malformed requests. The issue has been patched in version 1.6.1. There are no known workarounds to this issue. Users are advised to upgrade."
    },
    {
        "Modified": "2023-05-01T16:36:00",
        "Published": "2023-04-21T08:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-89",
        "id": "CVE-2023-2208",
        "impact": {},
        "last-modified": "2023-05-01T16:36:00",
        "references": [
            "https://vuldb.com/?ctiid.226973",
            "https://github.com/E1CHO/cve_hub/blob/main/Retro%20Basketball%20Shoes%20Online%20Store/Retro%20Basketball%20Shoes%20Online%20Store%20-%20vuln%204.pdf",
            "https://vuldb.com/?id.226973"
        ],
        "summary": "A vulnerability, which was classified as critical, has been found in Campcodes Retro Basketball Shoes Online Store 1.0. This issue affects some unknown processing of the file details.php. The manipulation of the argument id leads to sql injection. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. The identifier VDB-226973 was assigned to this vulnerability."
    },
    {
        "Modified": "2023-05-01T16:31:00",
        "Published": "2023-04-19T00:15:00",
        "access": {},
        "assigner": "security-advisories@github.com",
        "cvss": null,
        "cwe": "CWE-74",
        "id": "CVE-2023-29523",
        "impact": {},
        "last-modified": "2023-05-01T16:31:00",
        "references": [
            "https://github.com/xwiki/xwiki-platform/security/advisories/GHSA-x764-ff8r-9hpx",
            "https://jira.xwiki.org/browse/XWIKI-20327",
            "https://extensions.xwiki.org/xwiki/bin/view/Extension/App%20Within%20Minutes%20Application",
            "https://github.com/xwiki/xwiki-platform/commit/0d547181389f7941e53291af940966413823f61c"
        ],
        "summary": "XWiki Platform is a generic wiki platform offering runtime services for applications built on top of it. Any user who can edit their own user profile can execute arbitrary script macros including Groovy and Python macros that allow remote code execution including unrestricted read and write access to all wiki contents. The same vulnerability can also be exploited in other contexts where the `display` method on a document is used to display a field with wiki syntax, for example in applications created using `App Within Minutes`. This has been patched in XWiki 13.10.11, 14.4.8, 14.10.2 and 15.0RC1. There is no workaround apart from upgrading."
    },
    {
        "Modified": "2023-05-01T16:26:00",
        "Published": "2023-04-21T08:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-89",
        "id": "CVE-2023-2206",
        "impact": {},
        "last-modified": "2023-05-01T16:26:00",
        "references": [
            "https://vuldb.com/?id.226971",
            "https://vuldb.com/?ctiid.226971",
            "https://github.com/E1CHO/cve_hub/blob/main/Retro%20Basketball%20Shoes%20Online%20Store/Retro%20Basketball%20Shoes%20Online%20Store%20-%20vuln%202.pdf"
        ],
        "summary": "A vulnerability classified as critical has been found in Campcodes Retro Basketball Shoes Online Store 1.0. This affects an unknown part of the file contactus.php. The manipulation of the argument email leads to sql injection. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used. The associated identifier of this vulnerability is VDB-226971."
    },
    {
        "Modified": "2023-05-01T16:15:00",
        "Published": "2023-05-01T16:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-29635",
        "impact": {},
        "last-modified": "2023-05-01T16:15:00",
        "references": [
            "https://github.com/Antabot/White-Jotter/issues/157",
            "https://github.com/Antabot/White-Jotter/blob/c1c5d66fda090b986b8f46a7132d403e3b038c5d/wj/src/main/java/com/gm/wj/controller/LibraryController.java#L63"
        ],
        "summary": "File upload vulnerability in Antabot White-Jotter v0.2.2, allows remote attackers to execute malicious code via the file parameter to function coversUpload."
    },
    {
        "Modified": "2023-05-01T16:15:00",
        "Published": "2023-05-01T16:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-29636",
        "impact": {},
        "last-modified": "2023-05-01T16:15:00",
        "references": [
            "https://github.com/ZHENFENG13/My-Blog/issues/131"
        ],
        "summary": "Cross site scripting (XSS) vulnerability in ZHENFENG13 My-Blog, allows attackers to inject arbitrary web script or HTML via the \"title\" field in the \"blog management\" page due to the the default configuration not using MyBlogUtils.cleanString."
    },
    {
        "Modified": "2023-05-01T16:15:00",
        "Published": "2023-05-01T16:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-29637",
        "impact": {},
        "last-modified": "2023-05-01T16:15:00",
        "references": [
            "https://github.com/Qbian61/forum-java/issues/13"
        ],
        "summary": "Cross Site Scripting (XSS) vulnerability in Qbian61 forum-java, allows attackers to inject arbitrary web script or HTML via editing the article content in the \"article editor\" page."
    },
    {
        "Modified": "2023-05-01T16:15:00",
        "Published": "2023-05-01T16:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-29638",
        "impact": {},
        "last-modified": "2023-05-01T16:15:00",
        "references": [
            "https://github.com/WinterChenS/my-site/issues/74"
        ],
        "summary": "Cross Site Scripting (XSS) vulnerability in WinterChenS my-site before commit 3f0423da6d5200c7a46e200da145c1f54ee18548, allows attackers to inject arbitrary web script or HTML via editing blog articles."
    },
    {
        "Modified": "2023-05-01T16:15:00",
        "Published": "2023-05-01T16:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-29639",
        "impact": {},
        "last-modified": "2023-05-01T16:15:00",
        "references": [
            "https://github.com/ZHENFENG13/My-Blog/issues/131"
        ],
        "summary": "Cross site scripting (XSS) vulnerability in ZHENFENG13 My-Blog, allows attackers to inject arbitrary web script or HTML via editing an article in the \"blog article\" page due to the default configuration not utilizing MyBlogUtils.cleanString."
    },
    {
        "Modified": "2023-05-01T16:15:00",
        "Published": "2023-05-01T16:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-29641",
        "impact": {},
        "last-modified": "2023-05-01T16:15:00",
        "references": [
            "https://github.com/pandao/editor.md/issues/985"
        ],
        "summary": "Cross Site Scripting (XSS) vulnerability in pandao editor.md thru 1.5.0 allows attackers to inject arbitrary web script or HTML via crafted markdown text."
    },
    {
        "Modified": "2023-05-01T16:15:00",
        "Published": "2023-05-01T16:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-29643",
        "impact": {},
        "last-modified": "2023-05-01T16:15:00",
        "references": [
            "https://github.com/perfree/PerfreeBlog/issues/14"
        ],
        "summary": "Cross Site Scripting (XSS) vulnerability in PerfreeBlog 3.1.2 allows attackers to execute arbitrary code via the Post function."
    },
    {
        "Modified": "2023-05-01T16:15:00",
        "Published": "2023-05-01T16:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-89",
        "id": "CVE-2023-2451",
        "impact": {},
        "last-modified": "2023-05-01T16:15:00",
        "references": [
            "https://vuldb.com/?id.227795",
            "https://vuldb.com/?ctiid.227795",
            "https://github.com/ShellHunTerAndyLABA/bug_report/blob/main/SQLi-1.md"
        ],
        "summary": "A vulnerability was found in SourceCodester Online DJ Management System 1.0 and classified as critical. This issue affects some unknown processing of the file /admin/bookings/view_details.php of the component GET Parameter Handler. The manipulation of the argument id leads to sql injection. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. The associated identifier of this vulnerability is VDB-227795."
    },
    {
        "Modified": "2023-05-01T16:14:00",
        "Published": "2023-04-21T08:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-89",
        "id": "CVE-2023-2207",
        "impact": {},
        "last-modified": "2023-05-01T16:14:00",
        "references": [
            "https://vuldb.com/?id.226972",
            "https://vuldb.com/?ctiid.226972",
            "https://github.com/E1CHO/cve_hub/blob/main/Retro%20Basketball%20Shoes%20Online%20Store/Retro%20Basketball%20Shoes%20Online%20Store%20-%20vuln%203.pdf"
        ],
        "summary": "A vulnerability classified as critical was found in Campcodes Retro Basketball Shoes Online Store 1.0. This vulnerability affects unknown code of the file contactus1.php. The manipulation of the argument email leads to sql injection. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used. The identifier of this vulnerability is VDB-226972."
    },
    {
        "Modified": "2023-05-01T16:10:00",
        "Published": "2023-04-21T07:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-89",
        "id": "CVE-2023-2205",
        "impact": {},
        "last-modified": "2023-05-01T16:10:00",
        "references": [
            "https://vuldb.com/?id.226970",
            "https://vuldb.com/?ctiid.226970",
            "https://github.com/E1CHO/cve_hub/blob/main/Retro%20Basketball%20Shoes%20Online%20Store/Retro%20Basketball%20Shoes%20Online%20Store%20-%20vuln%201.pdf"
        ],
        "summary": "A vulnerability was found in Campcodes Retro Basketball Shoes Online Store 1.0. It has been rated as critical. Affected by this issue is some unknown functionality of the file /function/login.php. The manipulation of the argument email leads to sql injection. The attack may be launched remotely. The exploit has been disclosed to the public and may be used. VDB-226970 is the identifier assigned to this vulnerability."
    },
    {
        "Modified": "2023-05-01T16:08:00",
        "Published": "2023-04-21T07:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-89",
        "id": "CVE-2023-2204",
        "impact": {},
        "last-modified": "2023-05-01T16:08:00",
        "references": [
            "https://github.com/E1CHO/cve_hub/blob/main/Retro%20Basketball%20Shoes%20Online%20Store/Retro%20Basketball%20Shoes%20Online%20Store%20-%20vuln%205.pdf",
            "https://vuldb.com/?id.226969",
            "https://vuldb.com/?ctiid.226969"
        ],
        "summary": "A vulnerability was found in Campcodes Retro Basketball Shoes Online Store 1.0. It has been declared as critical. Affected by this vulnerability is an unknown functionality of the file faqs.php. The manipulation of the argument id leads to sql injection. The attack can be launched remotely. The exploit has been disclosed to the public and may be used. The identifier VDB-226969 was assigned to this vulnerability."
    },
    {
        "Modified": "2023-05-01T15:59:00",
        "Published": "2023-04-21T05:15:00",
        "access": {},
        "assigner": "security@huntr.dev",
        "cvss": null,
        "cwe": "CWE-79",
        "id": "CVE-2023-1892",
        "impact": {},
        "last-modified": "2023-05-01T15:59:00",
        "references": [
            "https://github.com/sidekiq/sidekiq/commit/458fdf74176a9881478c48dc5cf0269107b22214",
            "https://huntr.dev/bounties/e35e5653-c429-4fb8-94a3-cbc123ae4777"
        ],
        "summary": "Cross-site Scripting (XSS) - Reflected in GitHub repository sidekiq/sidekiq prior to 7.0.8."
    },
    {
        "Modified": "2023-05-01T15:46:00",
        "Published": "2023-04-20T18:15:00",
        "access": {},
        "assigner": "security-advisories@github.com",
        "cvss": null,
        "cwe": "CWE-79",
        "id": "CVE-2023-29528",
        "impact": {},
        "last-modified": "2023-05-01T15:46:00",
        "references": [
            "https://jira.xwiki.org/browse/XWIKI-20348",
            "https://github.com/xwiki/xwiki-commons/security/advisories/GHSA-x37v-36wv-6v6h",
            "https://jira.xwiki.org/browse/XCOMMONS-2568",
            "https://github.com/xwiki/xwiki-commons/commit/8ff1a9d7e5d7b45b690134a537d53dc05cae04ab"
        ],
        "summary": "XWiki Commons are technical libraries common to several other top level XWiki projects. The \"restricted\" mode of the HTML cleaner in XWiki, introduced in version 4.2-milestone-1 and massively improved in version 14.6-rc-1, allowed the injection of arbitrary HTML code and thus cross-site scripting via invalid HTML comments. As a consequence, any code relying on this \"restricted\" mode for security is vulnerable to JavaScript injection (\"cross-site scripting\"/XSS). When a privileged user with programming rights visits such a comment in XWiki, the malicious JavaScript code is executed in the context of the user session. This allows server-side code execution with programming rights, impacting the confidentiality, integrity and availability of the XWiki instance. This problem has been patched in XWiki 14.10, HTML comments are now removed in restricted mode and a check has been introduced that ensures that comments don't start with `>`. There are no known workarounds apart from upgrading to a version including the fix.\n"
    },
    {
        "Modified": "2023-05-01T15:26:00",
        "Published": "2023-04-10T02:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "NVD-CWE-noinfo",
        "id": "CVE-2023-30456",
        "impact": {},
        "last-modified": "2023-05-01T15:26:00",
        "references": [
            "https://github.com/torvalds/linux/commit/112e66017bff7f2837030f34c2bc19501e9212d5",
            "https://cdn.kernel.org/pub/linux/kernel/v6.x/ChangeLog-6.2.8"
        ],
        "summary": "An issue was discovered in arch/x86/kvm/vmx/nested.c in the Linux kernel before 6.2.8. nVMX on x86_64 lacks consistency checks for CR0 and CR4."
    },
    {
        "Modified": "2023-05-01T15:19:00",
        "Published": "2023-04-13T11:15:00",
        "access": {},
        "assigner": "security@apache.org",
        "cvss": null,
        "cwe": "CWE-79",
        "id": "CVE-2022-45064",
        "impact": {},
        "last-modified": "2023-05-01T15:19:00",
        "references": [
            "https://lists.apache.org/thread/hhp611hltby3whk03vx2mv7cmy3vs0ok",
            "http://www.openwall.com/lists/oss-security/2023/04/18/6"
        ],
        "summary": "The SlingRequestDispatcher doesn't correctly implement the RequestDispatcher API resulting in a generic type of include-based cross-site scripting issues on the Apache Sling level. The vulnerability is exploitable by an attacker that is able to include a resource with specific content-type and control the include path (i.e. writing content). The impact of a successful attack is privilege escalation to administrative power.\n\n\n\n\nPlease update to Apache Sling Engine >= 2.14.0 and enable the \"Check Content-Type overrides\" configuration option.\n\n\n\n\n"
    },
    {
        "Modified": "2023-05-01T15:15:00",
        "Published": "2023-05-01T15:15:00",
        "access": {},
        "assigner": "security@apache.org",
        "cvss": null,
        "cwe": "CWE-74",
        "id": "CVE-2022-45801",
        "impact": {},
        "last-modified": "2023-05-01T15:15:00",
        "references": [
            "https://lists.apache.org/thread/xbkwwpkp3n2rs2wcxg8l26mhsftxwwr9"
        ],
        "summary": "Apache StreamPark 1.0.0 to 2.0.0 have a LDAP injection vulnerability.\nLDAP Injection is an attack used to exploit web based applications\nthat construct LDAP statements based on user input. When an\napplication fails to properly sanitize user input, it's possible to\nmodify LDAP statements through techniques similar to SQL Injection.\nLDAP injection attacks could result in the granting of permissions to\nunauthorized queries, and content modification inside the LDAP tree.\nThis risk may only occur when the user logs in with ldap, and the user\nname and password login will not be affected, Users of the affected\nversions should upgrade to Apache StreamPark 2.0.0 or later.\n\n\n\n\n\n\n"
    },
    {
        "Modified": "2023-05-01T15:15:00",
        "Published": "2023-05-01T15:15:00",
        "access": {},
        "assigner": "security@apache.org",
        "cvss": null,
        "cwe": "CWE-22",
        "id": "CVE-2022-45802",
        "impact": {},
        "last-modified": "2023-05-01T15:15:00",
        "references": [
            "https://lists.apache.org/thread/thwl1v2h6r3c21x1qwff08o57qzjnst6"
        ],
        "summary": "Streampark allows any users to upload a jar as application, but there is no mandatory verification of the uploaded file type, causing users to upload some high-risk files, and may upload them to any directory, Users of the affected versions should upgrade to Apache StreamPark 2.0.0 or later\n\n\n\n\n\n\n"
    },
    {
        "Modified": "2023-05-01T15:15:00",
        "Published": "2023-05-01T15:15:00",
        "access": {},
        "assigner": "security@apache.org",
        "cvss": null,
        "cwe": "CWE-20",
        "id": "CVE-2022-46365",
        "impact": {},
        "last-modified": "2023-05-01T15:15:00",
        "references": [
            "https://lists.apache.org/thread/f68lcwrp8pcdc4yrbpcm8j7m0f5mjn7h"
        ],
        "summary": "Apache StreamPark 1.0.0 before 2.0.0 When the user successfully logs in, to modify his profile, the username will be passed to the server-layer as a parameter, but not verified whether the user name is the currently logged user and whether the user is legal, This will allow malicious attackers to send any username to modify and reset the account, Users of the affected versions should upgrade to Apache StreamPark 2.0.0 or later.\n\n\n\n\n"
    },
    {
        "Modified": "2023-05-01T15:15:00",
        "Published": "2023-05-01T15:15:00",
        "access": {},
        "assigner": "psirt@lenovo.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2022-48186",
        "impact": {},
        "last-modified": "2023-05-01T15:15:00",
        "references": [
            "https://iknow.lenovo.com.cn/detail/dc_206093.html"
        ],
        "summary": "A certificate validation vulnerability exists in the Baiying Android application which could lead to information disclosure."
    },
    {
        "Modified": "2023-05-01T15:15:00",
        "Published": "2023-05-01T15:15:00",
        "access": {},
        "assigner": "psirt@lenovo.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2022-4568",
        "impact": {},
        "last-modified": "2023-05-01T15:15:00",
        "references": [
            "https://support.lenovo.com/us/en/product_security/LEN-103545"
        ],
        "summary": "A directory permissions management vulnerability in Lenovo System Update may allow elevation of privileges."
    },
    {
        "Modified": "2023-05-01T15:15:00",
        "Published": "2023-05-01T15:15:00",
        "access": {},
        "assigner": "psirt@lenovo.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-0683",
        "impact": {},
        "last-modified": "2023-05-01T15:15:00",
        "references": [
            "https://support.lenovo.com/us/en/product_security/LEN-99936"
        ],
        "summary": "A valid, authenticated XCC user with read only access may gain elevated privileges through a specifically crafted API call."
    },
    {
        "Modified": "2023-05-01T15:15:00",
        "Published": "2023-05-01T15:15:00",
        "access": {},
        "assigner": "psirt@lenovo.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-25492",
        "impact": {},
        "last-modified": "2023-05-01T15:15:00",
        "references": [
            "https://support.lenovo.com/us/en/product_security/LEN-99936"
        ],
        "summary": "A valid, authenticated user may be able to trigger a denial of service of the XCC web user interface or other undefined behavior through a format string injection vulnerability in a web interface API."
    },
    {
        "Modified": "2023-05-01T15:15:00",
        "Published": "2023-05-01T15:15:00",
        "access": {},
        "assigner": "security-alert@hpe.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-28092",
        "impact": {},
        "last-modified": "2023-05-01T15:15:00",
        "references": [
            "https://support.hpe.com/hpesc/public/docDisplay?docLocale=en_US&docId=hpesbhf04472en_us"
        ],
        "summary": "A potential security vulnerability has been identified in HPE ProLiant RL300 Gen11 Server. The vulnerability could result in the system being vulnerable to exploits by attackers with physical access inside the server chassis.\n\n"
    },
    {
        "Modified": "2023-05-01T14:26:00",
        "Published": "2023-04-20T21:15:00",
        "access": {},
        "assigner": "secalert@redhat.com",
        "cvss": null,
        "cwe": "CWE-125",
        "id": "CVE-2023-2176",
        "impact": {},
        "last-modified": "2023-05-01T14:26:00",
        "references": [
            "https://www.spinics.net/lists/linux-rdma/msg114749.html"
        ],
        "summary": "A vulnerability was found in compare_netdev_and_ip in drivers/infiniband/core/cma.c in RDMA in the Linux Kernel. The improper cleanup results in out-of-boundary read, where a local user can utilize this problem to crash the system or escalation of privilege."
    },
    {
        "Modified": "2023-05-01T14:17:00",
        "Published": "2023-04-20T21:15:00",
        "access": {},
        "assigner": "ics-cert@hq.dhs.gov",
        "cvss": null,
        "cwe": "CWE-78",
        "id": "CVE-2023-2131",
        "impact": {},
        "last-modified": "2023-05-01T14:17:00",
        "references": [
            "https://www.cisa.gov/news-events/ics-advisories/icsa-23-110-01"
        ],
        "summary": "Versions of INEA ME RTU firmware prior to 3.36 are vulnerable to OS command injection, which could allow an attacker to remotely execute arbitrary code."
    },
    {
        "Modified": "2023-05-01T14:15:00",
        "Published": "2023-05-01T14:15:00",
        "access": {},
        "assigner": "psirt@lenovo.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-0896",
        "impact": {},
        "last-modified": "2023-05-01T14:15:00",
        "references": [
            "https://support.lenovo.com/us/en/product_security/LEN-113714"
        ],
        "summary": "A default password was reported in Lenovo Smart Clock Essential with Alexa Built In that could allow unauthorized device access to an attacker with local network access. "
    },
    {
        "Modified": "2023-05-01T14:15:00",
        "Published": "2023-05-01T14:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-30061",
        "impact": {},
        "last-modified": "2023-05-01T14:15:00",
        "references": [
            "https://www.dlink.com/en/security-bulletin/",
            "https://github.com/Zarathustra-L/IoT_Vul/tree/main/D-Link/DIR-879"
        ],
        "summary": "D-Link DIR-879 v105A1 is vulnerable to Authentication Bypass via phpcgi."
    },
    {
        "Modified": "2023-05-01T14:15:00",
        "Published": "2023-05-01T14:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-30063",
        "impact": {},
        "last-modified": "2023-05-01T14:15:00",
        "references": [
            "https://www.dlink.com/en/security-bulletin/",
            "https://github.com/Zarathustra-L/IoT_Vul/tree/main/D-Link/DIR-890L/Auth%20bypass"
        ],
        "summary": "D-Link DIR-890L FW1.10 A1 is vulnerable to Authentication bypass."
    },
    {
        "Modified": "2023-05-01T14:15:00",
        "Published": "2023-05-01T14:15:00",
        "access": {},
        "assigner": "security-advisories@github.com",
        "cvss": null,
        "cwe": "CWE-419",
        "id": "CVE-2023-30859",
        "impact": {},
        "last-modified": "2023-05-01T14:15:00",
        "references": [
            "https://github.com/tritonmc/Triton/security/advisories/GHSA-8vj5-jccf-q25r",
            "https://github.com/tritonmc/Triton/releases/tag/v3.8.4"
        ],
        "summary": "Triton is a Minecraft plugin for Spigot and BungeeCord that helps you translate your Minecraft server. The CustomPayload packet allows you to execute commands on the spigot/bukkit console. When you enable bungee mode in the config it will enable the bungee bridge and the server will begin to broadcast the 'triton:main' plugin channel. Using this plugin channel you are able to send a payload packet containing a byte (2) and a string (any spigot command). This could be used to make yourself a server operator and be used to extract other user information through phishing (pretending to be an admin), many servers use essentials so the /geoip command could be available to them, etc. This could also be modified to allow you to set the servers language, set another players language, etc. This issue affects those who have bungee enabled in config. This issue has been fixed in version 3.8.4."
    },
    {
        "Modified": "2023-05-01T14:02:00",
        "Published": "2023-04-17T22:15:00",
        "access": {},
        "assigner": "security-advisories@github.com",
        "cvss": null,
        "cwe": "CWE-352",
        "id": "CVE-2023-29213",
        "impact": {},
        "last-modified": "2023-05-01T14:02:00",
        "references": [
            "https://github.com/xwiki/xwiki-platform/commit/49fdfd633ddfa346c522d2fe71754dc72c9496ca",
            "https://jira.xwiki.org/browse/XWIKI-20291",
            "https://github.com/xwiki/xwiki-platform/security/advisories/GHSA-4655-wh7v-3vmg"
        ],
        "summary": "XWiki Platform is a generic wiki platform offering runtime services for applications built on top of it. In affected versions of `org.xwiki.platform:xwiki-platform-logging-ui` it is possible to trick a user with programming rights into visiting a constructed url where e.g., by embedding an image with this URL in a document that is viewed by a user with programming rights which will evaluate an expression in the constructed url and execute it. This issue has been addressed in versions 13.10.11, 14.4.7, and 14.10. Users are advised to upgrade. There are no known workarounds for this vulnerability.\n"
    },
    {
        "Modified": "2023-05-01T14:00:00",
        "Published": "2023-04-18T21:15:00",
        "access": {},
        "assigner": "cybersecurity@schneider-electric.com",
        "cvss": null,
        "cwe": "CWE-613",
        "id": "CVE-2023-28003",
        "impact": {},
        "last-modified": "2023-05-01T14:00:00",
        "references": [
            "https://download.schneider-electric.com/files?p_Doc_Ref=SEVD-2023-073-01&p_enDocType=Security+and+Safety+Notice&p_File_Name=SEVD-2023-073-01.pdf"
        ],
        "summary": "\n\n\nA CWE-613: Insufficient Session Expiration vulnerability exists that could allow an attacker to\nmaintain unauthorized access over a hijacked session in PME after the legitimate user has\nsigned out of their account.\n\n\n\n"
    },
    {
        "Modified": "2023-05-01T13:49:00",
        "Published": "2023-04-19T12:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "NVD-CWE-noinfo",
        "id": "CVE-2023-29921",
        "impact": {},
        "last-modified": "2023-05-01T13:49:00",
        "references": [
            "https://github.com/PowerJob/PowerJob/issues/586"
        ],
        "summary": "PowerJob V4.3.1 is vulnerable to Incorrect Access Control via the create app interface."
    },
    {
        "Modified": "2023-05-01T13:47:00",
        "Published": "2023-04-19T12:15:00",
        "access": {},
        "assigner": "VulnerabilityReporting@secomea.com",
        "cvss": null,
        "cwe": "NVD-CWE-Other",
        "id": "CVE-2023-0317",
        "impact": {},
        "last-modified": "2023-05-01T13:47:00",
        "references": [
            "https://www.secomea.com/support/cybersecurity-advisory/"
        ],
        "summary": "Unprotected Alternate Channel vulnerability in debug console of  GateManager allows system administrator to obtain sensitive information."
    },
    {
        "Modified": "2023-05-01T13:38:00",
        "Published": "2023-05-01T13:15:00",
        "access": {},
        "assigner": "security@google.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-2235",
        "impact": {},
        "last-modified": "2023-05-01T13:38:00",
        "references": [
            "https://kernel.dance/fd0815f632c24878e325821943edccc7fde947a2",
            "https://git.kernel.org/pub/scm/linux/kernel/git/torvalds/linux.git/commit/?id=fd0815f632c24878e325821943edccc7fde947a2"
        ],
        "summary": "A use-after-free vulnerability in the Linux Kernel Performance Events system can be exploited to achieve local privilege escalation.\n\nThe perf_group_detach function did not check the event's siblings' attach_state before calling add_event_to_groups(), but remove_on_exec made it possible to call list_del_event() on before detaching from their group, making it possible to use a dangling pointer causing a use-after-free vulnerability.\n\nWe recommend upgrading past commit fd0815f632c24878e325821943edccc7fde947a2.\n\n"
    },
    {
        "Modified": "2023-05-01T13:38:00",
        "Published": "2023-05-01T13:15:00",
        "access": {},
        "assigner": "security@google.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-2236",
        "impact": {},
        "last-modified": "2023-05-01T13:38:00",
        "references": [
            "https://kernel.dance/9d94c04c0db024922e886c9fd429659f22f48ea4",
            "https://git.kernel.org/pub/scm/linux/kernel/git/torvalds/linux.git/commit/?id=9d94c04c0db024922e886c9fd429659f22f48ea4"
        ],
        "summary": "A use-after-free vulnerability in the Linux Kernel io_uring subsystem can be exploited to achieve local privilege escalation.\n\nBoth io_install_fixed_file and its callers call fput in a file in case of an error, causing a reference underflow which leads to a use-after-free vulnerability.\n\nWe recommend upgrading past commit 9d94c04c0db024922e886c9fd429659f22f48ea4.\n\n"
    },
    {
        "Modified": "2023-05-01T13:38:00",
        "Published": "2023-05-01T13:15:00",
        "access": {},
        "assigner": "security@google.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-2248",
        "impact": {},
        "last-modified": "2023-05-01T13:38:00",
        "references": [
            "https://kernel.dance/3037933448f60f9acb705997eae62013ecb81e0d",
            "https://git.kernel.org/pub/scm/linux/kernel/git/torvalds/linux.git/commit/?id=3037933448f60f9acb705997eae62013ecb81e0d"
        ],
        "summary": "A heap out-of-bounds read/write vulnerability in the Linux Kernel traffic control (QoS) subsystem can be exploited to achieve local privilege escalation.\n\nThe qfq_change_class function does not properly limit the lmax variable which can lead to out-of-bounds read/write. If the TCA_QFQ_LMAX value is not offered through nlattr, lmax is determined by the MTU value of the network device. The MTU of the loopback device can be set up to 2^31-1 and as a result, it is possible to have an lmax value that exceeds QFQ_MIN_LMAX.\n\nWe recommend upgrading past commit 3037933448f60f9acb705997eae62013ecb81e0d.\n\n"
    },
    {
        "Modified": "2023-05-01T13:16:00",
        "Published": "2023-04-17T22:15:00",
        "access": {},
        "assigner": "security-advisories@github.com",
        "cvss": null,
        "cwe": "CWE-362",
        "id": "CVE-2023-30543",
        "impact": {},
        "last-modified": "2023-05-01T13:16:00",
        "references": [
            "https://github.com/Uniswap/web3-react/pull/749",
            "https://github.com/Uniswap/web3-react/security/advisories/GHSA-8pf3-6fgr-3g3g"
        ],
        "summary": "@web3-react is a framework for building Ethereum Apps . In affected versions the `chainId` may be outdated if the user changes chains as part of the connection flow. This means that the value of `chainId` returned by `useWeb3React()` may be incorrect. In an application, this means that any data derived from `chainId` could be incorrect. For example, if a swapping application derives a wrapped token contract address from the `chainId` *and* a user has changed chains as part of their connection flow the application could cause the user to send funds to the incorrect address when wrapping. This issue has been addressed in PR #749 and is available in updated npm artifacts. There are no known workarounds for this issue. Users are advised to upgrade.\n\n\n"
    },
    {
        "Modified": "2023-05-01T10:39:00",
        "Published": "2023-05-01T05:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-79",
        "id": "CVE-2018-25085",
        "impact": {},
        "last-modified": "2023-05-01T10:39:00",
        "references": [
            "https://vuldb.com/?ctiid.227755",
            "https://www.drupal.org/sa-contrib-2018-079",
            "https://git.drupalcode.org/project/responsive_menus/-/commit/3c554b31d32a367188f44d44857b061eac949fb8",
            "https://www.drupal.org/project/responsive_menus/releases/7.x-1.7",
            "https://vuldb.com/?id.227755"
        ],
        "summary": "A vulnerability classified as problematic was found in Responsive Menus 7.x-1.x-dev on Drupal. Affected by this vulnerability is the function responsive_menus_admin_form_submit of the file responsive_menus.module of the component Configuration Setting Handler. The manipulation leads to cross site scripting. The attack can be launched remotely. Upgrading to version 7.x-1.7 is able to address this issue. The name of the patch is 3c554b31d32a367188f44d44857b061eac949fb8. It is recommended to upgrade the affected component. The associated identifier of this vulnerability is VDB-227755."
    },
    {
        "Modified": "2023-05-01T10:39:00",
        "Published": "2023-05-01T02:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-22",
        "id": "CVE-2015-10105",
        "impact": {},
        "last-modified": "2023-05-01T10:39:00",
        "references": [
            "https://github.com/wp-plugins/ip-blacklist-cloud/releases/tag/3.43",
            "https://vuldb.com/?id.227757",
            "https://github.com/wp-plugins/ip-blacklist-cloud/commit/6e6fe8c6fda7cbc252eef083105e08d759c07312",
            "https://vuldb.com/?ctiid.227757"
        ],
        "summary": "A vulnerability, which was classified as critical, was found in IP Blacklist Cloud Plugin up to 3.42 on WordPress. This affects the function valid_js_identifier of the file ip_blacklist_cloud.php of the component CSV File Import. The manipulation of the argument filename leads to path traversal. It is possible to initiate the attack remotely. Upgrading to version 3.43 is able to address this issue. The name of the patch is 6e6fe8c6fda7cbc252eef083105e08d759c07312. It is recommended to upgrade the affected component. The identifier VDB-227757 was assigned to this vulnerability."
    },
    {
        "Modified": "2023-05-01T10:39:00",
        "Published": "2023-04-30T21:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-601",
        "id": "CVE-2015-10104",
        "impact": {},
        "last-modified": "2023-05-01T10:39:00",
        "references": [
            "https://github.com/wp-plugins/icons-for-features/releases/tag/1.0.1",
            "https://github.com/wp-plugins/icons-for-features/commit/63124c021ae24b68e56872530df26eb4268ad633",
            "https://vuldb.com/?id.227756",
            "https://vuldb.com/?ctiid.227756"
        ],
        "summary": "A vulnerability, which was classified as problematic, has been found in Icons for Features Plugin 1.0.0 on WordPress. Affected by this issue is some unknown functionality of the file classes/class-icons-for-features-admin.php. The manipulation of the argument redirect_url leads to open redirect. The attack may be launched remotely. Upgrading to version 1.0.1 is able to address this issue. The name of the patch is 63124c021ae24b68e56872530df26eb4268ad633. It is recommended to upgrade the affected component. The identifier of this vulnerability is VDB-227756."
    },
    {
        "Modified": "2023-05-01T10:39:00",
        "Published": "2023-04-30T01:15:00",
        "access": {},
        "assigner": "security@huntr.dev",
        "cvss": null,
        "cwe": "CWE-79",
        "id": "CVE-2023-2428",
        "impact": {},
        "last-modified": "2023-05-01T10:39:00",
        "references": [
            "https://huntr.dev/bounties/cee65b6d-b003-4e6a-9d14-89aa94bee43e",
            "https://github.com/thorsten/phpmyfaq/commit/0a4980d870bac92df945f6d022726c4e3ed584ab"
        ],
        "summary": "Cross-site Scripting (XSS) - Stored in GitHub repository thorsten/phpmyfaq prior to 3.1.13."
    },
    {
        "Modified": "2023-05-01T10:39:00",
        "Published": "2023-04-30T03:15:00",
        "access": {},
        "assigner": "security@huntr.dev",
        "cvss": null,
        "cwe": "CWE-284",
        "id": "CVE-2023-2429",
        "impact": {},
        "last-modified": "2023-05-01T10:39:00",
        "references": [
            "https://github.com/thorsten/phpmyfaq/commit/07552f5577ff8b1e6f7cdefafcce9b2a744d3a24",
            "https://huntr.dev/bounties/20d3a0b3-2693-4bf1-b196-10741201a540"
        ],
        "summary": "Improper Access Control in GitHub repository thorsten/phpmyfaq prior to 3.1.13."
    },
    {
        "Modified": "2023-05-01T10:39:00",
        "Published": "2023-04-29T22:15:00",
        "access": {},
        "assigner": "security@huntr.dev",
        "cvss": null,
        "cwe": "CWE-823",
        "id": "CVE-2023-2426",
        "impact": {},
        "last-modified": "2023-05-01T10:39:00",
        "references": [
            "https://huntr.dev/bounties/3451be4c-91c8-4d08-926b-cbff7396f425",
            "https://github.com/vim/vim/commit/caf642c25de526229264cab9425e7c9979f3509b"
        ],
        "summary": "Use of Out-of-range Pointer Offset in GitHub repository vim/vim prior to 9.0.1499."
    },
    {
        "Modified": "2023-05-01T10:39:00",
        "Published": "2023-04-29T15:15:00",
        "access": {},
        "assigner": "psirt@us.ibm.com",
        "cvss": null,
        "cwe": "CWE-327",
        "id": "CVE-2023-30441",
        "impact": {},
        "last-modified": "2023-05-01T10:39:00",
        "references": [
            "https://www.ibm.com/support/pages/node/6985011",
            "https://www.ibm.com/support/pages/node/6987167",
            "https://www.ibm.com/support/pages/node/6986617",
            "https://www.ibm.com/support/pages/node/6986637",
            "https://exchange.xforce.ibmcloud.com/vulnerabilities/253188"
        ],
        "summary": "IBM Runtime Environment, Java Technology Edition IBMJCEPlus and JSSE 8.0.7.0 through 8.0.7.11 components could expose sensitive information using a combination of flaws and configurations.  IBM X-Force ID:  253188."
    },
    {
        "Modified": "2023-05-01T10:39:00",
        "Published": "2023-04-29T08:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-434",
        "id": "CVE-2023-2424",
        "impact": {},
        "last-modified": "2023-05-01T10:39:00",
        "references": [
            "https://vuldb.com/?id.227750",
            "https://vuldb.com/?ctiid.227750",
            "https://gitee.com/xieqiangweb/cve/blob/master/dede/dedecms%20rce.md"
        ],
        "summary": "A vulnerability was found in DedeCMS 5.7.106 and classified as critical. Affected by this issue is the function UpDateMemberModCache of the file uploads/dede/config.php. The manipulation leads to unrestricted upload. The attack may be launched remotely. The exploit has been disclosed to the public and may be used. VDB-227750 is the identifier assigned to this vulnerability."
    },
    {
        "Modified": "2023-05-01T10:39:00",
        "Published": "2023-04-29T08:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-79",
        "id": "CVE-2023-2425",
        "impact": {},
        "last-modified": "2023-05-01T10:39:00",
        "references": [
            "https://vuldb.com/?id.227751",
            "https://vuldb.com/?ctiid.227751",
            "https://github.com/sssddc11/bug_report/blob/master/XSS-1.md"
        ],
        "summary": "A vulnerability was found in SourceCodester Simple Student Information System 1.0. It has been classified as problematic. This affects an unknown part of the file /classes/Master.php?f=save_course of the component Add New Course. The manipulation of the argument name with the input <script>alert(document.cookie)</script> leads to cross site scripting. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used. The associated identifier of this vulnerability is VDB-227751."
    },
    {
        "Modified": "2023-05-01T10:39:00",
        "Published": "2023-04-29T00:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-89",
        "id": "CVE-2023-2412",
        "impact": {},
        "last-modified": "2023-05-01T10:39:00",
        "references": [
            "https://vuldb.com/?id.227706",
            "https://vuldb.com/?ctiid.227706",
            "https://github.com/Yp1oneer/cve_hub/blob/main/AC%20Repair%20and%20Services%20System/SQL-Injection-5.pdf"
        ],
        "summary": "A vulnerability was found in SourceCodester AC Repair and Services System 1.0. It has been classified as critical. Affected is an unknown function of the file /admin/user/manage_user.php. The manipulation of the argument id leads to sql injection. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used. VDB-227706 is the identifier assigned to this vulnerability."
    },
    {
        "Modified": "2023-05-01T10:39:00",
        "Published": "2023-04-29T00:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-89",
        "id": "CVE-2023-2413",
        "impact": {},
        "last-modified": "2023-05-01T10:39:00",
        "references": [
            "https://vuldb.com/?id.227707",
            "https://vuldb.com/?ctiid.227707",
            "https://github.com/Yp1oneer/cve_hub/blob/main/AC%20Repair%20and%20Services%20System/SQL-Injection-6.pdf"
        ],
        "summary": "A vulnerability was found in SourceCodester AC Repair and Services System 1.0. It has been declared as critical. Affected by this vulnerability is an unknown functionality of the file /admin/bookings/manage_booking.php. The manipulation of the argument id leads to sql injection. The attack can be launched remotely. The exploit has been disclosed to the public and may be used. The associated identifier of this vulnerability is VDB-227707."
    },
    {
        "Modified": "2023-05-01T10:39:00",
        "Published": "2023-04-29T00:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-31484",
        "impact": {},
        "last-modified": "2023-05-01T10:39:00",
        "references": [
            "https://github.com/andk/cpanpm/pull/175",
            "https://www.openwall.com/lists/oss-security/2023/04/18/14",
            "https://metacpan.org/dist/CPAN/changes",
            "https://blog.hackeriet.no/perl-http-tiny-insecure-tls-default-affects-cpan-modules/",
            "http://www.openwall.com/lists/oss-security/2023/04/29/1"
        ],
        "summary": "CPAN.pm before 2.35 does not verify TLS certificates when downloading distributions over HTTPS."
    },
    {
        "Modified": "2023-05-01T10:39:00",
        "Published": "2023-04-29T00:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-31485",
        "impact": {},
        "last-modified": "2023-05-01T10:39:00",
        "references": [
            "https://github.com/bluefeet/GitLab-API-v4/pull/57",
            "https://www.openwall.com/lists/oss-security/2023/04/18/14",
            "https://github.com/chansen/p5-http-tiny/pull/151",
            "https://blog.hackeriet.no/perl-http-tiny-insecure-tls-default-affects-cpan-modules/",
            "http://www.openwall.com/lists/oss-security/2023/04/29/1"
        ],
        "summary": "GitLab::API::v4 through 0.26 does not verify TLS certificates when connecting to a GitLab server, enabling machine-in-the-middle attacks."
    },
    {
        "Modified": "2023-05-01T10:39:00",
        "Published": "2023-04-29T00:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-31486",
        "impact": {},
        "last-modified": "2023-05-01T10:39:00",
        "references": [
            "https://www.openwall.com/lists/oss-security/2023/04/18/14",
            "https://hackeriet.github.io/cpan-http-tiny-overview/",
            "https://blog.hackeriet.no/perl-http-tiny-insecure-tls-default-affects-cpan-modules/",
            "https://www.reddit.com/r/perl/comments/111tadi/psa_httptiny_disabled_ssl_verification_by_default/",
            "http://www.openwall.com/lists/oss-security/2023/04/29/1"
        ],
        "summary": "HTTP::Tiny 0.082, a Perl core module since 5.13.9 and available standalone on CPAN, has an insecure default TLS configuration where users must opt in to verify certificates."
    },
    {
        "Modified": "2023-05-01T10:39:00",
        "Published": "2023-04-29T01:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-428",
        "id": "CVE-2023-2417",
        "impact": {},
        "last-modified": "2023-05-01T10:39:00",
        "references": [
            "https://vuldb.com/?id.227714",
            "https://vuldb.com/?ctiid.227714"
        ],
        "summary": "A vulnerability was found in ks-soft Advanced Host Monitor up to 12.56 and classified as problematic. Affected by this issue is some unknown functionality of the file C:\\Program Files (x86)\\HostMonitor\\RMA-Win\\rma_active.exe. The manipulation leads to unquoted search path. It is possible to launch the attack on the local host. Upgrading to version 12.60 is able to address this issue. It is recommended to upgrade the affected component. VDB-227714 is the identifier assigned to this vulnerability."
    },
    {
        "Modified": "2023-05-01T10:39:00",
        "Published": "2023-04-29T01:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-330",
        "id": "CVE-2023-2418",
        "impact": {},
        "last-modified": "2023-05-01T10:39:00",
        "references": [
            "https://vuldb.com/?id.227715",
            "https://vuldb.com/?ctiid.227715",
            "https://www.cnblogs.com/andao/p/17330864.html"
        ],
        "summary": "A vulnerability was found in Konga 2.8.3 on Kong. It has been classified as problematic. This affects an unknown part of the component Login API. The manipulation leads to insufficiently random values. The complexity of an attack is rather high. The exploitability is told to be difficult. The exploit has been disclosed to the public and may be used. It is recommended to change the configuration settings. The associated identifier of this vulnerability is VDB-227715."
    },
    {
        "Modified": "2023-05-01T10:39:00",
        "Published": "2023-04-29T01:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-434",
        "id": "CVE-2023-2419",
        "impact": {},
        "last-modified": "2023-05-01T10:39:00",
        "references": [
            "https://github.com/crmeb/CRMEB/issues/77",
            "https://vuldb.com/?id.227716",
            "https://vuldb.com/?ctiid.227716"
        ],
        "summary": "A vulnerability was found in Zhong Bang CRMEB 4.6.0. It has been declared as critical. This vulnerability affects the function videoUpload of the file \\crmeb\\app\\services\\system\\attachment\\SystemAttachmentServices.php. The manipulation of the argument filename leads to unrestricted upload. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used. The identifier of this vulnerability is VDB-227716."
    },
    {
        "Modified": "2023-05-01T10:39:00",
        "Published": "2023-04-29T02:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-89",
        "id": "CVE-2023-2420",
        "impact": {},
        "last-modified": "2023-05-01T10:39:00",
        "references": [
            "https://github.com/VG00000/elecms/blob/main/README.md",
            "https://vuldb.com/?id.227717",
            "https://vuldb.com/?ctiid.227717"
        ],
        "summary": "A vulnerability was found in MLECMS 3.0. It has been rated as critical. This issue affects the function get_url in the library /upload/inc/lib/admin of the file upload\\inc\\include\\common.func.php. The manipulation of the argument $_SERVER['REQUEST_URI'] leads to sql injection. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. The identifier VDB-227717 was assigned to this vulnerability."
    },
    {
        "Modified": "2023-05-01T10:39:00",
        "Published": "2023-04-29T02:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-79",
        "id": "CVE-2023-2421",
        "impact": {},
        "last-modified": "2023-05-01T10:39:00",
        "references": [
            "https://vuldb.com/?id.227718",
            "https://vuldb.com/?ctiid.227718",
            "https://youtu.be/4JOLhAuoizE"
        ],
        "summary": "A vulnerability classified as problematic has been found in Control iD RHiD 23.3.19.0. Affected is an unknown function of the file /v2/#/add/department. The manipulation of the argument Name leads to cross site scripting. It is possible to launch the attack remotely. VDB-227718 is the identifier assigned to this vulnerability. NOTE: The vendor was contacted early about this disclosure but did not respond in any way."
    },
    {
        "Modified": "2023-05-01T10:39:00",
        "Published": "2023-04-29T03:15:00",
        "access": {},
        "assigner": "psirt@us.ibm.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2022-41736",
        "impact": {},
        "last-modified": "2023-05-01T10:39:00",
        "references": [
            "https://exchange.xforce.ibmcloud.com/vulnerabilities/237810",
            "https://www.ibm.com/support/pages/node/6964564"
        ],
        "summary": "IBM Spectrum Scale Container Native Storage Access \n\n5.1.2.1 through 5.1.6.0\n\ncontains an unspecified vulnerability that could allow a local user to obtain root privileges.  IBM X-Force ID:  237810."
    },
    {
        "Modified": "2023-05-01T10:39:00",
        "Published": "2023-04-29T03:15:00",
        "access": {},
        "assigner": "psirt@us.ibm.com",
        "cvss": null,
        "cwe": "CWE-79",
        "id": "CVE-2022-43871",
        "impact": {},
        "last-modified": "2023-05-01T10:39:00",
        "references": [
            "https://exchange.xforce.ibmcloud.com/vulnerabilities/239707",
            "https://www.ibm.com/support/pages/node/6857799"
        ],
        "summary": "IBM Financial Transaction Manager for SWIFT Services 3.2.4 is vulnerable to cross-site scripting. This vulnerability allows users to embed arbitrary JavaScript code in the Web UI thus altering the intended functionality potentially leading to credentials disclosure within a trusted session.  IBM X-Force ID:  239707."
    },
    {
        "Modified": "2023-05-01T10:39:00",
        "Published": "2023-04-29T03:15:00",
        "access": {},
        "assigner": "cve-assign@fb.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-30792",
        "impact": {},
        "last-modified": "2023-05-01T10:39:00",
        "references": [
            "https://github.com/facebook/lexical/releases/tag/v0.10.0"
        ],
        "summary": "Anchor tag hrefs in Lexical prior to v0.10.0 would render javascript: URLs, allowing for cross-site scripting on link clicks in cases where input was being parsed from untrusted sources."
    },
    {
        "Modified": "2023-05-01T10:39:00",
        "Published": "2023-04-28T23:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-89",
        "id": "CVE-2023-2408",
        "impact": {},
        "last-modified": "2023-05-01T10:39:00",
        "references": [
            "https://github.com/Yp1oneer/cve_hub/blob/main/AC%20Repair%20and%20Services%20System/SQL-Injection-1.pdf",
            "https://vuldb.com/?id.227702",
            "https://vuldb.com/?ctiid.227702"
        ],
        "summary": "A vulnerability, which was classified as critical, has been found in SourceCodester AC Repair and Services System 1.0. Affected by this issue is some unknown functionality of the file services/view.php. The manipulation of the argument id leads to sql injection. The attack may be launched remotely. The exploit has been disclosed to the public and may be used. VDB-227702 is the identifier assigned to this vulnerability."
    }
]