[
    {
        "Modified": "2024-03-20T18:15:00",
        "Published": "2024-03-20T18:15:00",
        "access": {},
        "assigner": "psirt@us.ibm.com",
        "cvss": null,
        "cwe": "CWE-20",
        "id": "CVE-2023-45177",
        "impact": {},
        "last-modified": "2024-03-20T18:15:00",
        "references": [
            "https://www.ibm.com/support/pages/node/7063661",
            "https://exchange.xforce.ibmcloud.com/vulnerabilities/268066"
        ],
        "summary": "IBM MQ 9.0 LTS, 9.1 LTS, 9.2 LTS, 9.3 LTS and 9.3 CD is vulnerable to a denial-of-service attack due to an error within the MQ clustering logic.  IBM X-Force ID:  268066."
    },
    {
        "Modified": "2024-03-20T18:15:00",
        "Published": "2024-03-20T18:15:00",
        "access": {},
        "assigner": "security-advisories@github.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-23642",
        "impact": {},
        "last-modified": "2024-03-20T18:15:00",
        "references": [
            "https://github.com/geoserver/geoserver/security/advisories/GHSA-fg9v-56hw-g525",
            "https://github.com/geoserver/geoserver/pull/7173",
            "https://github.com/geoserver/geoserver/commit/1b1835afbb9c282d1840786259aeda81c1d22b00",
            "https://github.com/geoserver/geoserver/commit/9f40265febb5939f23e2c53930c9c35e93970afe",
            "https://osgeo-org.atlassian.net/browse/GEOS-11152"
        ],
        "summary": "GeoServer is an open source software server written in Java that allows users to share and edit geospatial data. A stored cross-site scripting (XSS) vulnerability exists in versions prior to 2.23.4 and 2.24.1 that enables an authenticated administrator with workspace-level privileges to store a JavaScript payload in the GeoServer catalog that will execute in the context of another user's browser when viewed in the WMS GetMap SVG Output Format when the Simple SVG renderer is enabled. Access to the WMS SVG Format is available to all users by default although data and service security may limit users' ability to trigger the XSS. Versions 2.23.4 and 2.24.1 contain a fix for this issue."
    },
    {
        "Modified": "2024-03-20T18:15:00",
        "Published": "2024-03-20T18:15:00",
        "access": {},
        "assigner": "security-advisories@github.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-23643",
        "impact": {},
        "last-modified": "2024-03-20T18:15:00",
        "references": [
            "https://github.com/geoserver/geoserver/security/advisories/GHSA-56r3-f536-5gf7",
            "https://github.com/GeoWebCache/geowebcache/issues/1172",
            "https://github.com/GeoWebCache/geowebcache/pull/1174",
            "https://github.com/GeoWebCache/geowebcache/commit/9d010e09c784690ada8af43f594461a2553a62f0"
        ],
        "summary": "GeoServer is an open source software server written in Java that allows users to share and edit geospatial data. A stored cross-site scripting (XSS) vulnerability exists in versions prior to 2.23.2 and 2.24.1 that enables an authenticated administrator with workspace-level privileges to store a JavaScript payload in the GeoServer catalog that will execute in the context of another administrator’s browser when viewed in the GWC Seed Form. Access to the GWC Seed Form is limited to full administrators by default and granting non-administrators access to this endpoint is not recommended. Versions 2.23.2 and 2.24.1 contain a fix for this issue."
    },
    {
        "Modified": "2024-03-20T18:15:00",
        "Published": "2024-03-20T18:15:00",
        "access": {},
        "assigner": "security-advisories@github.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-23818",
        "impact": {},
        "last-modified": "2024-03-20T18:15:00",
        "references": [
            "https://github.com/geoserver/geoserver/security/advisories/GHSA-fcpm-hchj-mh72",
            "https://github.com/geoserver/geoserver/pull/7174",
            "https://github.com/geoserver/geoserver/commit/4557a832eed19ec18b9753cb97e8aa85269741d2",
            "https://github.com/geoserver/geoserver/commit/a26c32a469ee4c599236380452ffb4260361bd6f",
            "https://osgeo-org.atlassian.net/browse/GEOS-11153"
        ],
        "summary": "GeoServer is an open source software server written in Java that allows users to share and edit geospatial data. A stored cross-site scripting (XSS) vulnerability exists in versions prior to 2.23.3 and 2.24.1 that enables an authenticated administrator with workspace-level privileges to store a JavaScript payload in the GeoServer catalog that will execute in the context of another user's browser when viewed in the WMS GetMap OpenLayers Output Format.  Access to the WMS OpenLayers Format is available to all users by default although data and service security may limit users' ability to trigger the XSS. Versions 2.23.3 and 2.24.1 contain a patch for this issue."
    },
    {
        "Modified": "2024-03-20T18:15:00",
        "Published": "2024-03-20T18:15:00",
        "access": {},
        "assigner": "security-advisories@github.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-23819",
        "impact": {},
        "last-modified": "2024-03-20T18:15:00",
        "references": [
            "https://github.com/geoserver/geoserver/security/advisories/GHSA-7x76-57fr-m5r5",
            "https://github.com/geoserver/geoserver/pull/7175",
            "https://github.com/geoserver/geoserver/commit/6f04adbdc6c289f5cb815b1462a6bd790e3fb6ef",
            "https://github.com/geoserver/geoserver/commit/df65ff05250cbb498c78af906d66e0c084ace8a1",
            "https://osgeo-org.atlassian.net/browse/GEOS-11154"
        ],
        "summary": "GeoServer is an open source software server written in Java that allows users to share and edit geospatial data. A stored cross-site scripting (XSS) vulnerability exists in versions prior to 2.23.4 and 2.24.1 that enables an authenticated administrator with workspace-level privileges to store a JavaScript payload in the GeoServer catalog that will execute in the context of another user's browser when viewed in the MapML HTML Page. The MapML extension must be installed and access to the MapML HTML Page is available to all users although data security may limit users' ability to trigger the XSS. Versions 2.23.4 and 2.24.1 contain a patch for this issue."
    },
    {
        "Modified": "2024-03-20T18:15:00",
        "Published": "2024-03-20T18:15:00",
        "access": {},
        "assigner": "security-advisories@github.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-23821",
        "impact": {},
        "last-modified": "2024-03-20T18:15:00",
        "references": [
            "https://github.com/geoserver/geoserver/security/advisories/GHSA-88wc-fcj9-q3r9",
            "https://github.com/GeoWebCache/geowebcache/issues/1171",
            "https://github.com/GeoWebCache/geowebcache/pull/1173"
        ],
        "summary": "GeoServer is an open source software server written in Java that allows users to share and edit geospatial data. A stored cross-site scripting (XSS) vulnerability exists in versions prior to 2.23.4 and 2.24.1 that enables an authenticated administrator with workspace-level privileges to store a JavaScript payload in the GeoServer catalog that will execute in the context of another user's browser when viewed in the GWC Demos Page.  Access to the GWC Demos Page is available to all users although data security may limit users' ability to trigger the XSS. Versions 2.23.4 and 2.24.1 contain a patch for this issue."
    },
    {
        "Modified": "2024-03-20T18:15:00",
        "Published": "2024-03-20T18:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-2708",
        "impact": {},
        "last-modified": "2024-03-20T18:15:00",
        "references": [
            "https://vuldb.com/?id.257459",
            "https://vuldb.com/?ctiid.257459",
            "https://github.com/abcdefg-png/IoT-vulnerable/blob/main/Tenda/AC10U/v1.V15.03.06.49/more/formexeCommand.md"
        ],
        "summary": "A vulnerability was found in Tenda AC10U 15.03.06.49 and classified as critical. This issue affects the function formexeCommand of the file /goform/execCommand. The manipulation of the argument cmdinput leads to stack-based buffer overflow. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. The associated identifier of this vulnerability is VDB-257459. NOTE: The vendor was contacted early about this disclosure but did not respond in any way."
    },
    {
        "Modified": "2024-03-20T18:15:00",
        "Published": "2024-03-20T18:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-121",
        "id": "CVE-2024-2709",
        "impact": {},
        "last-modified": "2024-03-20T18:15:00",
        "references": [
            "https://vuldb.com/?id.257460",
            "https://vuldb.com/?ctiid.257460",
            "https://github.com/abcdefg-png/IoT-vulnerable/blob/main/Tenda/AC10U/v1.V15.03.06.49/more/fromSetRouteStatic.md"
        ],
        "summary": "A vulnerability was found in Tenda AC10U 15.03.06.49. It has been classified as critical. Affected is the function fromSetRouteStatic of the file /goform/SetStaticRouteCfg. The manipulation of the argument list leads to stack-based buffer overflow. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used. The identifier of this vulnerability is VDB-257460. NOTE: The vendor was contacted early about this disclosure but did not respond in any way."
    },
    {
        "Modified": "2024-03-20T18:15:00",
        "Published": "2024-03-20T18:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-121",
        "id": "CVE-2024-2710",
        "impact": {},
        "last-modified": "2024-03-20T18:15:00",
        "references": [
            "https://vuldb.com/?id.257461",
            "https://vuldb.com/?ctiid.257461",
            "https://github.com/abcdefg-png/IoT-vulnerable/blob/main/Tenda/AC10U/v1.V15.03.06.49/more/setSchedWifi_start.md"
        ],
        "summary": "A vulnerability was found in Tenda AC10U 15.03.06.49. It has been declared as critical. Affected by this vulnerability is the function setSchedWifi of the file /goform/openSchedWifi. The manipulation of the argument schedStartTime leads to stack-based buffer overflow. The attack can be launched remotely. The exploit has been disclosed to the public and may be used. The identifier VDB-257461 was assigned to this vulnerability. NOTE: The vendor was contacted early about this disclosure but did not respond in any way."
    },
    {
        "Modified": "2024-03-20T18:15:00",
        "Published": "2024-03-20T18:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-121",
        "id": "CVE-2024-2711",
        "impact": {},
        "last-modified": "2024-03-20T18:15:00",
        "references": [
            "https://vuldb.com/?id.257462",
            "https://vuldb.com/?ctiid.257462",
            "https://github.com/abcdefg-png/IoT-vulnerable/blob/main/Tenda/AC10U/v1.V15.03.06.48/more/addWifiMacFilter_deviceMac.md"
        ],
        "summary": "A vulnerability was found in Tenda AC10U 15.03.06.48. It has been rated as critical. Affected by this issue is the function addWifiMacFilter of the file /goform/addWifiMacFilter. The manipulation of the argument deviceMac leads to stack-based buffer overflow. The attack may be launched remotely. The exploit has been disclosed to the public and may be used. VDB-257462 is the identifier assigned to this vulnerability. NOTE: The vendor was contacted early about this disclosure but did not respond in any way."
    },
    {
        "Modified": "2024-03-20T17:18:00",
        "Published": "2024-03-20T16:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-121",
        "id": "CVE-2024-2703",
        "impact": {},
        "last-modified": "2024-03-20T17:18:00",
        "references": [
            "https://vuldb.com/?id.257454",
            "https://vuldb.com/?ctiid.257454",
            "https://github.com/abcdefg-png/IoT-vulnerable/blob/main/Tenda/AC10U/v1.V15.03.06.49/more/formSetDeviceName_mac.md"
        ],
        "summary": "A vulnerability classified as critical has been found in Tenda AC10U 15.03.06.49. Affected is the function formSetDeviceName of the file /goform/SetOnlineDevName. The manipulation of the argument mac leads to stack-based buffer overflow. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used. VDB-257454 is the identifier assigned to this vulnerability. NOTE: The vendor was contacted early about this disclosure but did not respond in any way."
    },
    {
        "Modified": "2024-03-20T17:18:00",
        "Published": "2024-03-20T16:15:00",
        "access": {},
        "assigner": "security-advisories@github.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-51445",
        "impact": {},
        "last-modified": "2024-03-20T17:18:00",
        "references": [
            "https://github.com/geoserver/geoserver/security/advisories/GHSA-fh7p-5f6g-vj2w",
            "https://github.com/geoserver/geoserver/pull/7161",
            "https://github.com/geoserver/geoserver/commit/7db985738ff2422019ccac974cf547bae5770cad",
            "https://osgeo-org.atlassian.net/browse/GEOS-11148"
        ],
        "summary": "GeoServer is an open source software server written in Java that allows users to share and edit geospatial data. A stored cross-site scripting (XSS) vulnerability exists in versions prior to 2.23.3 and 2.24.0 that enables an authenticated administrator with workspace-level privileges to store a JavaScript payload in uploaded style/legend resources that will execute in the context of another administrator's browser when viewed in the REST Resources API.  Access to the REST Resources API is limited to full administrators by default and granting non-administrators access to this endpoint should be carefully considered as it may allow access to files containing sensitive information. Versions 2.23.3 and 2.24.0 contain a patch for this issue."
    },
    {
        "Modified": "2024-03-20T17:18:00",
        "Published": "2024-03-20T16:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-50967",
        "impact": {},
        "last-modified": "2024-03-20T17:18:00",
        "references": [
            "https://github.com/latchset/jose",
            "https://github.com/P3ngu1nW/CVE_Request/blob/main/latch-jose.md"
        ],
        "summary": "latchset jose through version 11 allows attackers to cause a denial of service (CPU consumption) via a large p2c (aka PBES2 Count) value."
    },
    {
        "Modified": "2024-03-20T17:18:00",
        "Published": "2024-03-20T16:15:00",
        "access": {},
        "assigner": "security-advisories@github.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-23634",
        "impact": {},
        "last-modified": "2024-03-20T17:18:00",
        "references": [
            "https://github.com/geoserver/geoserver/security/advisories/GHSA-75m5-hh4r-q9gx",
            "https://github.com/geoserver/geoserver/pull/7289",
            "https://github.com/geoserver/geoserver/commit/5d6af2f8ba9ad7dffae59575504a867159698772",
            "https://github.com/geoserver/geoserver/commit/c37f58fbacdfa0d581a6f99195585f70b1201f0a",
            "https://osgeo-org.atlassian.net/browse/GEOS-11213"
        ],
        "summary": "GeoServer is an open source software server written in Java that allows users to share and edit geospatial data. An arbitrary file renaming vulnerability exists in versions prior to 2.23.5 and 2.24.2 that enables an authenticated administrator with permissions to modify stores through the REST Coverage Store or Data Store API to rename arbitrary files and directories with a name that does not end in `.zip`. Store file uploads rename zip files to have a `.zip` extension if it doesn't already have one before unzipping the file.  This is fine for file and url upload methods where the files will be in a specific subdirectory of the data directory but, when using the external upload method, this allows arbitrary files and directories to be renamed. Renaming GeoServer files will most likely result in a denial of service, either completely preventing GeoServer from running or effectively deleting specific resources (such as a workspace, layer or style).  In some cases, renaming GeoServer files could revert to the default settings for that file which could be relatively harmless like removing contact information or have more serious consequences like allowing users to make OGC requests that the customized settings would have prevented them from making. The impact of renaming non-GeoServer files depends on the specific environment although some sort of denial of service is a likely outcome. Versions 2.23.5 and 2.24.2 contain a fix for this issue."
    },
    {
        "Modified": "2024-03-20T17:18:00",
        "Published": "2024-03-20T16:15:00",
        "access": {},
        "assigner": "security-advisories@github.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-23640",
        "impact": {},
        "last-modified": "2024-03-20T17:18:00",
        "references": [
            "https://github.com/geoserver/geoserver/security/advisories/GHSA-9rfr-pf2x-g4xf",
            "https://github.com/geoserver/geoserver/pull/7162",
            "https://github.com/geoserver/geoserver/pull/7181",
            "https://osgeo-org.atlassian.net/browse/GEOS-11149",
            "https://osgeo-org.atlassian.net/browse/GEOS-11155"
        ],
        "summary": "GeoServer is an open source software server written in Java that allows users to share and edit geospatial data. A stored cross-site scripting (XSS) vulnerability exists in versions prior to 2.23.3 and 2.24.0 that enables an authenticated administrator with workspace-level privileges to store a JavaScript payload in uploaded style/legend resources or in a specially crafted datastore file that will execute in the context of another user's browser when viewed in the Style Publisher. Access to the Style Publisher is available to all users although data security may limit users' ability to trigger the XSS. Versions 2.23.3 and 2.24.0 contain a fix for this issue."
    },
    {
        "Modified": "2024-03-20T17:18:00",
        "Published": "2024-03-20T16:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-121",
        "id": "CVE-2024-2704",
        "impact": {},
        "last-modified": "2024-03-20T17:18:00",
        "references": [
            "https://vuldb.com/?id.257455",
            "https://vuldb.com/?ctiid.257455",
            "https://github.com/abcdefg-png/IoT-vulnerable/blob/main/Tenda/AC10U/v1.V15.03.06.49/more/formSetFirewallCfg.md"
        ],
        "summary": "A vulnerability classified as critical was found in Tenda AC10U 15.03.06.49. Affected by this vulnerability is the function formSetFirewallCfg of the file /goform/SetFirewallCfg. The manipulation of the argument firewallEn leads to stack-based buffer overflow. The attack can be launched remotely. The exploit has been disclosed to the public and may be used. The associated identifier of this vulnerability is VDB-257455. NOTE: The vendor was contacted early about this disclosure but did not respond in any way."
    },
    {
        "Modified": "2024-03-20T17:18:00",
        "Published": "2024-03-20T17:15:00",
        "access": {},
        "assigner": "chrome-cve-admin@google.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-2625",
        "impact": {},
        "last-modified": "2024-03-20T17:18:00",
        "references": [
            "https://chromereleases.googleblog.com/2024/03/stable-channel-update-for-desktop_19.html",
            "https://issues.chromium.org/issues/327740539"
        ],
        "summary": "Object lifecycle issue in V8 in Google Chrome prior to 123.0.6312.58 allowed a remote attacker to potentially exploit object corruption via a crafted HTML page. (Chromium security severity: High)"
    },
    {
        "Modified": "2024-03-20T17:18:00",
        "Published": "2024-03-20T17:15:00",
        "access": {},
        "assigner": "chrome-cve-admin@google.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-2626",
        "impact": {},
        "last-modified": "2024-03-20T17:18:00",
        "references": [
            "https://chromereleases.googleblog.com/2024/03/stable-channel-update-for-desktop_19.html",
            "https://issues.chromium.org/issues/40945098"
        ],
        "summary": "Out of bounds read in Swiftshader in Google Chrome prior to 123.0.6312.58 allowed a remote attacker to perform out of bounds memory access via a crafted HTML page. (Chromium security severity: Medium)"
    },
    {
        "Modified": "2024-03-20T17:18:00",
        "Published": "2024-03-20T17:15:00",
        "access": {},
        "assigner": "chrome-cve-admin@google.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-2627",
        "impact": {},
        "last-modified": "2024-03-20T17:18:00",
        "references": [
            "https://chromereleases.googleblog.com/2024/03/stable-channel-update-for-desktop_19.html",
            "https://issues.chromium.org/issues/41493290"
        ],
        "summary": "Use after free in Canvas in Google Chrome prior to 123.0.6312.58 allowed a remote attacker to potentially exploit heap corruption via a crafted HTML page. (Chromium security severity: Medium)"
    },
    {
        "Modified": "2024-03-20T17:18:00",
        "Published": "2024-03-20T17:15:00",
        "access": {},
        "assigner": "chrome-cve-admin@google.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-2628",
        "impact": {},
        "last-modified": "2024-03-20T17:18:00",
        "references": [
            "https://chromereleases.googleblog.com/2024/03/stable-channel-update-for-desktop_19.html",
            "https://issues.chromium.org/issues/41487774"
        ],
        "summary": "Inappropriate implementation in Downloads in Google Chrome prior to 123.0.6312.58 allowed a remote attacker to perform UI spoofing via a crafted URL. (Chromium security severity: Medium)"
    },
    {
        "Modified": "2024-03-20T17:18:00",
        "Published": "2024-03-20T17:15:00",
        "access": {},
        "assigner": "chrome-cve-admin@google.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-2629",
        "impact": {},
        "last-modified": "2024-03-20T17:18:00",
        "references": [
            "https://chromereleases.googleblog.com/2024/03/stable-channel-update-for-desktop_19.html",
            "https://issues.chromium.org/issues/41487721"
        ],
        "summary": "Incorrect security UI in iOS in Google Chrome prior to 123.0.6312.58 allowed a remote attacker to perform UI spoofing via a crafted HTML page. (Chromium security severity: Medium)"
    },
    {
        "Modified": "2024-03-20T17:18:00",
        "Published": "2024-03-20T17:15:00",
        "access": {},
        "assigner": "chrome-cve-admin@google.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-2630",
        "impact": {},
        "last-modified": "2024-03-20T17:18:00",
        "references": [
            "https://chromereleases.googleblog.com/2024/03/stable-channel-update-for-desktop_19.html",
            "https://issues.chromium.org/issues/41481877"
        ],
        "summary": "Inappropriate implementation in iOS in Google Chrome prior to 123.0.6312.58 allowed a remote attacker to leak cross-origin data via a crafted HTML page. (Chromium security severity: Medium)"
    },
    {
        "Modified": "2024-03-20T17:18:00",
        "Published": "2024-03-20T17:15:00",
        "access": {},
        "assigner": "chrome-cve-admin@google.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-2631",
        "impact": {},
        "last-modified": "2024-03-20T17:18:00",
        "references": [
            "https://chromereleases.googleblog.com/2024/03/stable-channel-update-for-desktop_19.html",
            "https://issues.chromium.org/issues/41495878"
        ],
        "summary": "Inappropriate implementation in iOS in Google Chrome prior to 123.0.6312.58 allowed a remote attacker to perform UI spoofing via a crafted HTML page. (Chromium security severity: Low)"
    },
    {
        "Modified": "2024-03-20T17:18:00",
        "Published": "2024-03-20T17:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-121",
        "id": "CVE-2024-2705",
        "impact": {},
        "last-modified": "2024-03-20T17:18:00",
        "references": [
            "https://vuldb.com/?id.257456",
            "https://vuldb.com/?ctiid.257456",
            "https://github.com/abcdefg-png/IoT-vulnerable/blob/main/Tenda/AC10U/v1.V15.03.06.49/more/formSetQosBand.md"
        ],
        "summary": "A vulnerability, which was classified as critical, has been found in Tenda AC10U 1.0/15.03.06.49. Affected by this issue is the function formSetQosBand of the file /goform/SetNetControlList. The manipulation of the argument list leads to stack-based buffer overflow. The attack may be launched remotely. The exploit has been disclosed to the public and may be used. The identifier of this vulnerability is VDB-257456. NOTE: The vendor was contacted early about this disclosure but did not respond in any way."
    },
    {
        "Modified": "2024-03-20T17:18:00",
        "Published": "2024-03-20T17:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-121",
        "id": "CVE-2024-2706",
        "impact": {},
        "last-modified": "2024-03-20T17:18:00",
        "references": [
            "https://vuldb.com/?id.257457",
            "https://vuldb.com/?ctiid.257457",
            "https://github.com/abcdefg-png/IoT-vulnerable/blob/main/Tenda/AC10U/v1.V15.03.06.49/more/formWifiWpsStart.md"
        ],
        "summary": "A vulnerability, which was classified as critical, was found in Tenda AC10U 15.03.06.49. This affects the function formWifiWpsStart of the file /goform/WifiWpsStart. The manipulation of the argument index leads to stack-based buffer overflow. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used. The identifier VDB-257457 was assigned to this vulnerability. NOTE: The vendor was contacted early about this disclosure but did not respond in any way."
    },
    {
        "Modified": "2024-03-20T17:18:00",
        "Published": "2024-03-20T17:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-78",
        "id": "CVE-2024-2707",
        "impact": {},
        "last-modified": "2024-03-20T17:18:00",
        "references": [
            "https://vuldb.com/?id.257458",
            "https://vuldb.com/?ctiid.257458",
            "https://github.com/abcdefg-png/IoT-vulnerable/blob/main/Tenda/AC10U/v1.V15.03.06.49/more/formWriteFacMac.md"
        ],
        "summary": "A vulnerability has been found in Tenda AC10U 15.03.06.49 and classified as critical. This vulnerability affects the function formWriteFacMac of the file /goform/WriteFacMac. The manipulation of the argument mac leads to os command injection. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used. VDB-257458 is the identifier assigned to this vulnerability. NOTE: The vendor was contacted early about this disclosure but did not respond in any way."
    },
    {
        "Modified": "2024-03-20T17:18:00",
        "Published": "2024-03-20T14:15:00",
        "access": {},
        "assigner": "psirt@us.ibm.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-35888",
        "impact": {},
        "last-modified": "2024-03-20T17:18:00",
        "references": [
            "https://www.ibm.com/support/pages/node/7144228",
            "https://exchange.xforce.ibmcloud.com/vulnerabilities/258375"
        ],
        "summary": "IBM Security Verify Governance 10.0.2 could allow a remote attacker to obtain sensitive information, caused by the failure to properly enable HTTP Strict Transport Security. An attacker could exploit this vulnerability to obtain sensitive information using man in the middle techniques.  IBM X-Force ID:  258375."
    },
    {
        "Modified": "2024-03-20T17:18:00",
        "Published": "2024-03-20T14:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-28392",
        "impact": {},
        "last-modified": "2024-03-20T17:18:00",
        "references": [
            "https://addons.prestashop.com/en/remarketing-shopping-cart-abandonment/16535-abandoned-cart-reminder-pro.html",
            "https://security.friendsofpresta.org/modules/2024/03/14/pscartabandonmentpro.html"
        ],
        "summary": "SQL injection vulnerability in pscartabandonmentpro v.2.0.11 and before allows a remote attacker to escalate privileges via the pscartabandonmentproFrontCAPUnsubscribeJobModuleFrontController::setEmailVisualized() method."
    },
    {
        "Modified": "2024-03-20T17:18:00",
        "Published": "2024-03-20T14:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-28395",
        "impact": {},
        "last-modified": "2024-03-20T17:18:00",
        "references": [
            "https://addons.prestashop.com/en/pop-up/20208-pop-up-schedule-popup-splash-window.html",
            "https://security.friendsofpresta.org/modules/2024/03/14/bestkit_popup.html"
        ],
        "summary": "SQL injection vulnerability in Best-Kit bestkit_popup v.1.7.2 and before allows a remote attacker to escalate privileges via the bestkit_popup.php component."
    },
    {
        "Modified": "2024-03-20T17:18:00",
        "Published": "2024-03-20T14:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-28396",
        "impact": {},
        "last-modified": "2024-03-20T17:18:00",
        "references": [
            "https://addons.prestashop.com/en/data-import-export/17596-orders-csv-excel-export-pro.html",
            "https://security.friendsofpresta.org/modules/2024/03/14/ordersexport.html"
        ],
        "summary": "An issue in MyPrestaModules ordersexport v.6.0.2 and before allows a remote attacker to execute arbitrary code via the download.php component."
    },
    {
        "Modified": "2024-03-20T17:18:00",
        "Published": "2024-03-20T15:15:00",
        "access": {},
        "assigner": "security-advisories@github.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-41038",
        "impact": {},
        "last-modified": "2024-03-20T17:18:00",
        "references": [
            "https://github.com/FirebirdSQL/firebird/security/advisories/GHSA-6fv8-8rwr-9692",
            "https://firebirdsql.org/en/snapshot-builds"
        ],
        "summary": "Firebird is a relational database. Versions 4.0.0 through 4.0.3 and version 5.0 beta1 are vulnerable to a server crash when a user uses a specific form of SET BIND statement. Any non-privileged user with minimum access to a server may type a statement with a long `CHAR` length, which causes the server to crash due to stack corruption. Versions 4.0.4.2981 and 5.0.0.117 contain fixes for this issue. No known workarounds are available."
    },
    {
        "Modified": "2024-03-20T17:18:00",
        "Published": "2024-03-20T15:15:00",
        "access": {},
        "assigner": "security-advisories@github.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-41877",
        "impact": {},
        "last-modified": "2024-03-20T17:18:00",
        "references": [
            "https://github.com/geoserver/geoserver/security/advisories/GHSA-8g7v-vjrc-x4g5",
            "https://docs.geoserver.org/latest/en/user/configuration/globalsettings.html#log-location"
        ],
        "summary": "GeoServer is an open source software server written in Java that allows users to share and edit geospatial data. A path traversal vulnerability in versions 2.23.4 and prior requires GeoServer Administrator with access to the admin console to misconfigure the Global Settings for log file location to an arbitrary location. The admin console GeoServer Logs page provides a preview of these contents. As this issue requires GeoServer administrators access, often representing a trusted party, the vulnerability has not received a patch as of time of publication. As a workaround, a system administrator responsible for running GeoServer can use the `GEOSERVER_LOG_FILE` setting to override any configuration option provided by the Global Settings page. The `GEOSERVER_LOG_LOCATION` parameter can be set as system property, environment variables, or servlet context parameters."
    },
    {
        "Modified": "2024-03-20T17:18:00",
        "Published": "2024-03-20T15:15:00",
        "access": {},
        "assigner": "security-advisories@github.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-51444",
        "impact": {},
        "last-modified": "2024-03-20T17:18:00",
        "references": [
            "https://github.com/geoserver/geoserver/security/advisories/GHSA-9v5q-2gwq-q9hq",
            "https://github.com/geoserver/geoserver/pull/7222",
            "https://github.com/geoserver/geoserver/commit/ca683170c669718cb6ad4c79e01b0451065e13b8",
            "https://github.com/geoserver/geoserver/commit/fe235b3bb1d7f05751a4a2ef5390c36f5c9e78ae",
            "https://osgeo-org.atlassian.net/browse/GEOS-11176"
        ],
        "summary": "GeoServer is an open source software server written in Java that allows users to share and edit geospatial data. An arbitrary file upload vulnerability exists in versions prior to 2.23.4 and 2.24.1 that enables an authenticated administrator with permissions to modify coverage stores through the REST Coverage Store API to upload arbitrary file contents to arbitrary file locations which can lead to remote code execution. Coverage stores that are configured using relative paths use a GeoServer Resource implementation that has validation to prevent path traversal but coverage stores that are configured using absolute paths use a different Resource implementation that does not prevent path traversal. This vulnerability can lead to executing arbitrary code. An administrator with limited privileges could also potentially exploit this to overwrite GeoServer security files and obtain full administrator privileges. Versions 2.23.4 and 2.24.1 contain a fix for this issue."
    },
    {
        "Modified": "2024-03-20T17:18:00",
        "Published": "2024-03-20T15:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-28735",
        "impact": {},
        "last-modified": "2024-03-20T17:18:00",
        "references": [
            "http://financials.com",
            "http://unit4.com",
            "https://packetstormsecurity.com/files/177620/Financials-By-Coda-Authorization-Bypass.html"
        ],
        "summary": "An incorrect access control issue in Unit4 Financials by Coda v.2023Q4 allows a remote attacker to escalate privileges via a crafted script to the change password function."
    },
    {
        "Modified": "2024-03-20T17:18:00",
        "Published": "2024-03-20T15:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-29419",
        "impact": {},
        "last-modified": "2024-03-20T17:18:00",
        "references": [
            "https://www.totolink.net/home/menu/detail/menu_listtpl/products/id/242/ids/33.html",
            "https://github.com/4hsien/CVE-vulns/blob/main/TOTOLINK/X2000R/XSS_6_Wireless_settings/XSS.md"
        ],
        "summary": "There is a Cross-site scripting (XSS) vulnerability in the Wireless settings under the Easy Setup Page of TOTOLINK X2000R before v1.0.0-B20231213.1013."
    },
    {
        "Modified": "2024-03-20T17:18:00",
        "Published": "2024-03-20T15:15:00",
        "access": {},
        "assigner": "security@progress.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-2291",
        "impact": {},
        "last-modified": "2024-03-20T17:18:00",
        "references": [
            "https://www.progress.com/moveit",
            "https://community.progress.com/s/article/MOVEit-Transfer-Service-Pack-March-2024"
        ],
        "summary": "\nIn Progress MOVEit Transfer versions released before 2022.0.11 (14.0.11), 2022.1.12 (14.1.12), 2023.0.9 (15.0.9), 2023.1.4 (15.1.4), a logging bypass vulnerability has been discovered.  An authenticated user could manipulate a request to bypass the logging mechanism within the web application which results in user activity not being logged properly."
    },
    {
        "Modified": "2024-03-20T17:18:00",
        "Published": "2024-03-20T13:15:00",
        "access": {},
        "assigner": "security@progress.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-1800",
        "impact": {},
        "last-modified": "2024-03-20T17:18:00",
        "references": [
            "https://www.telerik.com/report-server",
            "https://docs.telerik.com/report-server/knowledge-base/deserialization-vulnerability-cve-2024-1800"
        ],
        "summary": "\nIn Progress® Telerik® Report Server versions prior to 2024 Q1 (10.0.24.130), a remote code execution attack is possible through an insecure deserialization vulnerability."
    },
    {
        "Modified": "2024-03-20T17:18:00",
        "Published": "2024-03-20T13:15:00",
        "access": {},
        "assigner": "security@progress.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-1801",
        "impact": {},
        "last-modified": "2024-03-20T17:18:00",
        "references": [
            "https://www.telerik.com/products/reporting.aspx",
            "https://docs.telerik.com/reporting/knowledge-base/deserialization-vulnerability-cve-2024-1801-cve-2024-1856"
        ],
        "summary": "\nIn Progress® Telerik® Reporting versions prior to 2024 Q1 (18.0.24.130), a code execution attack is possible by a local threat actor through an insecure deserialization vulnerability."
    },
    {
        "Modified": "2024-03-20T17:18:00",
        "Published": "2024-03-20T13:15:00",
        "access": {},
        "assigner": "security@opentext.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-1811",
        "impact": {},
        "last-modified": "2024-03-20T17:18:00",
        "references": [
            "https://portal.microfocus.com/s/article/KM000027383"
        ],
        "summary": "A potential vulnerability has been identified in OpenText ArcSight Platform. The vulnerability could be remotely exploited."
    },
    {
        "Modified": "2024-03-20T17:18:00",
        "Published": "2024-03-20T13:15:00",
        "access": {},
        "assigner": "security@progress.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-1856",
        "impact": {},
        "last-modified": "2024-03-20T17:18:00",
        "references": [
            "https://www.telerik.com/products/reporting.aspx",
            "https://docs.telerik.com/reporting/knowledge-base/deserialization-vulnerability-cve-2024-1801-cve-2024-1856"
        ],
        "summary": "\nIn Progress® Telerik® Reporting versions prior to 2024 Q1 (18.0.24.130), a code execution attack is possible by a remote threat actor through an insecure deserialization vulnerability."
    },
    {
        "Modified": "2024-03-20T17:15:00",
        "Published": "2024-03-20T17:15:00",
        "access": {},
        "assigner": "cve-request@wordfence.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-1992",
        "impact": {},
        "last-modified": "2024-03-20T17:15:00",
        "references": [],
        "summary": "Rejected reason: Rejected as duplicate of CVE-2024-2306"
    },
    {
        "Modified": "2024-03-20T17:15:00",
        "Published": "2024-03-06T07:15:00",
        "access": {},
        "assigner": "cve@kernel.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-26628",
        "impact": {},
        "last-modified": "2024-03-20T17:15:00",
        "references": [],
        "summary": "Rejected reason: This CVE ID has been rejected or withdrawn by its CVE Numbering Authority."
    },
    {
        "Modified": "2024-03-20T16:15:00",
        "Published": "2024-03-11T13:15:00",
        "access": {},
        "assigner": "cve-coordination@incibe.es",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-2370",
        "impact": {},
        "last-modified": "2024-03-20T16:15:00",
        "references": [],
        "summary": "Rejected reason: DO NOT USE THIS CVE ID NUMBER. Consult IDs: CVE-2018-5341. Reason: This CVE Record is a duplicate of CVE-2018-5341. Notes: All CVE users should reference CVE-2018-5341 instead of this record."
    },
    {
        "Modified": "2024-03-20T13:15:00",
        "Published": "2024-03-07T14:15:00",
        "access": {},
        "assigner": "audit@patchstack.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-47691",
        "impact": {},
        "last-modified": "2024-03-20T13:15:00",
        "references": [],
        "summary": "Rejected reason: This CVE ID has been rejected or withdrawn by its CVE Numbering Authority."
    },
    {
        "Modified": "2024-03-20T13:00:00",
        "Published": "2024-03-20T12:15:00",
        "access": {},
        "assigner": "audit@patchstack.com",
        "cvss": null,
        "cwe": "CWE-862",
        "id": "CVE-2023-52229",
        "impact": {},
        "last-modified": "2024-03-20T13:00:00",
        "references": [
            "https://patchstack.com/database/vulnerability/word-replacer-ultra/wordpress-word-replacer-pro-plugin-1-0-broken-access-control-vulnerability?_s_id=cve"
        ],
        "summary": "Missing Authorization vulnerability in Save as PDF plugin by Pdfcrowd Word Replacer Pro.This issue affects Word Replacer Pro: from n/a through 1.0.\n\n"
    },
    {
        "Modified": "2024-03-20T13:00:00",
        "Published": "2024-03-20T12:15:00",
        "access": {},
        "assigner": "audit@patchstack.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-2721",
        "impact": {},
        "last-modified": "2024-03-20T13:00:00",
        "references": [
            "https://patchstack.com/database/vulnerability/social-media-builder/wordpress-social-media-share-buttons-plugin-2-1-0-php-object-injection-vulnerability?_s_id=cve"
        ],
        "summary": "Deserialization of Untrusted Data vulnerability in Social Media Share Buttons By Sygnoos Social Media Share Buttons.This issue affects Social Media Share Buttons: from n/a through 2.1.0.\n\n"
    },
    {
        "Modified": "2024-03-20T13:00:00",
        "Published": "2024-03-20T10:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-79",
        "id": "CVE-2024-2684",
        "impact": {},
        "last-modified": "2024-03-20T13:00:00",
        "references": [
            "https://vuldb.com/?id.257384",
            "https://vuldb.com/?ctiid.257384",
            "https://github.com/E1CHO/cve_hub/blob/main/Online%20Job%20Finder%20System/Online%20Job%20Finder%20System%20-%20vuln%209.pdf"
        ],
        "summary": "A vulnerability, which was classified as problematic, has been found in Campcodes Online Job Finder System 1.0. Affected by this issue is some unknown functionality of the file /admin/category/index.php. The manipulation of the argument view leads to cross site scripting. The attack may be launched remotely. The exploit has been disclosed to the public and may be used. The identifier of this vulnerability is VDB-257384."
    },
    {
        "Modified": "2024-03-20T13:00:00",
        "Published": "2024-03-20T10:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-79",
        "id": "CVE-2024-2685",
        "impact": {},
        "last-modified": "2024-03-20T13:00:00",
        "references": [
            "https://vuldb.com/?id.257385",
            "https://vuldb.com/?ctiid.257385",
            "https://github.com/E1CHO/cve_hub/blob/main/Online%20Job%20Finder%20System/Online%20Job%20Finder%20System%20-%20vuln%2020.pdf"
        ],
        "summary": "A vulnerability, which was classified as problematic, was found in Campcodes Online Job Finder System 1.0. This affects an unknown part of the file /admin/applicants/index.php. The manipulation of the argument view leads to cross site scripting. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used. The identifier VDB-257385 was assigned to this vulnerability."
    },
    {
        "Modified": "2024-03-20T13:00:00",
        "Published": "2024-03-20T10:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-79",
        "id": "CVE-2024-2686",
        "impact": {},
        "last-modified": "2024-03-20T13:00:00",
        "references": [
            "https://vuldb.com/?id.257386",
            "https://vuldb.com/?ctiid.257386",
            "https://github.com/E1CHO/cve_hub/blob/main/Online%20Job%20Finder%20System/Online%20Job%20Finder%20System%20-%20vuln%2021.pdf"
        ],
        "summary": "A vulnerability has been found in Campcodes Online Job Finder System 1.0 and classified as problematic. This vulnerability affects unknown code of the file /admin/applicants/controller.php. The manipulation of the argument JOBREGID leads to cross site scripting. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used. VDB-257386 is the identifier assigned to this vulnerability."
    },
    {
        "Modified": "2024-03-20T13:00:00",
        "Published": "2024-03-20T10:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-89",
        "id": "CVE-2024-2687",
        "impact": {},
        "last-modified": "2024-03-20T13:00:00",
        "references": [
            "https://vuldb.com/?id.257387",
            "https://vuldb.com/?ctiid.257387",
            "https://github.com/E1CHO/cve_hub/blob/main/Online%20Job%20Finder%20System/Online%20Job%20Finder%20System%20-%20vuln%2011.pdf"
        ],
        "summary": "A vulnerability was found in Campcodes Online Job Finder System 1.0 and classified as critical. This issue affects some unknown processing of the file /admin/applicants/index.php. The manipulation of the argument id leads to sql injection. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. The associated identifier of this vulnerability is VDB-257387."
    },
    {
        "Modified": "2024-03-20T13:00:00",
        "Published": "2024-03-20T10:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-434",
        "id": "CVE-2024-2690",
        "impact": {},
        "last-modified": "2024-03-20T13:00:00",
        "references": [
            "https://vuldb.com/?id.257388",
            "https://vuldb.com/?ctiid.257388",
            "https://github.com/wkeyi0x1/vul-report/issues/2"
        ],
        "summary": "A vulnerability was found in SourceCodester Online Discussion Forum Site 1.0. It has been classified as critical. Affected is an unknown function of the file /uupdate.php. The manipulation of the argument ima leads to unrestricted upload. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used. The identifier of this vulnerability is VDB-257388."
    },
    {
        "Modified": "2024-03-20T13:00:00",
        "Published": "2024-03-20T10:15:00",
        "access": {},
        "assigner": "audit@patchstack.com",
        "cvss": null,
        "cwe": "CWE-862",
        "id": "CVE-2024-2702",
        "impact": {},
        "last-modified": "2024-03-20T13:00:00",
        "references": [
            "https://patchstack.com/database/vulnerability/olive-one-click-demo-import/wordpress-olive-one-click-demo-import-plugin-1-1-1-broken-access-control-vulnerability?_s_id=cve"
        ],
        "summary": "Missing Authorization vulnerability in Olive Themes Olive One Click Demo Import allows importing settings and data, ultimately leading to XSS.This issue affects Olive One Click Demo Import: from n/a through 1.1.1.\n\n"
    },
    {
        "Modified": "2024-03-20T13:00:00",
        "Published": "2024-03-20T10:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-79",
        "id": "CVE-2024-2683",
        "impact": {},
        "last-modified": "2024-03-20T13:00:00",
        "references": [
            "https://vuldb.com/?id.257383",
            "https://vuldb.com/?ctiid.257383",
            "https://github.com/E1CHO/cve_hub/blob/main/Online%20Job%20Finder%20System/Online%20Job%20Finder%20System%20-%20vuln%2018.pdf"
        ],
        "summary": "A vulnerability classified as problematic was found in Campcodes Online Job Finder System 1.0. Affected by this vulnerability is an unknown functionality of the file /admin/company/index.php. The manipulation of the argument view leads to cross site scripting. The attack can be launched remotely. The exploit has been disclosed to the public and may be used. The associated identifier of this vulnerability is VDB-257383."
    },
    {
        "Modified": "2024-03-20T13:00:00",
        "Published": "2024-03-20T11:15:00",
        "access": {},
        "assigner": "security@xen.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-46839",
        "impact": {},
        "last-modified": "2024-03-20T13:00:00",
        "references": [
            "https://xenbits.xenproject.org/xsa/advisory-449.html"
        ],
        "summary": "PCI devices can make use of a functionality called phantom functions,\nthat when enabled allows the device to generate requests using the IDs\nof functions that are otherwise unpopulated.  This allows a device to\nextend the number of outstanding requests.\n\nSuch phantom functions need an IOMMU context setup, but failure to\nsetup the context is not fatal when the device is assigned.  Not\nfailing device assignment when such failure happens can lead to the\nprimary device being assigned to a guest, while some of the phantom\nfunctions are assigned to a different domain.\n"
    },
    {
        "Modified": "2024-03-20T13:00:00",
        "Published": "2024-03-20T11:15:00",
        "access": {},
        "assigner": "security@xen.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-46840",
        "impact": {},
        "last-modified": "2024-03-20T13:00:00",
        "references": [
            "https://xenbits.xenproject.org/xsa/advisory-450.html"
        ],
        "summary": "Incorrect placement of a preprocessor directive in source code results\nin logic that doesn't operate as intended when support for HVM guests is\ncompiled out of Xen.\n"
    },
    {
        "Modified": "2024-03-20T13:00:00",
        "Published": "2024-03-20T11:15:00",
        "access": {},
        "assigner": "security@xen.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-46841",
        "impact": {},
        "last-modified": "2024-03-20T13:00:00",
        "references": [
            "https://xenbits.xenproject.org/xsa/advisory-451.html"
        ],
        "summary": "Recent x86 CPUs offer functionality named Control-flow Enforcement\nTechnology (CET).  A sub-feature of this are Shadow Stacks (CET-SS).\nCET-SS is a hardware feature designed to protect against Return Oriented\nProgramming attacks. When enabled, traditional stacks holding both data\nand return addresses are accompanied by so called \"shadow stacks\",\nholding little more than return addresses.  Shadow stacks aren't\nwritable by normal instructions, and upon function returns their\ncontents are used to check for possible manipulation of a return address\ncoming from the traditional stack.\n\nIn particular certain memory accesses need intercepting by Xen.  In\nvarious cases the necessary emulation involves kind of replaying of\nthe instruction.  Such replaying typically involves filling and then\ninvoking of a stub.  Such a replayed instruction may raise an\nexceptions, which is expected and dealt with accordingly.\n\nUnfortunately the interaction of both of the above wasn't right:\nRecovery involves removal of a call frame from the (traditional) stack.\nThe counterpart of this operation for the shadow stack was missing.\n"
    },
    {
        "Modified": "2024-03-20T13:00:00",
        "Published": "2024-03-20T05:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-22080",
        "impact": {},
        "last-modified": "2024-03-20T13:00:00",
        "references": [
            "https://www.elspec-ltd.com/support/security-advisories/"
        ],
        "summary": "An issue was discovered in Elspec G5 digital fault recorder versions 1.1.4.15 and before. Unauthenticated memory corruption can occur during XML body parsing."
    },
    {
        "Modified": "2024-03-20T13:00:00",
        "Published": "2024-03-20T06:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-28566",
        "impact": {},
        "last-modified": "2024-03-20T13:00:00",
        "references": [
            "https://github.com/Ruanxingzhi/vul-report/tree/master/freeimage-r1909"
        ],
        "summary": "Buffer Overflow vulnerability in open source FreeImage v.3.19.0 [r1909] allows a local attacker to execute arbitrary code via the AssignPixel() function when reading images in TIFF format."
    },
    {
        "Modified": "2024-03-20T13:00:00",
        "Published": "2024-03-20T06:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-28573",
        "impact": {},
        "last-modified": "2024-03-20T13:00:00",
        "references": [
            "https://github.com/Ruanxingzhi/vul-report/tree/master/freeimage-r1909"
        ],
        "summary": "Buffer Overflow vulnerability in open source FreeImage v.3.19.0 [r1909] allows a local attacker to cause a denial of service (DoS) via the jpeg_read_exif_profile() function when reading images in JPEG format."
    },
    {
        "Modified": "2024-03-20T13:00:00",
        "Published": "2024-03-20T06:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-28575",
        "impact": {},
        "last-modified": "2024-03-20T13:00:00",
        "references": [
            "https://github.com/Ruanxingzhi/vul-report/tree/master/freeimage-r1909"
        ],
        "summary": "Buffer Overflow vulnerability in open source FreeImage v.3.19.0 [r1909] allows a local attacker to cause a denial of service (DoS) via the opj_j2k_read_mct() function when reading images in J2K format."
    },
    {
        "Modified": "2024-03-20T13:00:00",
        "Published": "2024-03-20T06:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-28577",
        "impact": {},
        "last-modified": "2024-03-20T13:00:00",
        "references": [
            "https://github.com/Ruanxingzhi/vul-report/tree/master/freeimage-r1909"
        ],
        "summary": "Null Pointer Dereference vulnerability in open source FreeImage v.3.19.0 [r1909] allows a local attacker to cause a denial of service (DoS) via the jpeg_read_exif_profile_raw() function when reading images in JPEG format."
    },
    {
        "Modified": "2024-03-20T13:00:00",
        "Published": "2024-03-20T06:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-28580",
        "impact": {},
        "last-modified": "2024-03-20T13:00:00",
        "references": [
            "https://github.com/Ruanxingzhi/vul-report/tree/master/freeimage-r1909"
        ],
        "summary": "Buffer Overflow vulnerability in open source FreeImage v.3.19.0 [r1909] allows a local attacker to execute arbitrary code via the ReadData() function when reading images in RAS format."
    },
    {
        "Modified": "2024-03-20T13:00:00",
        "Published": "2024-03-20T06:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-28582",
        "impact": {},
        "last-modified": "2024-03-20T13:00:00",
        "references": [
            "https://github.com/Ruanxingzhi/vul-report/tree/master/freeimage-r1909"
        ],
        "summary": "Buffer Overflow vulnerability in open source FreeImage v.3.19.0 [r1909] allows a local attacker to execute arbitrary code via the rgbe_RGBEToFloat() function when reading images in HDR format."
    },
    {
        "Modified": "2024-03-20T13:00:00",
        "Published": "2024-03-20T06:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-28583",
        "impact": {},
        "last-modified": "2024-03-20T13:00:00",
        "references": [
            "https://github.com/Ruanxingzhi/vul-report/tree/master/freeimage-r1909"
        ],
        "summary": "Buffer Overflow vulnerability in open source FreeImage v.3.19.0 [r1909] allows a local attacker to execute arbitrary code via the readLine() function when reading images in XPM format."
    },
    {
        "Modified": "2024-03-20T13:00:00",
        "Published": "2024-03-20T06:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-89",
        "id": "CVE-2024-2675",
        "impact": {},
        "last-modified": "2024-03-20T13:00:00",
        "references": [
            "https://vuldb.com/?id.257375",
            "https://vuldb.com/?ctiid.257375",
            "https://github.com/E1CHO/cve_hub/blob/main/Online%20Job%20Finder%20System/Online%20Job%20Finder%20System%20-%20vuln%208.pdf"
        ],
        "summary": "A vulnerability, which was classified as critical, has been found in Campcodes Online Job Finder System 1.0. This issue affects some unknown processing of the file /admin/company/index.php. The manipulation of the argument id leads to sql injection. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. The associated identifier of this vulnerability is VDB-257375."
    },
    {
        "Modified": "2024-03-20T13:00:00",
        "Published": "2024-03-20T07:15:00",
        "access": {},
        "assigner": "cve-request@wordfence.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-1711",
        "impact": {},
        "last-modified": "2024-03-20T13:00:00",
        "references": [
            "https://www.wordfence.com/threat-intel/vulnerabilities/id/fcc78fa6-a5f0-4f29-ae19-8e783698b19e?source=cve",
            "https://wordpress.org/plugins/mediavine-create/"
        ],
        "summary": "The Create by Mediavine plugin for WordPress is vulnerable to SQL Injection via the 'id' parameter in all versions up to, and including, 1.9.4 due to insufficient escaping on the user supplied parameter and lack of sufficient preparation on the existing SQL query.  This makes it possible for unauthenticated attackers to append additional SQL queries into already existing queries that can be used to extract sensitive information from the database."
    },
    {
        "Modified": "2024-03-20T13:00:00",
        "Published": "2024-03-20T07:15:00",
        "access": {},
        "assigner": "cve-request@wordfence.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-1844",
        "impact": {},
        "last-modified": "2024-03-20T13:00:00",
        "references": [
            "https://www.wordfence.com/threat-intel/vulnerabilities/id/63ecb518-50d6-49ad-92e4-c5a7494ced82?source=cve",
            "https://plugins.trac.wordpress.org/browser/wp-auto-republish/trunk/includes/Tools/Database.php#L161",
            "https://plugins.trac.wordpress.org/browser/wp-auto-republish/trunk/includes/Tools/Database.php#L148"
        ],
        "summary": "The RevivePress – Keep your Old Content Evergreen plugin for WordPress is vulnerable to unauthorized access and modification of data due to a missing capability check on the import_data and copy_data functions in all versions up to, and including, 1.5.6. This makes it possible for authenticated attackers, with subscriber-level access or higher, to overwrite plugin settings and view them."
    },
    {
        "Modified": "2024-03-20T13:00:00",
        "Published": "2024-03-20T07:15:00",
        "access": {},
        "assigner": "cve-request@wordfence.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-2129",
        "impact": {},
        "last-modified": "2024-03-20T13:00:00",
        "references": [
            "https://www.wordfence.com/threat-intel/vulnerabilities/id/05cd8f96-533a-4036-a01f-6ba1ad2d2b5e?source=cve",
            "https://wordpress.org/plugins/wpbits-addons-for-elementor/"
        ],
        "summary": "The WPBITS Addons For Elementor Page Builder plugin for WordPress is vulnerable to Stored Cross-Site Scripting via the plugin's heading widget in all versions up to, and including, 1.3.4.2 due to insufficient input sanitization and output escaping on user supplied attributes. This makes it possible for authenticated attackers with contributor-level and above permissions to inject arbitrary web scripts in pages that will execute whenever a user accesses an injected page."
    },
    {
        "Modified": "2024-03-20T13:00:00",
        "Published": "2024-03-20T07:15:00",
        "access": {},
        "assigner": "cve-request@wordfence.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-2304",
        "impact": {},
        "last-modified": "2024-03-20T13:00:00",
        "references": [
            "https://www.wordfence.com/threat-intel/vulnerabilities/id/6f589b5d-9cdb-4521-bc60-c8f19d0ef982?source=cve",
            "https://wordpress.org/plugins/animated-headline/"
        ],
        "summary": "The Animated Headline plugin for WordPress is vulnerable to Stored Cross-Site Scripting via the plugin's 'animated-headline' shortcode in all versions up to, and including, 4.0 due to insufficient input sanitization and output escaping on user supplied attributes. This makes it possible for authenticated attackers with contributor-level and above permissions to inject arbitrary web scripts in pages that will execute whenever a user accesses an injected page."
    },
    {
        "Modified": "2024-03-20T13:00:00",
        "Published": "2024-03-20T07:15:00",
        "access": {},
        "assigner": "cve-request@wordfence.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-2459",
        "impact": {},
        "last-modified": "2024-03-20T13:00:00",
        "references": [
            "https://www.wordfence.com/threat-intel/vulnerabilities/id/1d93db2c-7baf-42d8-9b4a-be91b27221a7?source=cve",
            "https://wordpress.org/plugins/ux-flat/"
        ],
        "summary": "The UX Flat plugin for WordPress is vulnerable to Stored Cross-Site Scripting via the plugin's 'button' shortcode in all versions up to, and including, 4.1 due to insufficient input sanitization and output escaping on user supplied attributes. This makes it possible for authenticated attackers with contributor-level and above permissions to inject arbitrary web scripts in pages that will execute whenever a user accesses an injected page."
    },
    {
        "Modified": "2024-03-20T13:00:00",
        "Published": "2024-03-20T07:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-89",
        "id": "CVE-2024-2678",
        "impact": {},
        "last-modified": "2024-03-20T13:00:00",
        "references": [
            "https://vuldb.com/?id.257378",
            "https://vuldb.com/?ctiid.257378",
            "https://github.com/E1CHO/cve_hub/blob/main/Online%20Job%20Finder%20System/Online%20Job%20Finder%20System%20-%20vuln%2013.pdf"
        ],
        "summary": "A vulnerability was found in Campcodes Online Job Finder System 1.0 and classified as critical. Affected by this issue is some unknown functionality of the file /admin/applicants/controller.php. The manipulation of the argument JOBREGID leads to sql injection. The attack may be launched remotely. The exploit has been disclosed to the public and may be used. VDB-257378 is the identifier assigned to this vulnerability."
    },
    {
        "Modified": "2024-03-20T13:00:00",
        "Published": "2024-03-20T07:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-79",
        "id": "CVE-2024-2679",
        "impact": {},
        "last-modified": "2024-03-20T13:00:00",
        "references": [
            "https://vuldb.com/?id.257379",
            "https://vuldb.com/?ctiid.257379",
            "https://github.com/E1CHO/cve_hub/blob/main/Online%20Job%20Finder%20System/Online%20Job%20Finder%20System%20-%20vuln%2014.pdf"
        ],
        "summary": "A vulnerability was found in Campcodes Online Job Finder System 1.0. It has been classified as problematic. This affects an unknown part of the file /admin/vacancy/index.php. The manipulation of the argument view leads to cross site scripting. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used. The associated identifier of this vulnerability is VDB-257379."
    },
    {
        "Modified": "2024-03-20T13:00:00",
        "Published": "2024-03-20T05:15:00",
        "access": {},
        "assigner": "contact@wpscan.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-0856",
        "impact": {},
        "last-modified": "2024-03-20T13:00:00",
        "references": [
            "https://wpscan.com/vulnerability/eb383600-0cff-4f24-8127-1fb118f0565a/"
        ],
        "summary": "The Appointment Booking Calendar WordPress plugin before 1.3.83 does not have CSRF checks in some places, which could allow attackers to make logged in users perform unwanted actions via CSRF attacks such as adding a booking to the calendar without paying."
    },
    {
        "Modified": "2024-03-20T13:00:00",
        "Published": "2024-03-20T08:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-79",
        "id": "CVE-2024-2680",
        "impact": {},
        "last-modified": "2024-03-20T13:00:00",
        "references": [
            "https://vuldb.com/?id.257380",
            "https://vuldb.com/?ctiid.257380",
            "https://github.com/E1CHO/cve_hub/blob/main/Online%20Job%20Finder%20System/Online%20Job%20Finder%20System%20-%20vuln%2015.pdf"
        ],
        "summary": "A vulnerability was found in Campcodes Online Job Finder System 1.0. It has been declared as problematic. This vulnerability affects unknown code of the file /admin/user/index.php. The manipulation of the argument view leads to cross site scripting. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used. The identifier of this vulnerability is VDB-257380."
    },
    {
        "Modified": "2024-03-20T13:00:00",
        "Published": "2024-03-20T05:15:00",
        "access": {},
        "assigner": "contact@wpscan.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-0337",
        "impact": {},
        "last-modified": "2024-03-20T13:00:00",
        "references": [
            "https://wpscan.com/vulnerability/2f17a274-8676-4f4e-989f-436030527890/"
        ],
        "summary": "The Travelpayouts: All Travel Brands in One Place WordPress plugin through 1.1.15 is vulnerable to Open Redirect due to insufficient validation on the travelpayouts_redirect variable. This makes it possible for unauthenticated attackers to redirect users to potentially malicious sites if they can successfully trick them into performing an action."
    },
    {
        "Modified": "2024-03-20T13:00:00",
        "Published": "2024-03-20T08:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-79",
        "id": "CVE-2024-2681",
        "impact": {},
        "last-modified": "2024-03-20T13:00:00",
        "references": [
            "https://vuldb.com/?id.257381",
            "https://vuldb.com/?ctiid.257381",
            "https://github.com/E1CHO/cve_hub/blob/main/Online%20Job%20Finder%20System/Online%20Job%20Finder%20System%20-%20vuln%2016.pdf"
        ],
        "summary": "A vulnerability was found in Campcodes Online Job Finder System 1.0. It has been rated as problematic. This issue affects some unknown processing of the file /admin/employee/index.php. The manipulation of the argument view leads to cross site scripting. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. The identifier VDB-257381 was assigned to this vulnerability."
    },
    {
        "Modified": "2024-03-20T13:00:00",
        "Published": "2024-03-20T05:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-22084",
        "impact": {},
        "last-modified": "2024-03-20T13:00:00",
        "references": [
            "https://www.elspec-ltd.com/support/security-advisories/"
        ],
        "summary": "An issue was discovered in Elspec G5 digital fault recorder versions 1.1.4.15 and before. Cleartext passwords and hashes are exposed through log files."
    },
    {
        "Modified": "2024-03-20T13:00:00",
        "Published": "2024-03-20T08:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-2682",
        "impact": {},
        "last-modified": "2024-03-20T13:00:00",
        "references": [
            "https://vuldb.com/?id.257382",
            "https://vuldb.com/?ctiid.257382",
            "https://github.com/E1CHO/cve_hub/blob/main/Online%20Job%20Finder%20System/Online%20Job%20Finder%20System%20-%20vuln%2017.pdf"
        ],
        "summary": "A vulnerability classified as problematic has been found in Campcodes Online Job Finder System 1.0. Affected is an unknown function of the file /admin/employee/controller.php. The manipulation of the argument EMPLOYEEID leads to cross site scripting. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used. VDB-257382 is the identifier assigned to this vulnerability."
    },
    {
        "Modified": "2024-03-20T13:00:00",
        "Published": "2024-03-20T05:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-22085",
        "impact": {},
        "last-modified": "2024-03-20T13:00:00",
        "references": [
            "https://www.elspec-ltd.com/support/security-advisories/"
        ],
        "summary": "An issue was discovered in Elspec G5 digital fault recorder versions 1.1.4.15 and before. The shadow file is world readable."
    },
    {
        "Modified": "2024-03-20T13:00:00",
        "Published": "2024-03-20T06:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-28562",
        "impact": {},
        "last-modified": "2024-03-20T13:00:00",
        "references": [
            "https://github.com/Ruanxingzhi/vul-report/tree/master/freeimage-r1909"
        ],
        "summary": "Buffer Overflow vulnerability in open source FreeImage v.3.19.0 [r1909] allows a local attacker to execute arbitrary code via the Imf_2_2::copyIntoFrameBuffer() component when reading images in EXR format."
    },
    {
        "Modified": "2024-03-20T13:00:00",
        "Published": "2024-03-20T06:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-28564",
        "impact": {},
        "last-modified": "2024-03-20T13:00:00",
        "references": [
            "https://github.com/Ruanxingzhi/vul-report/tree/master/freeimage-r1909"
        ],
        "summary": "Buffer Overflow vulnerability in open source FreeImage v.3.19.0 [r1909] allows a local attacker to cause a denial of service (DoS) via the Imf_2_2::CharPtrIO::readChars() function when reading images in EXR format."
    },
    {
        "Modified": "2024-03-20T13:00:00",
        "Published": "2024-03-20T06:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-28565",
        "impact": {},
        "last-modified": "2024-03-20T13:00:00",
        "references": [
            "https://github.com/Ruanxingzhi/vul-report/tree/master/freeimage-r1909"
        ],
        "summary": "Buffer Overflow vulnerability in open source FreeImage v.3.19.0 [r1909] allows a local attacker to cause a denial of service (DoS) via the psdParser::ReadImageData() function when reading images in PSD format."
    },
    {
        "Modified": "2024-03-20T13:00:00",
        "Published": "2024-03-20T06:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-28568",
        "impact": {},
        "last-modified": "2024-03-20T13:00:00",
        "references": [
            "https://github.com/Ruanxingzhi/vul-report/tree/master/freeimage-r1909"
        ],
        "summary": "Buffer Overflow vulnerability in open source FreeImage v.3.19.0 [r1909] allows a local attacker to cause a denial of service (DoS) via the read_iptc_profile() function when reading images in TIFF format."
    },
    {
        "Modified": "2024-03-20T13:00:00",
        "Published": "2024-03-20T06:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-28571",
        "impact": {},
        "last-modified": "2024-03-20T13:00:00",
        "references": [
            "https://github.com/Ruanxingzhi/vul-report/tree/master/freeimage-r1909"
        ],
        "summary": "Buffer Overflow vulnerability in open source FreeImage v.3.19.0 [r1909] allows a local attacker to cause a denial of service (DoS) via the fill_input_buffer() function when reading images in JPEG format."
    },
    {
        "Modified": "2024-03-20T13:00:00",
        "Published": "2024-03-20T06:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-28572",
        "impact": {},
        "last-modified": "2024-03-20T13:00:00",
        "references": [
            "https://github.com/Ruanxingzhi/vul-report/tree/master/freeimage-r1909"
        ],
        "summary": "Buffer Overflow vulnerability in open source FreeImage v.3.19.0 [r1909] allows a local attacker to cause a denial of service (DoS) via the FreeImage_SetTagValue() function when reading images in JPEG format."
    },
    {
        "Modified": "2024-03-20T13:00:00",
        "Published": "2024-03-20T06:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-28579",
        "impact": {},
        "last-modified": "2024-03-20T13:00:00",
        "references": [
            "https://github.com/Ruanxingzhi/vul-report/tree/master/freeimage-r1909"
        ],
        "summary": "Buffer Overflow vulnerability in open source FreeImage v.3.19.0 [r1909] allows a local attacker to cause a denial of service (DoS) via the FreeImage_Unload() function when reading images in HDR format."
    },
    {
        "Modified": "2024-03-20T13:00:00",
        "Published": "2024-03-20T06:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-28581",
        "impact": {},
        "last-modified": "2024-03-20T13:00:00",
        "references": [
            "https://github.com/Ruanxingzhi/vul-report/tree/master/freeimage-r1909"
        ],
        "summary": "Buffer Overflow vulnerability in open source FreeImage v.3.19.0 [r1909] allows a local attacker to execute arbitrary code via the _assignPixel<>() function when reading images in TARGA format."
    },
    {
        "Modified": "2024-03-20T13:00:00",
        "Published": "2024-03-20T06:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-89",
        "id": "CVE-2024-2674",
        "impact": {},
        "last-modified": "2024-03-20T13:00:00",
        "references": [
            "https://vuldb.com/?id.257374",
            "https://vuldb.com/?ctiid.257374",
            "https://github.com/E1CHO/cve_hub/blob/main/Online%20Job%20Finder%20System/Online%20Job%20Finder%20System%20-%20vuln%207.pdf"
        ],
        "summary": "A vulnerability classified as critical was found in Campcodes Online Job Finder System 1.0. This vulnerability affects unknown code of the file /admin/employee/index.php. The manipulation of the argument id leads to sql injection. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used. VDB-257374 is the identifier assigned to this vulnerability."
    },
    {
        "Modified": "2024-03-20T13:00:00",
        "Published": "2024-03-20T06:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-28584",
        "impact": {},
        "last-modified": "2024-03-20T13:00:00",
        "references": [
            "https://github.com/Ruanxingzhi/vul-report/tree/master/freeimage-r1909"
        ],
        "summary": "Null Pointer Dereference vulnerability in open source FreeImage v.3.19.0 [r1909] allows a local attacker to cause a denial of service (DoS) via the J2KImageToFIBITMAP() function when reading images in J2K format."
    },
    {
        "Modified": "2024-03-20T13:00:00",
        "Published": "2024-03-20T06:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-89",
        "id": "CVE-2024-2676",
        "impact": {},
        "last-modified": "2024-03-20T13:00:00",
        "references": [
            "https://vuldb.com/?id.257376",
            "https://vuldb.com/?ctiid.257376",
            "https://github.com/E1CHO/cve_hub/blob/main/Online%20Job%20Finder%20System/Online%20Job%20Finder%20System%20-%20vuln%209.pdf"
        ],
        "summary": "A vulnerability, which was classified as critical, was found in Campcodes Online Job Finder System 1.0. Affected is an unknown function of the file /admin/company/controller.php. The manipulation of the argument id leads to sql injection. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used. The identifier of this vulnerability is VDB-257376."
    },
    {
        "Modified": "2024-03-20T13:00:00",
        "Published": "2024-03-20T07:15:00",
        "access": {},
        "assigner": "cve-request@wordfence.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-1119",
        "impact": {},
        "last-modified": "2024-03-20T13:00:00",
        "references": [
            "https://www.wordfence.com/threat-intel/vulnerabilities/id/6f837d6b-d1fa-4019-892a-dca3c0f29ca7?source=cve",
            "https://plugins.trac.wordpress.org/browser/order-tip-woo/trunk/admin/controllers/reports.class.php#L359",
            "https://plugins.trac.wordpress.org/changeset?sfp_email=&sfph_mail=&reponame=&old=3052259%40order-tip-woo&new=3052259%40order-tip-woo&sfp_email=&sfph_mail="
        ],
        "summary": "The Order Tip for WooCommerce plugin for WordPress is vulnerable to unauthorized access of data due to a missing capability check on the export_tips_to_csv() function in all versions up to, and including, 1.3.1. This makes it possible for unauthenticated attackers to export the plugin's order fees."
    },
    {
        "Modified": "2024-03-20T13:00:00",
        "Published": "2024-03-20T07:15:00",
        "access": {},
        "assigner": "cve-request@wordfence.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-1181",
        "impact": {},
        "last-modified": "2024-03-20T13:00:00",
        "references": [
            "https://www.wordfence.com/threat-intel/vulnerabilities/id/6dc144cd-7119-477f-9fa1-b00cab215077?source=cve",
            "https://plugins.trac.wordpress.org/browser/coming-soon-wp/trunk/coming-soon-wp.php#L45"
        ],
        "summary": "The Coming Soon, Under Construction & Maintenance Mode By Dazzler plugin for WordPress is vulnerable to maintenance mode bypass in all versions up to, and including, 2.1.2. This is due to the plugin relying on the REQUEST_URI to determine if the page being accesses is an admin area.  This makes it possible for unauthenticated attackers to bypass maintenance mode and access the site which may be considered confidential when in maintenance mode."
    },
    {
        "Modified": "2024-03-20T13:00:00",
        "Published": "2024-03-20T07:15:00",
        "access": {},
        "assigner": "cve-request@wordfence.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-1205",
        "impact": {},
        "last-modified": "2024-03-20T13:00:00",
        "references": [
            "https://www.wordfence.com/threat-intel/vulnerabilities/id/a4219c10-9d2a-429d-9ac7-61efc02bd4cf?source=cve",
            "https://plugins.trac.wordpress.org/browser/wemanage-app-worker/trunk/includes/class-nouvello-wemanage-worker-api-wc-ext-controller-functions.php#L982",
            "https://plugins.trac.wordpress.org/browser/wemanage-app-worker/trunk/includes/class-nouvello-wemanage-worker-api-wc-ext-controller.php#L166"
        ],
        "summary": "The Management App for WooCommerce – Order notifications, Order management, Lead management, Uptime Monitoring plugin for WordPress is vulnerable to arbitrary file uploads due to missing file type validation in the nouvello_upload_csv_file function in all versions up to, and including, 1.2.0. This makes it possible for authenticated attackers, with subscriber-level access and above, to upload arbitrary files on the affected site's server which may make remote code execution possible."
    },
    {
        "Modified": "2024-03-20T13:00:00",
        "Published": "2024-03-20T07:15:00",
        "access": {},
        "assigner": "cve-request@wordfence.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-1325",
        "impact": {},
        "last-modified": "2024-03-20T13:00:00",
        "references": [
            "https://www.wordfence.com/threat-intel/vulnerabilities/id/ca1c1b43-def2-4f9f-b5c7-075ca188f6e7?source=cve",
            "https://plugins.trac.wordpress.org/browser/woomotiv/tags/3.4.1/lib/class-backend.php#L495",
            "https://wordpress.org/plugins/woomotiv/"
        ],
        "summary": "The Live Sales Notification for Woocommerce – Woomotiv plugin for WordPress is vulnerable to Cross-Site Request Forgery in all versions up to, and including, 3.4.3. This is due to missing or incorrect nonce validation on the 'ajax_cancel_review' function. This makes it possible for unauthenticated attackers to reset the site's review count via a forged request granted they can trick a site administrator into performing an action such as clicking on a link."
    },
    {
        "Modified": "2024-03-20T13:00:00",
        "Published": "2024-03-20T05:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-22078",
        "impact": {},
        "last-modified": "2024-03-20T13:00:00",
        "references": [
            "https://www.elspec-ltd.com/support/security-advisories/"
        ],
        "summary": "An issue was discovered in Elspec G5 digital fault recorder versions 1.1.4.15 and before. Privilege escalation can occur via world writable files. The network configuration script has weak filesystem permissions. This results in write access for all authenticated users and the possibility to escalate from user privileges to administrative privileges."
    },
    {
        "Modified": "2024-03-20T13:00:00",
        "Published": "2024-03-20T07:15:00",
        "access": {},
        "assigner": "cve-request@wordfence.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-1379",
        "impact": {},
        "last-modified": "2024-03-20T13:00:00",
        "references": [
            "https://www.wordfence.com/threat-intel/vulnerabilities/id/b8564dbb-6be8-4999-be65-d28609e05451?source=cve",
            "https://plugins.trac.wordpress.org/browser/website-article-monetization-by-magenet/trunk/admin/article-backlinks-admin.php#L110"
        ],
        "summary": "The Website Article Monetization By MageNet plugin for WordPress is vulnerable to Stored Cross-Site Scripting via the 'abp_auth_key' parameter in all versions up to, and including, 1.0.11 due to insufficient input sanitization and output escaping and a missing authorization check. This makes it possible for unauthenticated attackers to inject arbitrary web scripts in pages that will execute whenever a user accesses an injected page."
    },
    {
        "Modified": "2024-03-20T13:00:00",
        "Published": "2024-03-20T05:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-22082",
        "impact": {},
        "last-modified": "2024-03-20T13:00:00",
        "references": [
            "https://www.elspec-ltd.com/support/security-advisories/"
        ],
        "summary": "An issue was discovered in Elspec G5 digital fault recorder versions 1.1.4.15 and before. Unauthenticated directory listing can occur: the web interface cay be abused be an attacker get a better understanding of the operating system."
    },
    {
        "Modified": "2024-03-20T13:00:00",
        "Published": "2024-03-20T07:15:00",
        "access": {},
        "assigner": "cve-request@wordfence.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-1473",
        "impact": {},
        "last-modified": "2024-03-20T13:00:00",
        "references": [
            "https://www.wordfence.com/threat-intel/vulnerabilities/id/48dc10a9-7bb9-401f-befd-1bf620858825?source=cve",
            "https://wordpress.org/plugins/colorlib-coming-soon-maintenance/"
        ],
        "summary": "The Coming Soon & Maintenance Mode by Colorlib plugin for WordPress is vulnerable to Information Exposure in all versions up to, and including, 1.0.99 via the REST API. This makes it possible for unauthenticated attackers to obtain post and page contents via REST API thus bypassing maintenance mode protection provided by the plugin."
    },
    {
        "Modified": "2024-03-20T13:00:00",
        "Published": "2024-03-20T05:15:00",
        "access": {},
        "assigner": "contact@wpscan.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-7246",
        "impact": {},
        "last-modified": "2024-03-20T13:00:00",
        "references": [
            "https://wpscan.com/vulnerability/7413d5ec-10a7-4cb8-ac1c-4ef554751518/"
        ],
        "summary": "The System Dashboard WordPress plugin before 2.8.10 does not sanitize and escape some parameters, which could allow administrators in multisite WordPress configurations to perform Cross-Site Scripting attacks"
    },
    {
        "Modified": "2024-03-20T13:00:00",
        "Published": "2024-03-20T05:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-22083",
        "impact": {},
        "last-modified": "2024-03-20T13:00:00",
        "references": [
            "https://www.elspec-ltd.com/support/security-advisories/"
        ],
        "summary": "An issue was discovered in Elspec G5 digital fault recorder versions 1.1.4.15 and before. A hardcoded backdoor session ID exists that can be used for further access to the device, including reconfiguration tasks."
    }
]