[
    {
        "Modified": "2023-03-29T19:54:00",
        "Published": "2023-03-24T20:15:00",
        "access": {},
        "assigner": "security@android.com",
        "cvss": null,
        "cwe": "CWE-125",
        "id": "CVE-2023-21064",
        "impact": {},
        "last-modified": "2023-03-29T19:54:00",
        "references": [
            "https://source.android.com/security/bulletin/pixel/2023-03-01"
        ],
        "summary": "In DoSetPinControl of miscservice.cpp, there is a possible out of bounds read due to a missing bounds check. This could lead to local escalation of privilege with System execution privileges needed. User interaction is not needed for exploitation.Product: AndroidVersions: Android kernelAndroid ID: A-243130078References: N/A"
    },
    {
        "Modified": "2023-03-29T19:52:00",
        "Published": "2023-03-24T20:15:00",
        "access": {},
        "assigner": "security@android.com",
        "cvss": null,
        "cwe": "CWE-125",
        "id": "CVE-2023-21063",
        "impact": {},
        "last-modified": "2023-03-29T19:52:00",
        "references": [
            "https://source.android.com/security/bulletin/pixel/2023-03-01"
        ],
        "summary": "In ParseWithAuthType of simdata.cpp, there is a possible out of bounds read due to an incorrect bounds check. This could lead to local escalation of privilege with System execution privileges needed. User interaction is not needed for exploitation.Product: AndroidVersions: Android kernelAndroid ID: A-243129862References: N/A"
    },
    {
        "Modified": "2023-03-29T19:40:00",
        "Published": "2023-03-22T19:15:00",
        "access": {},
        "assigner": "security-advisories@github.com",
        "cvss": null,
        "cwe": "CWE-755",
        "id": "CVE-2023-28114",
        "impact": {},
        "last-modified": "2023-03-29T19:40:00",
        "references": [
            "https://artifacthub.io/packages/helm/cilium/cilium",
            "https://github.com/cilium/cilium-cli/security/advisories/GHSA-6f27-3p6c-p5jc",
            "https://github.com/cilium/cilium-cli/releases/tag/v0.13.2",
            "https://github.com/cilium/cilium-cli/commit/fb1427025764e1eebc4a7710d902c4f22cae2610"
        ],
        "summary": "`cilium-cli` is the command line interface to install, manage, and troubleshoot Kubernetes clusters running Cilium. Prior to version 0.13.2,`cilium-cli`, when used to configure cluster mesh functionality, can remove the enforcement of user permissions on the `etcd` store used to mirror local cluster information to remote clusters. Users who have set up cluster meshes using the Cilium Helm chart are not affected by this issue. Due to an incorrect mount point specification, the settings specified by the `initContainer` that configures `etcd` users and their permissions are overwritten when using `cilium-cli` to configure a cluster mesh. An attacker who has already gained access to a valid key and certificate for an `etcd` cluster compromised in this manner could then modify state in that `etcd` cluster. This issue is patched in `cilium-cli` 0.13.2. As a workaround, one may use Cilium's Helm charts to create their cluster."
    },
    {
        "Modified": "2023-03-29T19:39:00",
        "Published": "2023-03-22T19:15:00",
        "access": {},
        "assigner": "security-advisories@github.com",
        "cvss": null,
        "cwe": "CWE-307",
        "id": "CVE-2023-25820",
        "impact": {},
        "last-modified": "2023-03-29T19:39:00",
        "references": [
            "https://hackerone.com/reports/1842114",
            "https://github.com/nextcloud/security-advisories/security/advisories/GHSA-36g6-wjx2-333x",
            "https://github.com/nextcloud/server/pull/36489"
        ],
        "summary": "Nextcloud Server is the file server software for Nextcloud, a self-hosted productivity platform, and Nextcloud Enterprise Server is the enterprise version of the file server software. In Nextcloud Server versions 25.0.x prior to 25.0.5 and versions 24.0.x prior to 24.0.10 as well as Nextcloud Enterprise Server versions 25.0.x prior to 25.0.4, 24.0.x prior to 24.0.10, 23.0.x prior to 23.0.12.5, 22.x prior to 22.2.0.10, and 21.x prior to 21.0.9.10, when an attacker gets access to an already logged in user session they can then brute force the password on the confirmation endpoint. Nextcloud Server should upgraded to 24.0.10 or 25.0.4 and Nextcloud Enterprise Server should upgraded to 21.0.9.10, 22.2.10.10, 23.0.12.5, 24.0.10, or 25.0.4 to receive a patch. No known workarounds are available."
    },
    {
        "Modified": "2023-03-29T19:38:00",
        "Published": "2023-03-22T19:15:00",
        "access": {},
        "assigner": "security@opennms.com",
        "cvss": null,
        "cwe": "CWE-352",
        "id": "CVE-2023-0870",
        "impact": {},
        "last-modified": "2023-03-29T19:38:00",
        "references": [
            "https://github.com/OpenNMS/opennms/pull/5835/files",
            "https://docs.opennms.com/meridian/2023/releasenotes/changelog.html#releasenotes-changelog-Meridian-2023.1.1"
        ],
        "summary": "A form can be manipulated with cross-site request forgery in multiple versions of OpenNMS Meridian and Horizon. This can potentially allow an attacker to gain access to confidential information and compromise integrity. The solution is to upgrade to Meridian 2023.1.1 or Horizon 31.0.6 or newer. Meridian and Horizon installation instructions state that they are intended for installation within an organization's private networks and should not be directly accessible from the Internet."
    },
    {
        "Modified": "2023-03-29T19:37:00",
        "Published": "2023-03-22T17:15:00",
        "access": {},
        "assigner": "openssl-security@openssl.org",
        "cvss": null,
        "cwe": "CWE-295",
        "id": "CVE-2023-0464",
        "impact": {},
        "last-modified": "2023-03-29T19:37:00",
        "references": [
            "https://git.openssl.org/gitweb/?p=openssl.git;a=commitdiff;h=2017771e2db3e2b96f89bbe8766c3209f6a99545",
            "https://git.openssl.org/gitweb/?p=openssl.git;a=commitdiff;h=959c59c7a0164117e7f8366466a32bb1f8d77ff1",
            "https://www.openssl.org/news/secadv/20230322.txt",
            "https://git.openssl.org/gitweb/?p=openssl.git;a=commitdiff;h=2dcd4f1e3115f38cefa43e3efbe9b801c27e642e",
            "https://git.openssl.org/gitweb/?p=openssl.git;a=commitdiff;h=879f7080d7e141f415c79eaa3a8ac4a3dad0348b"
        ],
        "summary": "A security vulnerability has been identified in all supported versions of OpenSSL related to the verification of X.509 certificate chains that include policy constraints. Attackers may be able to exploit this vulnerability by creating a malicious certificate chain that triggers exponential use of computational resources, leading to a denial-of-service (DoS) attack on affected systems. Policy processing is disabled by default but can be enabled by passing the `-policy' argument to the command line utilities or by calling the `X509_VERIFY_PARAM_set1_policies()' function."
    },
    {
        "Modified": "2023-03-29T19:27:00",
        "Published": "2023-03-22T06:15:00",
        "access": {},
        "assigner": "security@trendmicro.com",
        "cvss": null,
        "cwe": "NVD-CWE-noinfo",
        "id": "CVE-2023-28005",
        "impact": {},
        "last-modified": "2023-03-29T19:27:00",
        "references": [
            "https://success.trendmicro.com/solution/000292473"
        ],
        "summary": "A vulnerability in Trend Micro Endpoint Encryption Full Disk Encryption version 6.0.0.3204 and below could allow an attacker with physical access to an affected device to bypass Microsoft Windows? Secure Boot process in an attempt to execute other attacks to obtain access to the contents of the device. An attacker must first obtain physical access to the target system in order to exploit this vulnerability. It is also important to note that the contents of the drive(s) encrypted with TMEE FDE would still be protected and would NOT be accessible by the attacker by exploitation of this vulnerability alone."
    },
    {
        "Modified": "2023-03-29T19:24:00",
        "Published": "2023-03-24T20:15:00",
        "access": {},
        "assigner": "security@android.com",
        "cvss": null,
        "cwe": "CWE-787",
        "id": "CVE-2023-21054",
        "impact": {},
        "last-modified": "2023-03-29T19:24:00",
        "references": [
            "https://source.android.com/security/bulletin/pixel/2023-03-01"
        ],
        "summary": "In EUTRAN_LCS_ConvertLCS_MOLRReq of LPP_CommonUtil.c, there is a possible out of bounds write due to a logic error in the code. This could lead to remote code execution with System execution privileges needed. User interaction is not needed for exploitation.Product: AndroidVersions: Android kernelAndroid ID: A-244556535References: N/A"
    },
    {
        "Modified": "2023-03-29T19:19:00",
        "Published": "2023-03-24T20:15:00",
        "access": {},
        "assigner": "security@android.com",
        "cvss": null,
        "cwe": "CWE-787",
        "id": "CVE-2023-21052",
        "impact": {},
        "last-modified": "2023-03-29T19:19:00",
        "references": [
            "https://source.android.com/security/bulletin/pixel/2023-03-01"
        ],
        "summary": "In setToExternal of ril_external_client.cpp, there is a possible out of bounds write due to a missing bounds check. This could lead to local escalation of privilege with System execution privileges needed. User interaction is not needed for exploitation.Product: AndroidVersions: Android kernelAndroid ID: A-259063189References: N/A"
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-416",
        "id": "CVE-2022-28641",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://www.bentley.com/en/common-vulnerability-exposure/be-2022-0006",
            "https://www.zerodayinitiative.com/advisories/ZDI-22-613/"
        ],
        "summary": "This vulnerability allows remote attackers to execute arbitrary code on affected installations of Bentley MicroStation CONNECT 10.16.02.34. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file. The specific flaw exists within the parsing of IFC files. The issue results from the lack of validating the existence of an object prior to performing operations on the object. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-16390."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-787",
        "id": "CVE-2022-37355",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://www.tracker-software.com/product/pdf-xchange-editor/history",
            "https://www.zerodayinitiative.com/advisories/ZDI-22-1083/"
        ],
        "summary": "This vulnerability allows remote attackers to execute arbitrary code on affected installations of PDF-XChange Editor. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file. The specific flaw exists within the parsing of JPG files. Crafted data in a JPG file can trigger a write past the end of an allocated buffer. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-17629."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-787",
        "id": "CVE-2022-37362",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://www.tracker-software.com/product/pdf-xchange-editor/history",
            "https://www.zerodayinitiative.com/advisories/ZDI-22-1090/"
        ],
        "summary": "This vulnerability allows remote attackers to execute arbitrary code on affected installations of PDF-XChange Editor. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file. The specific flaw exists within the parsing of PNG files. Crafted data in a PNG file can trigger a write past the end of an allocated buffer. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-17660."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-416",
        "id": "CVE-2022-37387",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://www.zerodayinitiative.com/advisories/ZDI-22-1059/",
            "https://www.foxit.com/support/security-bulletins.html"
        ],
        "summary": "This vulnerability allows remote attackers to execute arbitrary code on affected installations of Foxit PDF Reader 11.2.2.53575. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file. The specific flaw exists within the handling of AcroForms. The issue results from the lack of validating the existence of an object prior to performing operations on the object. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-17552."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-416",
        "id": "CVE-2022-37391",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://www.foxit.com/support/security-bulletins.html",
            "https://www.zerodayinitiative.com/advisories/ZDI-22-1063/"
        ],
        "summary": "This vulnerability allows remote attackers to execute arbitrary code on affected installations of Foxit PDF Reader 11.2.2.53575. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file. The specific flaw exists within the handling of AcroForms. The issue results from the lack of validating the existence of an object prior to performing operations on the object. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-17661."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-89",
        "id": "CVE-2022-42428",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://www.zerodayinitiative.com/advisories/ZDI-22-1399/"
        ],
        "summary": "This vulnerability allows remote attackers to escalate privileges on affected installations of Centreon. Authentication is required to exploit this vulnerability. The specific flaw exists within the handling of requests to modify poller broker configuration. The issue results from the lack of proper validation of a user-supplied string before using it to construct SQL queries. An attacker can leverage this vulnerability to escalate privileges to the level of an administrator. Was ZDI-CAN-18410."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-120",
        "id": "CVE-2022-42431",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://www.zerodayinitiative.com/advisories/ZDI-22-1407/"
        ],
        "summary": "This vulnerability allows local attackers to escalate privileges on affected Tesla vehicles. An attacker must first obtain the ability to execute privileged code on the target system in order to exploit this vulnerability. The specific flaw exists within the bcmdhd driver. The issue results from the lack of proper validation of the length of user-supplied data prior to copying it to a buffer. An attacker can leverage this vulnerability to escalate privileges and execute arbitrary code in the context of root. Was ZDI-CAN-17544."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-125",
        "id": "CVE-2022-43612",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://www.zerodayinitiative.com/advisories/ZDI-22-1470/"
        ],
        "summary": "This vulnerability allows remote attackers to disclose sensitive information on affected installations of Corel CorelDRAW Graphics Suite 23.5.0.506. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file. The specific flaw exists within the parsing of JP2 images. The issue results from the lack of proper validation of user-supplied data, which can result in a read past the end of an allocated object. An attacker can leverage this in conjunction with other vulnerabilities to execute arbitrary code in the context of the current process. Was ZDI-CAN-16355."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-787",
        "id": "CVE-2022-43617",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://www.zerodayinitiative.com/advisories/ZDI-22-1475/"
        ],
        "summary": "This vulnerability allows remote attackers to execute arbitrary code on affected installations of Corel CorelDRAW Graphics Suite 23.5.0.506. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file. The specific flaw exists within the parsing of PCX files. The issue results from the lack of proper validation of user-supplied data, which can result in a write past the end of an allocated object. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-16372."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-787",
        "id": "CVE-2022-43618",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://www.zerodayinitiative.com/advisories/ZDI-22-1476/"
        ],
        "summary": "This vulnerability allows remote attackers to execute arbitrary code on affected installations of Corel CorelDRAW Graphics Suite 23.5.0.506. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file. The specific flaw exists within the parsing of PCX files. The issue results from the lack of proper validation of user-supplied data, which can result in a write past the end of an allocated object. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-16377."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-78",
        "id": "CVE-2022-43631",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://www.zerodayinitiative.com/advisories/ZDI-22-1502/",
            "https://supportannouncement.us.dlink.com/announcement/publication.aspx?name=SAP10310"
        ],
        "summary": "This vulnerability allows network-adjacent attackers to execute arbitrary code on affected installations of D-Link DIR-1935 1.03 routers. Although authentication is required to exploit this vulnerability, the existing authentication mechanism can be bypassed. The specific flaw exists within the handling of SetVirtualServerSettings requests to the web management portal. When parsing subelements within the VirtualServerInfo element, the process does not properly validate a user-supplied string before using it to execute a system call. An attacker can leverage this vulnerability to execute code in the context of root. Was ZDI-CAN-16151."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-78",
        "id": "CVE-2022-43632",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://supportannouncement.us.dlink.com/announcement/publication.aspx?name=SAP10310",
            "https://www.zerodayinitiative.com/advisories/ZDI-22-1504/"
        ],
        "summary": "This vulnerability allows network-adjacent attackers to execute arbitrary code on affected installations of D-Link DIR-1935 1.03 routers. Although authentication is required to exploit this vulnerability, the existing authentication mechanism can be bypassed. The specific flaw exists within the handling of SetQoSSettings requests to the web management portal. When parsing subelements within the QoSInfo element, the process does not properly validate a user-supplied string before using it to execute a system call. An attacker can leverage this vulnerability to execute code in the context of root. Was ZDI-CAN-16153."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-122",
        "id": "CVE-2022-43634",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://github.com/Netatalk/Netatalk/pull/186",
            "https://www.zerodayinitiative.com/advisories/ZDI-23-094/"
        ],
        "summary": "This vulnerability allows remote attackers to execute arbitrary code on affected installations of Netatalk. Authentication is not required to exploit this vulnerability. The specific flaw exists within the dsi_writeinit function. The issue results from the lack of proper validation of the length of user-supplied data prior to copying it to a fixed-length heap-based buffer. An attacker can leverage this vulnerability to execute code in the context of root. Was ZDI-CAN-17646."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-330",
        "id": "CVE-2022-43636",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://www.zerodayinitiative.com/advisories/ZDI-22-1614/"
        ],
        "summary": "This vulnerability allows network-adjacent attackers to bypass authentication on affected installations of TP-Link TL-WR940N 6_211111 3.20.1(US) routers. Authentication is not required to exploit this vulnerability. The specific flaw exists within the httpd service, which listens on TCP port 80 by default. The issue results from the lack of sufficient randomness in the sequnce numbers used for session managment. An attacker can leverage this vulnerability to bypass authentication on the system. Was ZDI-CAN-18334."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-416",
        "id": "CVE-2022-43637",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://www.zerodayinitiative.com/advisories/ZDI-22-1657/",
            "https://www.foxit.com/support/security-bulletins.html"
        ],
        "summary": "This vulnerability allows remote attackers to execute arbitrary code on affected installations of Foxit PDF Reader 12.0.1.12430. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file. The specific flaw exists within the parsing of U3D files. The issue results from the lack of validating the existence of an object prior to performing operations on the object. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-18626."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-416",
        "id": "CVE-2022-43639",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://www.zerodayinitiative.com/advisories/ZDI-22-1659/",
            "https://www.foxit.com/support/security-bulletins.html"
        ],
        "summary": "This vulnerability allows remote attackers to execute arbitrary code on affected installations of Foxit PDF Reader 12.0.1.12430. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file. The specific flaw exists within the parsing of U3D files. The issue results from the lack of validating the existence of an object prior to performing operations on the object. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-18628."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-125",
        "id": "CVE-2022-43640",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://www.zerodayinitiative.com/advisories/ZDI-22-1660/",
            "https://www.foxit.com/support/security-bulletins.html"
        ],
        "summary": "This vulnerability allows remote attackers to disclose sensitive information on affected installations of Foxit PDF Reader 12.0.1.12430. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file. The specific flaw exists within the parsing of PDF files. Crafted data in a PDF file can trigger a read past the end of an allocated buffer. An attacker can leverage this in conjunction with other vulnerabilities to execute arbitrary code in the context of the current process. Was ZDI-CAN-18629."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-416",
        "id": "CVE-2022-43641",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://www.zerodayinitiative.com/advisories/ZDI-22-1661/",
            "https://www.foxit.com/support/security-bulletins.html"
        ],
        "summary": "This vulnerability allows remote attackers to disclose sensitive information on affected installations of Foxit PDF Reader 12.0.1.12430. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file. The specific flaw exists within the parsing of U3D files. The issue results from the lack of validating the existence of an object prior to performing operations on the object. An attacker can leverage this in conjunction with other vulnerabilities to execute arbitrary code in the context of the current process. Was ZDI-CAN-18894."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-78",
        "id": "CVE-2022-43642",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://supportannouncement.us.dlink.com/announcement/publication.aspx?name=SAP10319",
            "https://www.zerodayinitiative.com/advisories/ZDI-22-1701/"
        ],
        "summary": "This vulnerability allows network-adjacent attackers to execute arbitrary code on affected installations of D-Link DIR-825 1.0.9/EE routers. Authentication is not required to exploit this vulnerability. The specific flaw exists within the YouTube plugin for the xupnpd service, which listens on TCP port 4044. The issue results from the lack of proper validation of a user-supplied string before using it to execute a system call. An attacker can leverage this vulnerability to execute code in the context of the admin user. Was ZDI-CAN-19222."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-78",
        "id": "CVE-2022-43643",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://supportannouncement.us.dlink.com/announcement/publication.aspx?name=SAP10319",
            "https://www.zerodayinitiative.com/advisories/ZDI-22-1702/"
        ],
        "summary": "This vulnerability allows network-adjacent attackers to execute arbitrary code on affected installations of D-Link DIR-825 1.0.9/EE routers. Authentication is not required to exploit this vulnerability. The specific flaw exists within the Generic plugin for the xupnpd service, which listens on TCP port 4044. The issue results from the lack of proper validation of a user-supplied string before using it to execute a system call. An attacker can leverage this vulnerability to execute code in the context of the admin user. Was ZDI-CAN-19460."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-78",
        "id": "CVE-2022-43644",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://supportannouncement.us.dlink.com/announcement/publication.aspx?name=SAP10319",
            "https://www.zerodayinitiative.com/advisories/ZDI-22-1703/"
        ],
        "summary": "This vulnerability allows network-adjacent attackers to execute arbitrary code on affected installations of D-Link DIR-825 1.0.9/EE routers. Authentication is not required to exploit this vulnerability. The specific flaw exists within the Dreambox plugin for the xupnpd service, which listens on TCP port 4044. The issue results from the lack of proper validation of a user-supplied string before using it to execute a system call. An attacker can leverage this vulnerability to execute code in the context of the admin user. Was ZDI-CAN-19461."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-78",
        "id": "CVE-2022-43645",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://supportannouncement.us.dlink.com/announcement/publication.aspx?name=SAP10319",
            "https://www.zerodayinitiative.com/advisories/ZDI-22-1704/"
        ],
        "summary": "This vulnerability allows network-adjacent attackers to execute arbitrary code on affected installations of D-Link DIR-825 1.0.9/EE routers. Authentication is not required to exploit this vulnerability. The specific flaw exists within the IVI plugin for the xupnpd service, which listens on TCP port 4044. The issue results from the lack of proper validation of a user-supplied string before using it to execute a system call. An attacker can leverage this vulnerability to execute code in the context of the admin user. Was ZDI-CAN-19462."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-78",
        "id": "CVE-2022-43646",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://supportannouncement.us.dlink.com/announcement/publication.aspx?name=SAP10319",
            "https://www.zerodayinitiative.com/advisories/ZDI-22-1705/"
        ],
        "summary": "This vulnerability allows network-adjacent attackers to execute arbitrary code on affected installations of D-Link DIR-825 1.0.9/EE routers. Authentication is not required to exploit this vulnerability. The specific flaw exists within the Vimeo plugin for the xupnpd service, which listens on TCP port 4044. The issue results from the lack of proper validation of a user-supplied string before using it to execute a system call. An attacker can leverage this vulnerability to execute code in the context of the admin user. Was ZDI-CAN-19463."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-78",
        "id": "CVE-2022-43647",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://supportannouncement.us.dlink.com/announcement/publication.aspx?name=SAP10319",
            "https://www.zerodayinitiative.com/advisories/ZDI-22-1706/"
        ],
        "summary": "This vulnerability allows network-adjacent attackers to execute arbitrary code on affected installations of D-Link DIR-825 1.0.9/EE routers. Authentication is not required to exploit this vulnerability. The specific flaw exists within the xupnpd service, which listens on TCP port 4044. The issue results from the lack of proper validation of a user-supplied string before using it to execute a system call. An attacker can leverage this vulnerability to execute code in the context of the admin user. Was ZDI-CAN-19464."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-122",
        "id": "CVE-2022-43648",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://supportannouncement.us.dlink.com/announcement/publication.aspx?name=SAP10322",
            "https://www.zerodayinitiative.com/advisories/ZDI-23-052/"
        ],
        "summary": "This vulnerability allows network-adjacent attackers to execute arbitrary code on affected installations of D-Link DIR-3040 1.20B03 routers. Authentication is not required to exploit this vulnerability. The specific flaw exists within the MiniDLNA service. The issue results from the lack of proper validation of the length of user-supplied data prior to copying it to a heap-based buffer. An attacker can leverage this vulnerability to execute code in the context of the MiniDLNA service. Was ZDI-CAN-19910."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-416",
        "id": "CVE-2022-43649",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://www.zerodayinitiative.com/advisories/ZDI-23-091/",
            "https://www.foxit.com/support/security-bulletins.html"
        ],
        "summary": "This vulnerability allows remote attackers to execute arbitrary code on affected installations of Foxit PDF Reader 12.0.2.12465. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file. The specific flaw exists within the handling of Annotation objects. The issue results from the lack of validating the existence of an object prior to performing operations on the object. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-19478."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-125",
        "id": "CVE-2022-43650",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://www.win-rar.com/singlenewsview.html?&L=0&tx_ttnews%5Btt_news%5D=216&cHash=983dfbcc83fb1b64a5f792891a281709",
            "https://www.zerodayinitiative.com/advisories/ZDI-23-092/"
        ],
        "summary": "This vulnerability allows remote attackers to disclose sensitive information on affected installations of RARLAB WinRAR 6.11.0.0. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file. The specific flaw exists within the parsing of ZIP files. Crafted data in a ZIP file can trigger a read past the end of an allocated buffer. An attacker can leverage this in conjunction with other vulnerabilities to execute arbitrary code in the context of the current process. Was ZDI-CAN-19232."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "audit@patchstack.com",
        "cvss": null,
        "cwe": "CWE-89",
        "id": "CVE-2022-45355",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://patchstack.com/database/vulnerability/wp-pipes/wordpress-wp-pipes-plugin-1-33-auth-sql-injection-sqli-vulnerability?_s_id=cve"
        ],
        "summary": "Auth. (admin+) SQL Injection (SQLi) vulnerability in ThimPress WP Pipes plugin <= 1.33 versions."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "audit@patchstack.com",
        "cvss": null,
        "cwe": "CWE-79",
        "id": "CVE-2022-47603",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://patchstack.com/database/vulnerability/gallery-album/wordpress-gallery-image-and-video-gallery-with-thumbnails-plugin-2-0-1-cross-site-scripting-xss?_s_id=cve"
        ],
        "summary": "Unauth. Reflected Cross-Site Scripting (XSS) vulnerability in wpdevart Gallery – Image and Video Gallery with Thumbnails plugin <= 2.0.1 versions."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "audit@patchstack.com",
        "cvss": null,
        "cwe": "CWE-79",
        "id": "CVE-2022-47607",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://patchstack.com/database/vulnerability/usersnap/wordpress-usersnap-plugin-4-16-cross-site-scripting-xss?_s_id=cve"
        ],
        "summary": "Auth. (admin+) Stored Cross-Site Scripting (XSS) vulnerability in Usersnap plugin <= 4.16 versions."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "audit@patchstack.com",
        "cvss": null,
        "cwe": "CWE-79",
        "id": "CVE-2022-47610",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://patchstack.com/database/vulnerability/simple-image-popup/wordpress-simple-image-popup-plugin-1-3-6-cross-site-scripting-xss?_s_id=cve"
        ],
        "summary": "Auth. (admin+) Stored Cross-Site Scripting (XSS) vulnerability in Mr Digital Simple Image Popup plugin <= 1.3.6 versions."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "audit@patchstack.com",
        "cvss": null,
        "cwe": "CWE-79",
        "id": "CVE-2022-47613",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://patchstack.com/database/vulnerability/chatbot/wordpress-chatbot-plugin-4-3-0-multiple-cross-site-scripting-xss?_s_id=cve"
        ],
        "summary": "Auth. (admin+) Stored Cross-Site Scripting (XSS) vulnerability in QuantumCloud AI ChatBot plugin <= 4.3.0 versions."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "security-advisories@github.com",
        "cvss": null,
        "cwe": "CWE-281",
        "id": "CVE-2023-25809",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://github.com/opencontainers/runc/security/advisories/GHSA-m8cg-xc2p-r3fc",
            "https://github.com/opencontainers/runc/commit/0d62b950e60f6980b54fe3bafd9a9c608dc1df17"
        ],
        "summary": "runc is a CLI tool for spawning and running containers according to the OCI specification. In affected versions it was found that rootless runc makes `/sys/fs/cgroup` writable in following conditons: 1. when runc is executed inside the user namespace, and the `config.json` does not specify the cgroup namespace to be unshared (e.g.., `(docker|podman|nerdctl) run --cgroupns=host`, with Rootless Docker/Podman/nerdctl) or 2. when runc is executed outside the user namespace, and `/sys` is mounted with `rbind, ro` (e.g., `runc spec --rootless`; this condition is very rare). A container may gain the write access to user-owned cgroup hierarchy `/sys/fs/cgroup/user.slice/...` on the host . Other users's cgroup hierarchies are not affected. Users are advised to upgrade to version 1.1.5. Users unable to upgrade may unshare the cgroup namespace (`(docker|podman|nerdctl) run --cgroupns=private)`. This is the default behavior of Docker/Podman/nerdctl on cgroup v2 hosts. or add `/sys/fs/cgroup` to `maskedPaths`."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "security-advisories@github.com",
        "cvss": null,
        "cwe": "CWE-79",
        "id": "CVE-2023-27489",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://github.com/kiwitcms/Kiwi/security/advisories/GHSA-2wcr-87wf-cf9j",
            "https://github.com/kiwitcms/Kiwi/commit/6617cee0fb70cc394b7be6bbc86ef84e6e9de077"
        ],
        "summary": "Kiwi TCMS is an open source test management system for both manual and automated testing. Kiwi TCMS accepts SVG files uploaded by users which could potentially contain JavaScript code. If SVG images are viewed directly, i.e. not rendered in an HTML page, this JavaScript code could execute. This vulnerability has been fixed by configuring Kiwi TCMS to serve with the Content-Security-Policy HTTP header which blocks inline JavaScript in all modern browsers. This configuration change is provided in version 12.1 and users are advised to upgrade. Users unable to upgrade may set their Content-Security-Policy HTTP header manually."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "security-advisories@github.com",
        "cvss": null,
        "cwe": "CWE-281",
        "id": "CVE-2023-28642",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://github.com/opencontainers/runc/security/advisories/GHSA-g2j6-57v7-gm8c",
            "https://github.com/opencontainers/runc/pull/3785"
        ],
        "summary": "runc is a CLI tool for spawning and running containers according to the OCI specification. It was found that AppArmor can be bypassed when `/proc` inside the container is symlinked with a specific mount configuration. This issue has been fixed in runc version 1.1.5, by prohibiting symlinked `/proc`. See PR #3785 for details. users are advised to upgrade. Users unable to upgrade should avoid using an untrusted container image."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-295",
        "id": "CVE-2022-27644",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://www.zerodayinitiative.com/advisories/ZDI-22-520/",
            "https://kb.netgear.com/000064721/Security-Advisory-for-Multiple-Vulnerabilities-on-Multiple-Products-PSV-2021-0324"
        ],
        "summary": "This vulnerability allows network-adjacent attackers to compromise the integrity of downloaded information on affected installations of NETGEAR R6700v3 1.0.4.120_10.0.91 routers. Authentication is not required to exploit this vulnerability. The specific flaw exists within the downloading of files via HTTPS. The issue results from the lack of proper validation of the certificate presented by the server. An attacker can leverage this in conjunction with other vulnerabilities to execute arbitrary code in the context of root. Was ZDI-CAN-15797."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-121",
        "id": "CVE-2022-27648",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://www.zerodayinitiative.com/advisories/ZDI-22-543/",
            "https://www.koyoele.co.jp/en/topics/202203154994/"
        ],
        "summary": "This vulnerability allows remote attackers to execute arbitrary code on affected installations of KOYO Screen Creator 0.1.1.1. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file. The specific flaw exists within the parsing of SCA2 files. The issue results from the lack of proper validation of the length of user-supplied data prior to copying it to a fixed-length stack-based buffer. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-14868."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-121",
        "id": "CVE-2022-27646",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://kb.netgear.com/000064721/Security-Advisory-for-Multiple-Vulnerabilities-on-Multiple-Products-PSV-2021-0324",
            "https://www.zerodayinitiative.com/advisories/ZDI-22-523/"
        ],
        "summary": "This vulnerability allows network-adjacent attackers to execute arbitrary code on affected installations of NETGEAR R6700v3 1.0.4.120_10.0.91 routers. Although authentication is required to exploit this vulnerability, the existing authentication mechanism can be bypassed. The specific flaw exists within the circled daemon. A crafted circleinfo.txt file can trigger an overflow of a fixed-length stack-based buffer. An attacker can leverage this vulnerability to execute code in the context of root. Was ZDI-CAN-15879."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-121",
        "id": "CVE-2022-28305",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://www.bentley.com/en/common-vulnerability-exposure/be-2022-0008",
            "https://www.zerodayinitiative.com/advisories/ZDI-22-593/"
        ],
        "summary": "This vulnerability allows remote attackers to execute arbitrary code on affected installations of Bentley MicroStation CONNECT 10.16.02.034. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file. The specific flaw exists within the parsing of OBJ files. The issue results from the lack of proper validation of the length of user-supplied data prior to copying it to a fixed-length stack-based buffer. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-16172."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-125",
        "id": "CVE-2022-28307",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://www.bentley.com/en/common-vulnerability-exposure/be-2022-0005",
            "https://www.zerodayinitiative.com/advisories/ZDI-22-598/"
        ],
        "summary": "This vulnerability allows remote attackers to execute arbitrary code on affected installations of Bentley View 10.16.02.022. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file. The specific flaw exists within the parsing of DXF files. Crafted data in a DXF file can trigger a read past the end of an allocated buffer. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-16306."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-125",
        "id": "CVE-2022-28309",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://www.zerodayinitiative.com/advisories/ZDI-22-600/",
            "https://www.bentley.com/en/common-vulnerability-exposure/be-2022-0003"
        ],
        "summary": "This vulnerability allows remote attackers to disclose sensitive information on affected installations of Bentley View 10.16.02.022. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file. The specific flaw exists within the parsing of 3DS files. Crafted data in a 3DS file can trigger a read past the end of an allocated buffer. An attacker can leverage this in conjunction with other vulnerabilities to execute arbitrary code in the context of the current process. Was ZDI-CAN-16308."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-125",
        "id": "CVE-2022-28311",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://www.bentley.com/en/common-vulnerability-exposure/be-2022-0005",
            "https://www.zerodayinitiative.com/advisories/ZDI-22-601/"
        ],
        "summary": "This vulnerability allows remote attackers to execute arbitrary code on affected installations of Bentley MicroStation CONNECT 10.16.02.034. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file. The specific flaw exists within the parsing of DXF files. Crafted data in a DXF file can trigger a read past the end of an allocated buffer. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-16341."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-22",
        "id": "CVE-2022-2560",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://www.zerodayinitiative.com/advisories/ZDI-22-1032/"
        ],
        "summary": "This vulnerability allows remote attackers to delete arbitrary files on affected installations of EnterpriseDT CompleteFTP CompleteFTP Server v22.1.0 Server. Authentication is not required to exploit this vulnerability. The specific flaw exists within the HttpFile class. The issue results from the lack of proper validation of a user-supplied path prior to using it in file operations. An attacker can leverage this vulnerability to delete files in the context of SYSTEM. Was ZDI-CAN-17481."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-611",
        "id": "CVE-2022-36969",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://www.zerodayinitiative.com/advisories/ZDI-22-1128/",
            "https://www.aveva.com/content/dam/aveva/documents/support/cyber-security-updates/SecurityBulletin_AVEVA-2022-005.pdf"
        ],
        "summary": "This vulnerability allows remote attackers to disclose sensitive information on affected installations of AVEVA Edge 2020 SP2 Patch 0(4201.2111.1802.0000). User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file. The specific flaw exists within the LoadImportedLibraries method. Due to the improper restriction of XML External Entity (XXE) references, a crafted document specifying a URI causes the XML parser to access the URI and embed the contents back into the XML document for further processing. An attacker can leverage this vulnerability to disclose information in the context of the current process. Was ZDI-CAN-17394."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-89",
        "id": "CVE-2022-36975",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://download.wavelink.com/Files/avalanche_v6.3.4_release_notes.txt",
            "https://www.zerodayinitiative.com/advisories/ZDI-22-780/"
        ],
        "summary": "This vulnerability allows remote attackers to bypass authentication on affected installations of Ivanti Avalanche 6.3.2.3490. The specific flaw exists within the ProfileDaoImpl class. A crafted request can trigger execution of SQL queries composed from a user-supplied string. An attacker can leverage this vulnerability to bypass authentication on the system. Was ZDI-CAN-15332."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-502",
        "id": "CVE-2022-36978",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://www.zerodayinitiative.com/advisories/ZDI-22-783/",
            "https://download.wavelink.com/Files/avalanche_v6.3.4_release_notes.txt"
        ],
        "summary": "This vulnerability allows remote attackers to execute arbitrary code on affected installations of Ivanti Avalanche 6.3.2.3490. Although authentication is required to exploit this vulnerability, the existing authentication mechanism can be bypassed. The specific flaw exists within the Notification Server service. The issue results from the lack of proper validation of user-supplied data, which can result in deserialization of untrusted data. An attacker can leverage this vulnerability to execute code in the context of the service account. Was ZDI-CAN-15448."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-749",
        "id": "CVE-2022-36983",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://www.zerodayinitiative.com/advisories/ZDI-22-788/",
            "https://download.wavelink.com/Files/avalanche_v6.3.4_release_notes.txt"
        ],
        "summary": "This vulnerability allows remote attackers to bypass authentication on affected installations of Ivanti Avalanche 6.3.3.101. Authentication is not required to exploit this vulnerability. The specific flaw exists within the SetSettings class. The issue results from the lack of authentication prior to allowing access to functionality. An attacker can leverage this vulnerability to bypass authentication on the system. Was ZDI-CAN-15919."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-22",
        "id": "CVE-2022-36982",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://www.zerodayinitiative.com/advisories/ZDI-22-787/",
            "https://download.wavelink.com/Files/avalanche_v6.3.4_release_notes.txt"
        ],
        "summary": "This vulnerability allows remote attackers to read arbitrary files on affected installations of Ivanti Avalanche 6.3.3.101. Although authentication is required to exploit this vulnerability, the existing authentication mechanism can be bypassed. The specific flaw exists within the AgentTaskHandler class. The issue results from the lack of proper validation of a user-supplied path prior to using it in file operations. An attacker can leverage this vulnerability to disclose stored session cookies, leading to further compromise. Was ZDI-CAN-15967."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-125",
        "id": "CVE-2022-37349",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://www.tracker-software.com/product/pdf-xchange-editor/history",
            "https://www.zerodayinitiative.com/advisories/ZDI-22-1076/"
        ],
        "summary": "This vulnerability allows remote attackers to execute arbitrary code on affected installations of PDF-XChange Editor. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file. The specific flaw exists within the submitForm method. By performing actions in JavaScript, an attacker can trigger a read past the end of an allocated buffer. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-17142."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-125",
        "id": "CVE-2022-37351",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://www.zerodayinitiative.com/advisories/ZDI-22-1079/",
            "https://www.tracker-software.com/product/pdf-xchange-editor/history"
        ],
        "summary": "This vulnerability allows remote attackers to disclose sensitive information on affected installations of PDF-XChange Editor. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file. The specific flaw exists within the parsing of J2K files. Crafted data in a J2K file can trigger a read past the end of an allocated buffer. An attacker can leverage this in conjunction with other vulnerabilities to execute arbitrary code in the context of the current process. Was ZDI-CAN-17636."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-125",
        "id": "CVE-2022-37353",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://www.tracker-software.com/product/pdf-xchange-editor/history",
            "https://www.zerodayinitiative.com/advisories/ZDI-22-1081/"
        ],
        "summary": "This vulnerability allows remote attackers to disclose sensitive information on affected installations of PDF-XChange Editor. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file. The specific flaw exists within the parsing of EMF files. Crafted data in an EMF file can trigger a read past the end of an allocated buffer. An attacker can leverage this in conjunction with other vulnerabilities to execute arbitrary code in the context of the current process. Was ZDI-CAN-17637."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-787",
        "id": "CVE-2022-37357",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://www.tracker-software.com/product/pdf-xchange-editor/history",
            "https://www.zerodayinitiative.com/advisories/ZDI-22-1085/"
        ],
        "summary": "This vulnerability allows remote attackers to execute arbitrary code on affected installations of PDF-XChange Editor. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file. The specific flaw exists within the parsing of ICO files. Crafted data in an ICO file can trigger a write past the end of an allocated buffer. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-17631."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-125",
        "id": "CVE-2022-37367",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://www.tracker-software.com/product/pdf-xchange-editor/history",
            "https://www.zerodayinitiative.com/advisories/ZDI-22-1095/"
        ],
        "summary": "This vulnerability allows remote attackers to execute arbitrary code on affected installations of PDF-XChange Editor. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file. The specific flaw exists within the handling of AcroForms. Crafted data in an AcroForm can trigger a read past the end of an allocated buffer. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-17726."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-416",
        "id": "CVE-2022-37374",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://www.tracker-software.com/product/pdf-xchange-editor/history",
            "https://www.zerodayinitiative.com/advisories/ZDI-22-1102/"
        ],
        "summary": "This vulnerability allows remote attackers to execute arbitrary code on affected installations of PDF-XChange Editor. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file. The specific flaw exists within the parsing of PNG files. The issue results from the lack of validating the existence of an object prior to performing operations on the object. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-18068."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-125",
        "id": "CVE-2022-37376",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://www.zerodayinitiative.com/advisories/ZDI-22-1048/",
            "https://www.foxit.com/support/security-bulletins.html"
        ],
        "summary": "This vulnerability allows remote attackers to disclose sensitive information on affected installations of Foxit PDF Editor 11.1.1.53537. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file. The specific flaw exists within the handling of arrays. By performing actions in JavaScript, an attacker can trigger a read past the end of an allocated object. An attacker can leverage this in conjunction with other vulnerabilities to execute arbitrary code in the context of the current process. Was ZDI-CAN-16599."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-125",
        "id": "CVE-2022-37380",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://www.foxit.com/support/security-bulletins.html",
            "https://www.zerodayinitiative.com/advisories/ZDI-22-1052/"
        ],
        "summary": "This vulnerability allows remote attackers to disclose sensitive information on affected installations of Foxit PDF Reader 11.2.1.53537. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file. The specific flaw exists within the handling of ADBC objects. By performing actions in JavaScript, an attacker can trigger a read past the end of an allocated object. An attacker can leverage this in conjunction with other vulnerabilities to execute arbitrary code in the context of the current process. Was ZDI-CAN-17169."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-416",
        "id": "CVE-2022-37382",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://www.zerodayinitiative.com/advisories/ZDI-22-1054/",
            "https://www.foxit.com/support/security-bulletins.html"
        ],
        "summary": "This vulnerability allows remote attackers to disclose sensitive information on affected installations of Foxit PDF Reader 11.2.1.53537. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file. The specific flaw exists within the removeIcon method. The issue results from the lack of validating the existence of an object prior to performing operations on the object. An attacker can leverage this in conjunction with other vulnerabilities to execute arbitrary code in the context of the current process. Was ZDI-CAN-17383."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-125",
        "id": "CVE-2022-37386",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://www.zerodayinitiative.com/advisories/ZDI-22-1058/",
            "https://www.foxit.com/support/security-bulletins.html"
        ],
        "summary": "This vulnerability allows remote attackers to disclose sensitive information on affected installations of Foxit PDF Reader 11.2.2.53575. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file. The specific flaw exists within the resetForm method. By performing actions in JavaScript, an attacker can trigger a read past the end of an allocated object. An attacker can leverage this in conjunction with other vulnerabilities to execute arbitrary code in the context of the current process. Was ZDI-CAN-17550."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-416",
        "id": "CVE-2022-37389",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://www.foxit.com/support/security-bulletins.html",
            "https://www.zerodayinitiative.com/advisories/ZDI-22-1061/"
        ],
        "summary": "This vulnerability allows remote attackers to execute arbitrary code on affected installations of Foxit PDF Reader 11.2.2.53575. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file. The specific flaw exists within the handling of AcroForms. The issue results from the lack of validating the existence of an object prior to performing operations on the object. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-17545."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-78",
        "id": "CVE-2022-3210",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://www.zerodayinitiative.com/advisories/ZDI-22-1222/",
            "https://supportannouncement.us.dlink.com/announcement/publication.aspx?name=SAP10304"
        ],
        "summary": "This vulnerability allows network-adjacent attackers to execute arbitrary commands on affected installations of D-Link DIR-2150 4.0.1 routers. Authentication is not required to exploit this vulnerability. The specific flaw exists within the xupnpd service, which listens on TCP port 4044 by default. The issue results from the lack of proper validation of a user-supplied string before using it to execute a system call. An attacker can leverage this vulnerability to execute code in the context of the service account. Was ZDI-CAN-15905."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-89",
        "id": "CVE-2022-42426",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://www.zerodayinitiative.com/advisories/ZDI-22-1397/"
        ],
        "summary": "This vulnerability allows remote attackers to escalate privileges on affected installations of Centreon. Authentication is required to exploit this vulnerability. The specific flaw exists within the handling of requests to modify poller broker configuration. The issue results from the lack of proper validation of a user-supplied string before using it to construct SQL queries. An attacker can leverage this vulnerability to escalate privileges to the level of an administrator. Was ZDI-CAN-18554."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-457",
        "id": "CVE-2022-42432",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://www.zerodayinitiative.com/advisories/ZDI-22-1457/",
            "https://patchwork.ozlabs.org/project/netfilter-devel/patch/20220907082618.1193201-1-pablo@netfilter.org/"
        ],
        "summary": "This vulnerability allows local attackers to disclose sensitive information on affected installations of the Linux Kernel 6.0-rc2. An attacker must first obtain the ability to execute high-privileged code on the target system in order to exploit this vulnerability. The specific flaw exists within the nft_osf_eval function. The issue results from the lack of proper initialization of memory prior to accessing it. An attacker can leverage this in conjunction with other vulnerabilities to execute arbitrary code in the context of the kernel. Was ZDI-CAN-18540."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-125",
        "id": "CVE-2022-43611",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://www.zerodayinitiative.com/advisories/ZDI-22-1469/"
        ],
        "summary": "This vulnerability allows remote attackers to disclose sensitive information on affected installations of Corel CorelDRAW Graphics Suite 23.5.0.506. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file. The specific flaw exists within the parsing of BMP images. The issue results from the lack of proper validation of user-supplied data, which can result in a read past the end of an allocated object. An attacker can leverage this in conjunction with other vulnerabilities to execute arbitrary code in the context of the current process. Was ZDI-CAN-16351."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-134",
        "id": "CVE-2022-43619",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://supportannouncement.us.dlink.com/announcement/publication.aspx?name=SAP10310",
            "https://www.zerodayinitiative.com/advisories/ZDI-22-1493/"
        ],
        "summary": "This vulnerability allows network-adjacent attackers to execute arbitrary code on affected installations of D-Link DIR-1935 1.03 routers. Although authentication is required to exploit this vulnerability, the existing authentication mechanism can be bypassed. The specific flaw exists within the handling of ConfigFileUpload requests to the web management portal. The issue results from the lack of proper validation of a user-supplied string before using it as a format specifier. An attacker can leverage this vulnerability to execute code in the context of root. Was ZDI-CAN-16141."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-697",
        "id": "CVE-2022-43621",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://www.zerodayinitiative.com/advisories/ZDI-22-1503/",
            "https://supportannouncement.us.dlink.com/announcement/publication.aspx?name=SAP10310"
        ],
        "summary": "This vulnerability allows network-adjacent attackers to bypass authentication on affected installations of D-Link DIR-1935 1.03 routers. Authentication is not required to exploit this vulnerability. The specific flaw exists within the handling of HNAP login requests. The issue results from an incorrectly implemented comparison. An attacker can leverage this vulnerability to bypass authentication on the system. Was ZDI-CAN-16152."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-77",
        "id": "CVE-2022-43623",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://supportannouncement.us.dlink.com/announcement/publication.aspx?name=SAP10310",
            "https://www.zerodayinitiative.com/advisories/ZDI-22-1492/"
        ],
        "summary": "This vulnerability allows network-adjacent attackers to execute arbitrary code on affected installations of D-Link DIR-1935 1.03 routers. Although authentication is required to exploit this vulnerability, the existing authentication mechanism can be bypassed. The specific flaw exists within the handling of SetWebFilterSetting requests to the web management portal. When parsing the WebFilterURLs element, the process does not properly validate a user-supplied string before using it to execute a system call. An attacker can leverage this vulnerability to execute code in the context of root. Was ZDI-CAN-16140."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-121",
        "id": "CVE-2022-43625",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://www.zerodayinitiative.com/advisories/ZDI-22-1495/",
            "https://supportannouncement.us.dlink.com/announcement/publication.aspx?name=SAP10310"
        ],
        "summary": "This vulnerability allows network-adjacent attackers to execute arbitrary code on affected installations of D-Link DIR-1935 1.03 routers. Although authentication is required to exploit this vulnerability, the existing authentication mechanism can be bypassed. The specific flaw exists within the handling of SetStaticRouteIPv4Settings requests to the web management portal. When parsing the NetMask element, the process does not properly validate the length of user-supplied data prior to copying it to a fixed-length stack-based buffer. An attacker can leverage this vulnerability to execute code in the context of root. Was ZDI-CAN-16144."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-78",
        "id": "CVE-2022-43628",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://www.zerodayinitiative.com/advisories/ZDI-22-1499/",
            "https://supportannouncement.us.dlink.com/announcement/publication.aspx?name=SAP10310"
        ],
        "summary": "This vulnerability allows network-adjacent attackers to execute arbitrary code on affected installations of D-Link DIR-1935 1.03 routers. Although authentication is required to exploit this vulnerability, the existing authentication mechanism can be bypassed. The specific flaw exists within the handling of SetIPv6FirewallSettings requests to the web management portal. When parsing subelements within the IPv6FirewallRule element, the process does not properly validate a user-supplied string before using it to execute a system call. An attacker can leverage this vulnerability to execute code in the context of root. Was ZDI-CAN-16148."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-78",
        "id": "CVE-2022-43629",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://www.zerodayinitiative.com/advisories/ZDI-22-1500/",
            "https://supportannouncement.us.dlink.com/announcement/publication.aspx?name=SAP10310"
        ],
        "summary": "This vulnerability allows network-adjacent attackers to execute arbitrary code on affected installations of D-Link DIR-1935 1.03 routers. Although authentication is required to exploit this vulnerability, the existing authentication mechanism can be bypassed. The specific flaw exists within the handling of SetSysEmailSettings requests to the web management portal. When parsing subelements within the SetSysEmailSettings element, the process does not properly validate a user-supplied string before using it to execute a system call. An attacker can leverage this vulnerability to execute code in the context of root. Was ZDI-CAN-16149."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-78",
        "id": "CVE-2022-43626",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://www.zerodayinitiative.com/advisories/ZDI-22-1497/",
            "https://supportannouncement.us.dlink.com/announcement/publication.aspx?name=SAP10310"
        ],
        "summary": "This vulnerability allows network-adjacent attackers to execute arbitrary code on affected installations of D-Link DIR-1935 1.03 routers. Although authentication is required to exploit this vulnerability, the existing authentication mechanism can be bypassed. The specific flaw exists within the handling of SetIPv4FirewallSettings requests to the web management portal. When parsing subelements within the IPv4FirewallRule element, the process does not properly validate a user-supplied string before using it to execute a system call. An attacker can leverage this vulnerability to execute code in the context of root. Was ZDI-CAN-16146."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-78",
        "id": "CVE-2022-43627",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://www.zerodayinitiative.com/advisories/ZDI-22-1498/",
            "https://supportannouncement.us.dlink.com/announcement/publication.aspx?name=SAP10310"
        ],
        "summary": "This vulnerability allows network-adjacent attackers to execute arbitrary code on affected installations of D-Link DIR-1935 1.03 routers. Although authentication is required to exploit this vulnerability, the existing authentication mechanism can be bypassed. The specific flaw exists within the handling of SetStaticRouteIPv4Settings requests to the web management portal. When parsing subelements within the StaticRouteIPv4Data element, the process does not properly validate a user-supplied string before using it to execute a system call. An attacker can leverage this vulnerability to execute code in the context of root. Was ZDI-CAN-16147."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-121",
        "id": "CVE-2022-43630",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://www.zerodayinitiative.com/advisories/ZDI-22-1501/",
            "https://supportannouncement.us.dlink.com/announcement/publication.aspx?name=SAP10310"
        ],
        "summary": "This vulnerability allows network-adjacent attackers to execute arbitrary code on affected installations of D-Link DIR-1935 1.03 routers. Authentication is not required to exploit this vulnerability. The specific flaw exists within the handling of http requests to the web management portal. When parsing the SOAPAction header, the process does not properly validate the length of user-supplied data prior to copying it to a fixed-length stack-based buffer. An attacker can leverage this vulnerability to execute code in the context of root. Was ZDI-CAN-16150."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-303",
        "id": "CVE-2022-43635",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://www.zerodayinitiative.com/advisories/ZDI-22-1615/"
        ],
        "summary": "This vulnerability allows network-adjacent attackers to disclose sensitive information on affected installations of TP-Link TL-WR940N 6_211111 3.20.1(US) routers. Authentication is not required to exploit this vulnerability. The specific flaw exists within the httpd service, which listens on TCP port 80 by default. The issue results from the incorrect implementation of the authentication algorithm. An attacker can leverage this vulnerability to disclose stored credentials, leading to further compromise. Was ZDI-CAN-17332."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-78",
        "id": "CVE-2022-43633",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://www.zerodayinitiative.com/advisories/ZDI-22-1505/",
            "https://supportannouncement.us.dlink.com/announcement/publication.aspx?name=SAP10310"
        ],
        "summary": "This vulnerability allows network-adjacent attackers to execute arbitrary code on affected installations of D-Link DIR-1935 1.03 routers. Although authentication is required to exploit this vulnerability, the existing authentication mechanism can be bypassed. The specific flaw exists within the handling of SetSysLogSettings requests to the web management portal. When parsing the IPAddress element, the process does not properly validate a user-supplied string before using it to execute a system call. An attacker can leverage this vulnerability to execute code in the context of root. Was ZDI-CAN-16154."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-416",
        "id": "CVE-2022-43638",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://www.zerodayinitiative.com/advisories/ZDI-22-1658/",
            "https://www.foxit.com/support/security-bulletins.html"
        ],
        "summary": "This vulnerability allows remote attackers to execute arbitrary code on affected installations of Foxit PDF Reader 12.0.1.12430. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file. The specific flaw exists within the parsing of U3D files. The issue results from the lack of validating the existence of an object prior to performing operations on the object. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-18627."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-120",
        "id": "CVE-2022-27643",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://kb.netgear.com/000064720/Security-Advisory-for-Pre-Authentication-Buffer-Overflow-on-Multiple-Products-PSV-2021-0323",
            "https://www.zerodayinitiative.com/advisories/ZDI-22-519/"
        ],
        "summary": "This vulnerability allows network-adjacent attackers to execute arbitrary code on affected installations of NETGEAR R6700v3 1.0.4.120_10.0.91 routers. Authentication is not required to exploit this vulnerability. The specific flaw exists within the handling of SOAP requests. When parsing the SOAPAction header, the process does not properly validate the length of user-supplied data prior to copying it to a buffer. An attacker can leverage this vulnerability to execute code in the context of root. Was ZDI-CAN-15692."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-190",
        "id": "CVE-2022-27641",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://kb.netgear.com/000064437/Security-Advisory-for-Pre-Authentication-Buffer-Overflow-on-Multiple-Products-PSV-2021-0278",
            "https://www.zerodayinitiative.com/advisories/ZDI-22-544/"
        ],
        "summary": "This vulnerability allows network-adjacent attackers to execute arbitrary code on affected installations of NETGEAR R6700v3 1.0.4.120_10.0.91 routers. Authentication is not required to exploit this vulnerability. The specific flaw exists within the NetUSB module. The issue results from the lack of proper validation of user-supplied data, which can result in an integer overflow before allocating a buffer. An attacker can leverage this vulnerability to execute code in the context of root. Was ZDI-CAN-15806."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-787",
        "id": "CVE-2022-28301",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://www.bentley.com/en/common-vulnerability-exposure/be-2022-0006",
            "https://www.zerodayinitiative.com/advisories/ZDI-22-612/"
        ],
        "summary": "This vulnerability allows remote attackers to execute arbitrary code on affected installations of Bentley MicroStation CONNECT 10.16.02.34. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file. The specific flaw exists within the parsing of IFC files. Crafted data in an IFC file can trigger a write past the end of an allocated buffer. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-16392."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-863",
        "id": "CVE-2022-27642",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://kb.netgear.com/000064723/Security-Advisory-for-Multiple-Vulnerabilities-on-Multiple-Products-PSV-2021-0327",
            "https://www.zerodayinitiative.com/advisories/ZDI-22-518/"
        ],
        "summary": "This vulnerability allows network-adjacent attackers to bypass authentication on affected installations of NETGEAR R6700v3 1.0.4.120_10.0.91 routers. Authentication is not required to exploit this vulnerability. The specific flaw exists within the httpd service. The issue results from incorrect string matching logic when accessing protected pages. An attacker can leverage this in conjunction with other vulnerabilities to execute code in the context of root. Was ZDI-CAN-15854."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-416",
        "id": "CVE-2022-28303",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://www.zerodayinitiative.com/advisories/ZDI-22-596/",
            "https://www.bentley.com/en/common-vulnerability-exposure/be-2022-0009"
        ],
        "summary": "This vulnerability allows remote attackers to execute arbitrary code on affected installations of Bentley View 10.16.02.022. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file. The specific flaw exists within the parsing of SKP files. The issue results from the lack of validating the existence of an object prior to performing operations on the object. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-16280."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-863",
        "id": "CVE-2022-27645",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://www.zerodayinitiative.com/advisories/ZDI-22-522/",
            "https://kb.netgear.com/000064722/Security-Advisory-for-Sensitive-Information-Disclosure-on-Some-Routers-and-Fixed-Wireless-Products-PSV-2021-0325"
        ],
        "summary": "This vulnerability allows network-adjacent attackers to bypass authentication on affected installations of NETGEAR R6700v3 1.0.4.120_10.0.91 routers. Authentication is not required to exploit this vulnerability. The specific flaw exists within readycloud_control.cgi. The issue results from incorrect string matching logic when accessing protected pages. An attacker can leverage this vulnerability to execute code in the context of root. Was ZDI-CAN-15762."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-125",
        "id": "CVE-2022-28312",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://www.zerodayinitiative.com/advisories/ZDI-22-602/",
            "https://www.bentley.com/en/common-vulnerability-exposure/be-2022-0003"
        ],
        "summary": "This vulnerability allows remote attackers to disclose sensitive information on affected installations of Bentley MicroStation CONNECT 10.16.02.034. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file. The specific flaw exists within the parsing of 3DS files. Crafted data in a 3DS file can trigger a read past the end of an allocated buffer. An attacker can leverage this in conjunction with other vulnerabilities to execute arbitrary code in the context of the current process. Was ZDI-CAN-16342."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-78",
        "id": "CVE-2022-27647",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://kb.netgear.com/000064723/Security-Advisory-for-Multiple-Vulnerabilities-on-Multiple-Products-PSV-2021-0327",
            "https://www.zerodayinitiative.com/advisories/ZDI-22-524/"
        ],
        "summary": "This vulnerability allows network-adjacent attackers to execute arbitrary code on affected installations of NETGEAR R6700v3 1.0.4.120_10.0.91 routers. Although authentication is required to exploit this vulnerability, the existing authentication mechanism can be bypassed. The specific flaw exists within the handling of the name or email field provided to libreadycloud.so. The issue results from the lack of proper validation of a user-supplied string before using it to execute a system call. An attacker can leverage this vulnerability to execute code in the context of root. Was ZDI-CAN-15874."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-125",
        "id": "CVE-2022-28313",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://www.zerodayinitiative.com/advisories/ZDI-22-603/",
            "https://www.bentley.com/en/common-vulnerability-exposure/be-2022-0003"
        ],
        "summary": "This vulnerability allows remote attackers to disclose sensitive information on affected installations of Bentley MicroStation CONNECT 10.16.02.034. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file. The specific flaw exists within the parsing of 3DS files. Crafted data in a 3DS file can trigger a read past the end of an allocated buffer. An attacker can leverage this in conjunction with other vulnerabilities to execute arbitrary code in the context of the current process. Was ZDI-CAN-16343."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-787",
        "id": "CVE-2022-28300",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://www.bentley.com/en/common-vulnerability-exposure/be-2022-0007",
            "https://www.zerodayinitiative.com/advisories/ZDI-22-592/"
        ],
        "summary": "This vulnerability allows remote attackers to execute arbitrary code on affected installations of Bentley MicroStation 10.16.02.034 CONNECT. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file. The specific flaw exists within the parsing of JP2 images. Crafted data in a JP2 file can trigger a write past the end of an allocated buffer. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-16202."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-121",
        "id": "CVE-2022-28315",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://www.bentley.com/en/common-vulnerability-exposure/be-2022-0006",
            "https://www.zerodayinitiative.com/advisories/ZDI-22-606/"
        ],
        "summary": "This vulnerability allows remote attackers to execute arbitrary code on affected installations of Bentley MicroStation CONNECT 10.16.02.34. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file. The specific flaw exists within the parsing of IFC files. The issue results from the lack of proper validation of the length of user-supplied data prior to copying it to a fixed-length stack-based buffer. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-16367."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-125",
        "id": "CVE-2022-28302",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://www.bentley.com/en/common-vulnerability-exposure/be-2022-0006",
            "https://www.zerodayinitiative.com/advisories/ZDI-22-614/"
        ],
        "summary": "This vulnerability allows remote attackers to execute arbitrary code on affected installations of Bentley MicroStation CONNECT 10.16.02.34. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file. The specific flaw exists within the parsing of IFC files. Crafted data in an IFC file can trigger a read past the end of an allocated buffer. An attacker can leverage this to execute code in the context of the current process. Was ZDI-CAN-16446."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-457",
        "id": "CVE-2022-28317",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://www.bentley.com/en/common-vulnerability-exposure/be-2022-0006",
            "https://www.zerodayinitiative.com/advisories/ZDI-22-604/"
        ],
        "summary": "This vulnerability allows remote attackers to execute arbitrary code on affected installations of Bentley MicroStation CONNECT 10.16.02.34. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file. The specific flaw exists within the parsing of IFC files. The issue results from the lack of proper initialization of memory prior to accessing it. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-16369."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-121",
        "id": "CVE-2022-28304",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://www.zerodayinitiative.com/advisories/ZDI-22-594/",
            "https://www.bentley.com/en/common-vulnerability-exposure/be-2022-0008"
        ],
        "summary": "This vulnerability allows remote attackers to execute arbitrary code on affected installations of Bentley MicroStation CONNECT 10.16.02.034. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file. The specific flaw exists within the parsing of OBJ files. The issue results from the lack of proper validation of the length of user-supplied data prior to copying it to a fixed-length stack-based buffer. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-16171."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-457",
        "id": "CVE-2022-28319",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://www.bentley.com/en/common-vulnerability-exposure/be-2022-0002",
            "https://www.zerodayinitiative.com/advisories/ZDI-22-591/"
        ],
        "summary": "This vulnerability allows remote attackers to execute arbitrary code on affected installations of Bentley MicroStation CONNECT 10.16.02.034. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file. The specific flaw exists within the parsing of 3DM files. The issue results from the lack of proper initialization of memory prior to accessing it. An attacker can leverage this vulnerability to execute code in the context of the current process. Was ZDI-CAN-16340."
    },
    {
        "Modified": "2023-03-29T19:15:00",
        "Published": "2023-03-29T19:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "CWE-121",
        "id": "CVE-2022-28306",
        "impact": {},
        "last-modified": "2023-03-29T19:15:00",
        "references": [
            "https://www.zerodayinitiative.com/advisories/ZDI-22-595/",
            "https://www.bentley.com/en/common-vulnerability-exposure/be-2022-0008"
        ],
        "summary": "This vulnerability allows remote attackers to execute arbitrary code on affected installations of Bentley MicroStation CONNECT 10.16.02.034. User interaction is required to exploit this vulnerability in that the target must visit a malicious page or open a malicious file. The specific flaw exists within the parsing of OBJ files. The issue results from the lack of proper validation of the length of user-supplied data prior to copying it to a fixed-length stack-based buffer. An attacker can leverage this to execute code in the context of the current process. Was ZDI-CAN-16174."
    }
]