[
    {
        "Modified": "2024-05-24T04:15:00",
        "Published": "2024-05-24T04:15:00",
        "access": {},
        "assigner": "cve-request@wordfence.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-4544",
        "impact": {},
        "last-modified": "2024-05-24T04:15:00",
        "references": [
            "https://www.wordfence.com/threat-intel/vulnerabilities/id/b98179c3-8b32-4d75-9f3f-2367215a740b?source=cve",
            "https://plugins.trac.wordpress.org/browser/pie-register/tags/3.8.3.3/pie-register.php#L2959"
        ],
        "summary": "The Pie Register - Social Sites Login (Add on) plugin for WordPress is vulnerable to authentication bypass in versions up to, and including, 1.7.7. This is due to insufficient verification on the user being supplied during a social login through the plugin. This makes it possible for unauthenticated attackers to log in as any existing user on the site, such as an administrator, if they have access to the email."
    },
    {
        "Modified": "2024-05-24T03:15:00",
        "Published": "2024-05-24T03:15:00",
        "access": {},
        "assigner": "cve-request@wordfence.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-4409",
        "impact": {},
        "last-modified": "2024-05-24T03:15:00",
        "references": [
            "https://www.wordfence.com/threat-intel/vulnerabilities/id/e86581bd-94c3-4b05-9590-ca3b62073703?source=cve",
            "https://plugins.trac.wordpress.org/changeset?sfp_email=&sfph_mail=&reponame=&new=3091230%40wp-vipergb%2Ftrunk&old=2812759%40wp-vipergb%2Ftrunk&sfp_email=&sfph_mail="
        ],
        "summary": "The WP-ViperGB plugin for WordPress is vulnerable to Cross-Site Request Forgery in all versions up to, and including, 1.6.1. This is due to missing or incorrect nonce validation when saving plugin settings. This makes it possible for unauthenticated attackers to change the plugin's settings via a forged request granted they can trick a site administrator into performing an action such as clicking on a link."
    },
    {
        "Modified": "2024-05-24T03:15:00",
        "Published": "2024-05-24T03:15:00",
        "access": {},
        "assigner": "cve-request@wordfence.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-5205",
        "impact": {},
        "last-modified": "2024-05-24T03:15:00",
        "references": [
            "https://www.wordfence.com/threat-intel/vulnerabilities/id/4ffd76a2-6700-4c2a-858d-4c7339a8d09a?source=cve",
            "https://plugins.trac.wordpress.org/browser/videojs-html5-player/trunk/videojs-html5-player.php#L258",
            "https://plugins.trac.wordpress.org/changeset/3091226/#file1",
            "https://wordpress.org/plugins/videojs-html5-player/#developers"
        ],
        "summary": "The Videojs HTML5 Player plugin for WordPress is vulnerable to Stored Cross-Site Scripting via the plugin's videojs_video shortcode in all versions up to, and including, 1.1.11 due to insufficient input sanitization and output escaping on user supplied attributes. This makes it possible for authenticated attackers, with contributor-level access and above, to inject arbitrary web scripts in pages that will execute whenever a user accesses an injected page."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T22:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-5242",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://www.zerodayinitiative.com/advisories/ZDI-24-501/"
        ],
        "summary": "TP-Link Omada ER605 Stack-based Buffer Overflow Remote Code Execution Vulnerability. This vulnerability allows network-adjacent attackers to execute arbitrary code on affected installations of TP-Link Omada ER605 routers. Authentication is not required to exploit this vulnerability. However, devices are vulnerable only if configured to use the Comexe DDNS service.\n\nThe specific flaw exists within the handling of DDNS error codes. The issue results from the lack of proper validation of the length of user-supplied data prior to copying it to a fixed-length stack-based buffer. An attacker can leverage this vulnerability to execute code in the context of root. Was ZDI-CAN-22522."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T22:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-5244",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://www.zerodayinitiative.com/advisories/ZDI-24-503/"
        ],
        "summary": "TP-Link Omada ER605 Reliance on Security Through Obscurity Vulnerability. This vulnerability allows network-adjacent attackers to access or spoof DDNS messages on affected installations of TP-Link Omada ER605 routers. Authentication is not required to exploit this vulnerability. However, devices are vulnerable only if configured to use the Comexe DDNS service.\n\nThe specific flaw exists within the cmxddnsd executable. The issue results from reliance on obscurity to secure network data. An attacker can leverage this in conjunction with other vulnerabilities to execute arbitrary code in the context of root. Was ZDI-CAN-22439."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T22:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-5246",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://www.zerodayinitiative.com/advisories/ZDI-24-497/",
            "https://kb.netgear.com/000066164/Security-Advisory-for-Multiple-Vulnerabilities-on-the-NMS300-PSV-2024-0003-PSV-2024-0004"
        ],
        "summary": "NETGEAR ProSAFE Network Management System Tomcat Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of NETGEAR ProSAFE Network Management System. Authentication is required to exploit this vulnerability.\n\nThe specific flaw exists within the product installer. The issue results from the use of a vulnerable version of Apache Tomcat. An attacker can leverage this vulnerability to execute code in the context of SYSTEM. Was ZDI-CAN-22868."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T22:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-5247",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://www.zerodayinitiative.com/advisories/ZDI-24-498/",
            "https://kb.netgear.com/000066165/Security-Advisory-for-Missing-Function-Level-Access-Control-on-the-NMS300-PSV-2024-0005"
        ],
        "summary": "NETGEAR ProSAFE Network Management System UpLoadServlet Unrestricted File Upload Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of NETGEAR ProSAFE Network Management System. Authentication is required to exploit this vulnerability.\n\nThe specific flaw exists within the UpLoadServlet class. The issue results from the lack of proper validation of user-supplied data, which can allow the upload of arbitrary files. An attacker can leverage this vulnerability to execute code in the context of SYSTEM. Was ZDI-CAN-22923."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T22:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-5291",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://www.zerodayinitiative.com/advisories/ZDI-24-442/"
        ],
        "summary": "D-Link DIR-2150 GetDeviceSettings Target Command Injection Remote Code Execution Vulnerability. This vulnerability allows network-adjacent attackers to execute arbitrary code on affected installations of D-Link DIR-2150 routers. Authentication is not required to exploit this vulnerability.\n\nThe specific flaw exists within the SOAP API interface, which listens on TCP port 80 by default. The issue results from the lack of proper validation of a user-supplied string before using it to execute a system call. An attacker can leverage this vulnerability to execute code in the context of root. Was ZDI-CAN-21235."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T22:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-5292",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://www.zerodayinitiative.com/advisories/ZDI-24-443/"
        ],
        "summary": "D-Link Network Assistant Uncontrolled Search Path Element Local Privilege Escalation Vulnerability. This vulnerability allows local attackers to escalate privileges on affected installations of D-Link Network Assistant. An attacker must first obtain the ability to execute low-privileged code on the target system in order to exploit this vulnerability.\n\nThe specific flaw exists within the DNACore service. The service loads a file from an unsecured location. An attacker can leverage this vulnerability to escalate privileges and execute arbitrary code in the context of SYSTEM. Was ZDI-CAN-21426."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T22:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-5293",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://www.zerodayinitiative.com/advisories/ZDI-24-444/"
        ],
        "summary": "D-Link DIR-2640 HTTP Referer Stack-Based Buffer Overflow Remote Code Execution Vulnerability. This vulnerability allows network-adjacent attackers to execute arbitrary code on affected installations of D-Link DIR-2640-US routers. Authentication is not required to exploit this vulnerability.\n\nThe specific flaw exists within prog.cgi, which handles HNAP requests made to the lighttpd webserver listening on TCP ports 80 and 443. The issue results from the lack of proper validation of the length of user-supplied data prior to copying it to a fixed-length stack-based buffer. An attacker can leverage this vulnerability to execute code in the context of root. Was ZDI-CAN-21853."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T22:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-5294",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://www.zerodayinitiative.com/advisories/ZDI-24-445/"
        ],
        "summary": "D-Link DIR-3040 prog.cgi websSecurityHandler Memory Leak Denial-of-Service Vulnerability. This vulnerability allows network-adjacent attackers to create a denial-of-service condition on affected installations of D-Link DIR-3040 routers. Authentication is not required to exploit this vulnerability.\n\nThe specific flaw exists within the prog.cgi program, which handles HNAP requests made to the lighttpd webserver listening on ports 80 and 443. The issue results from the lack of proper memory management when processing HTTP cookie values. An attacker can leverage this vulnerability to create a denial-of-service condition on the system.\n. Was ZDI-CAN-21668."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T22:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-5295",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://www.zerodayinitiative.com/advisories/ZDI-24-446/"
        ],
        "summary": "D-Link G416 flupl self Command Injection Remote Code Execution Vulnerability. This vulnerability allows network-adjacent attackers to execute arbitrary code on affected installations of D-Link G416 wireless routers. Authentication is not required to exploit this vulnerability.\n\nThe specific flaw exists within the HTTP service listening on TCP port 80. The issue results from the lack of proper validation of a user-supplied string before using it to execute a system call. An attacker can leverage this vulnerability to execute code in the context of root. Was ZDI-CAN-21294."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T22:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-5296",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://www.zerodayinitiative.com/advisories/ZDI-24-447/"
        ],
        "summary": "D-Link D-View Use of Hard-coded Cryptographic Key Authentication Bypass Vulnerability. This vulnerability allows remote attackers to bypass authentication on affected installations of D-Link D-View. Authentication is not required to exploit this vulnerability.\n\nThe specific flaw exists within the TokenUtils class. The issue results from a hard-coded cryptographic key. An attacker can leverage this vulnerability to bypass authentication on the system. Was ZDI-CAN-21991."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T22:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-5297",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://www.zerodayinitiative.com/advisories/ZDI-24-448/"
        ],
        "summary": "D-Link D-View executeWmicCmd Command Injection Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of D-Link D-View. Although authentication is required to exploit this vulnerability, the existing authentication mechanism can be bypassed.\n\nThe specific flaw exists within the executeWmicCmd method. The issue results from the lack of proper validation of a user-supplied string before using it to execute a system call. An attacker can leverage this vulnerability to execute code in the context of root. Was ZDI-CAN-21821."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T22:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-5298",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://www.zerodayinitiative.com/advisories/ZDI-24-449/"
        ],
        "summary": "D-Link D-View queryDeviceCustomMonitorResult Exposed Dangerous Method Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of D-Link D-View. Although authentication is required to exploit this vulnerability, the existing authentication mechanism can be bypassed.\n\nThe specific flaw exists within the queryDeviceCustomMonitorResult method. The issue results from an exposed dangerous method. An attacker can leverage this vulnerability to execute code in the context of root. Was ZDI-CAN-21842."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T22:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-5299",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://www.zerodayinitiative.com/advisories/ZDI-24-450/"
        ],
        "summary": "D-Link D-View execMonitorScript Exposed Dangerous Method Remote Code Execution Vulnerability. This vulnerability allows remote attackers to execute arbitrary code on affected installations of D-Link D-View. Although authentication is required to exploit this vulnerability, the existing authentication mechanism can be bypassed.\n\nThe specific flaw exists within the execMonitorScript method. The issue results from an exposed dangerous method. An attacker can leverage this vulnerability to execute code in the context of root. Was ZDI-CAN-21828."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T23:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-79",
        "id": "CVE-2024-5279",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://vuldb.com/?id.266083",
            "https://vuldb.com/?ctiid.266083",
            "https://gitee.com/qiwen-cloud/qiwen-file/issues/I8W3H2"
        ],
        "summary": "A vulnerability was found in Qiwen Netdisk up to 1.4.0. It has been declared as problematic. Affected by this vulnerability is an unknown functionality of the component File Rename Handler. The manipulation with the input <img src=\"\" onerror=\"alert(document.cookie)\"> leads to cross site scripting. The attack can be launched remotely. The exploit has been disclosed to the public and may be used. The associated identifier of this vulnerability is VDB-266083."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T22:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-5227",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://www.zerodayinitiative.com/advisories/ZDI-24-499/"
        ],
        "summary": "TP-Link Omada ER605 PPTP VPN username Command Injection Remote Code Execution Vulnerability. This vulnerability allows network-adjacent attackers to execute arbitrary code on affected installations of TP-Link Omada ER605 routers. Authentication is not required to exploit this vulnerability. However, devices are only vulnerable if configured to use a PPTP VPN with LDAP authentication.\n\nThe specific flaw exists within the handling of the username parameter provided to the /usr/bin/pppd endpoint. The issue results from the lack of proper validation of a user-supplied string before using it to execute a system call. An attacker can leverage this vulnerability to execute code in the context of root. Was ZDI-CAN-22446."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T22:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-5228",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://www.zerodayinitiative.com/advisories/ZDI-24-500/"
        ],
        "summary": "TP-Link Omada ER605  Comexe DDNS Response Handling Heap-based Buffer Overflow Remote Code Execution Vulnerability. This vulnerability allows network-adjacent attackers to execute arbitrary code on affected installations of TP-Link Omada ER605 routers. Authentication is not required to exploit this vulnerability. However, devices are vulnerable only if configured to use the Comexe DDNS service.\n\nThe specific flaw exists within the handling of DNS responses. The issue results from the lack of proper validation of the length of user-supplied data prior to copying it to a fixed-length heap-based buffer. An attacker can leverage this vulnerability to execute code in the context of root. Was ZDI-CAN-22383."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T22:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-5243",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://www.zerodayinitiative.com/advisories/ZDI-24-502/"
        ],
        "summary": "TP-Link Omada ER605 Buffer Overflow Remote Code Execution Vulnerability. This vulnerability allows network-adjacent attackers to execute arbitrary code on affected installations of TP-Link Omada ER605 routers. Authentication is not required to exploit this vulnerability. However, devices are vulnerable only if configured to use the Comexe DDNS service.\n\nThe specific flaw exists within the handling of DNS names. The issue results from the lack of proper validation of the length of user-supplied data prior to copying it to a buffer. An attacker can leverage this vulnerability to execute code in the context of root. Was ZDI-CAN-22523."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T22:15:00",
        "access": {},
        "assigner": "zdi-disclosures@trendmicro.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-5245",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://www.zerodayinitiative.com/advisories/ZDI-24-496/",
            "https://kb.netgear.com/000066164/Security-Advisory-for-Multiple-Vulnerabilities-on-the-NMS300-PSV-2024-0003-PSV-2024-0004"
        ],
        "summary": "NETGEAR ProSAFE Network Management System Default Credentials Local Privilege Escalation Vulnerability. This vulnerability allows local attackers to escalate privileges on affected installations of NETGEAR ProSAFE Network Management System. An attacker must first obtain the ability to execute low-privileged code on the target system in order to exploit this vulnerability.\n\nThe specific flaw exists within the product installer. The issue results from the use of default MySQL credentials. An attacker can leverage this vulnerability to escalate privileges and execute arbitrary code in the context of SYSTEM. Was ZDI-CAN-22755."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T20:15:00",
        "access": {},
        "assigner": "security@opentext.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-5201",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://portal.microfocus.com/s/article/KM000029985"
        ],
        "summary": "Privilege Escalation in OpenText Dimensions RM allows an authenticated user to escalate there privilege to the privilege of another user via HTTP Request"
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T20:15:00",
        "access": {},
        "assigner": "security@opentext.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-5202",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://portal.microfocus.com/s/article/KM000029988"
        ],
        "summary": "Arbitrary File Read in OpenText Dimensions RM allows authenticated users to read files stored on the server via webservices"
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T19:16:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-31843",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://www.gruppotim.it/it/footer/red-team.html"
        ],
        "summary": "An issue was discovered in Italtel Embrace 1.6.4. The Web application does not properly check the parameters sent as input before they are processed on the server side. This allows authenticated users to execute commands on the Operating System."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T19:16:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-35079",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://www.inxedu.com/",
            "https://github.com/cxcxcxcxcxcxcxc/cxcxcxcxcxcxcxc/blob/main/cxcxcxcxcxc/about-2024/35079.txt"
        ],
        "summary": "An arbitrary file upload vulnerability in the uploadAudio method of inxedu v2024.4 allows attackers to execute arbitrary code via uploading a crafted .jsp file."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T19:16:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-35080",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://www.inxedu.com/",
            "https://github.com/cxcxcxcxcxcxcxc/cxcxcxcxcxcxcxc/blob/main/cxcxcxcxcxc/about-2024/35080.txt"
        ],
        "summary": "An arbitrary file upload vulnerability in the gok4 method of inxedu v2024.4 allows attackers to execute arbitrary code via uploading a crafted .jsp file."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T19:16:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-35375",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "http://shtaoism.com/",
            "https://gist.github.com/Tsq741/a16015209fa8728d505c4f82b4f518cd"
        ],
        "summary": "There is an arbitrary file upload vulnerability on the media add .php page in the backend of the website in version 5.7.114 of DedeCMS"
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T19:16:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-35570",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://github.com/KakeruJ/CVE/"
        ],
        "summary": "An arbitrary file upload vulnerability in the component \\controller\\ImageUploadController.class of inxedu v2.0.6 allows attackers to execute arbitrary code via uploading a crafted jsp file."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T17:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-35081",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "http://www.luckyframe.cn/",
            "https://github.com/cxcxcxcxcxcxcxc/cxcxcxcxcxcxcxc/blob/main/cxcxcxcxcxc/about-2024/35081.txt"
        ],
        "summary": "LuckyFrameWeb v3.5.2 was discovered to contain an arbitrary file deletion vulnerability via the fileName parameter in the fileDownload method."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T17:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-35086",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://www.j2eefast.com/",
            "https://github.com/cxcxcxcxcxcxcxc/cxcxcxcxcxcxcxc/blob/main/cxcxcxcxcxc/about-2024/35086.txt"
        ],
        "summary": "J2EEFAST v2.7.0 was discovered to contain a SQL injection vulnerability via the findPage function in BpmTaskFromMapper.xml ."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T17:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-35091",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://www.j2eefast.com/",
            "https://github.com/cxcxcxcxcxcxcxc/cxcxcxcxcxcxcxc/blob/main/cxcxcxcxcxc/about-2024/35091.txt"
        ],
        "summary": "J2EEFAST v2.7.0 was discovered to contain a SQL injection vulnerability via the findPage function in SysTenantMapper.xml."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T17:15:00",
        "access": {},
        "assigner": "cve-request@wordfence.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-4365",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://www.wordfence.com/threat-intel/vulnerabilities/id/21990e54-c3a2-4bca-b164-132ad456e651?source=cve",
            "https://plugins.trac.wordpress.org/browser/advanced-iframe/trunk/includes/advanced-iframe-main-after-iframe.php#L30",
            "https://plugins.trac.wordpress.org/changeset/3090438/"
        ],
        "summary": "The Advanced iFrame plugin for WordPress is vulnerable to Stored Cross-Site Scripting via the ‘add_iframe_url_as_param_direct’ parameter in versions up to, and including, 2024.3 due to insufficient input sanitization and output escaping. This makes it possible for authenticated attackers, with contributor-level permissions and above, to inject arbitrary web scripts in pages that will execute whenever a user accesses an injected page."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T17:15:00",
        "access": {},
        "assigner": "hp-security-alert@hp.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-5143",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://support.hp.com/us-en/document/ish_10643804-10643841-16/HPSBPI03941"
        ],
        "summary": "A user with device administrative privileges can change existing SMTP server settings on the device, without having to re-enter SMTP server credentials.  By redirecting send-to-email traffic to the new server, the original SMTP server credentials may potentially be exposed."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T17:15:00",
        "access": {},
        "assigner": "hp-security-alert@hp.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-2301",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://support.hp.com/us-en/document/ish_10617756-10617781-16/hpsbpi03940"
        ],
        "summary": "Certain HP LaserJet Pro devices are potentially vulnerable to a Cross-Site Scripting (XSS) attack via the web management interface of the device. "
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T17:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-34932",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://github.com/E1CHO/cve_hub/blob/main/Complete%20Web-Based%20School%20Management%20System/Complete%20Web-Based%20School%20Management%20System%20-%20vuln%2022.pdf"
        ],
        "summary": "A SQL injection vulnerability in /model/update_exam.php in Campcodes Complete Web-Based School Management System 1.0 allows an attacker to execute arbitrary SQL commands via the name parameter."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T17:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-34927",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://github.com/E1CHO/cve_hub/blob/main/Complete%20Web-Based%20School%20Management%20System/Complete%20Web-Based%20School%20Management%20System%20-%20vuln%2021.pdf"
        ],
        "summary": "A SQL injection vulnerability in /model/update_classroom.php in Campcodes Complete Web-Based School Management System 1.0 allows an attacker to execute arbitrary SQL commands via the name parameter."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T17:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-34928",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://github.com/E1CHO/cve_hub/blob/main/Complete%20Web-Based%20School%20Management%20System/Complete%20Web-Based%20School%20Management%20System%20-%20vuln%2025.pdf"
        ],
        "summary": "A SQL injection vulnerability in /model/update_subject_routing.php in Campcodes Complete Web-Based School Management System 1.0 allows an attacker to execute arbitrary SQL commands via the grade parameter."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T17:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-34929",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://github.com/E1CHO/cve_hub/blob/main/Complete%20Web-Based%20School%20Management%20System/Complete%20Web-Based%20School%20Management%20System%20-%20vuln%2030.pdf"
        ],
        "summary": "A SQL injection vulnerability in /view/find_friends.php in Campcodes Complete Web-Based School Management System 1.0 allows an attacker to execute arbitrary SQL commands via the my_index parameter."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T17:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-34930",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://github.com/E1CHO/cve_hub/blob/main/Complete%20Web-Based%20School%20Management%20System/Complete%20Web-Based%20School%20Management%20System%20-%20vuln%2026.pdf"
        ],
        "summary": "A SQL injection vulnerability in /model/all_events1.php in Campcodes Complete Web-Based School Management System 1.0 allows attacker to execute arbitrary SQL commands via the month parameter."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T17:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-34931",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://github.com/E1CHO/cve_hub/blob/main/Complete%20Web-Based%20School%20Management%20System/Complete%20Web-Based%20School%20Management%20System%20-%20vuln%2024.pdf"
        ],
        "summary": "A SQL injection vulnerability in /model/update_subject.php in Campcodes Complete Web-Based School Management System 1.0 allows an attacker to execute arbitrary SQL commands via the name parameter."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T17:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-34933",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://github.com/E1CHO/cve_hub/blob/main/Complete%20Web-Based%20School%20Management%20System/Complete%20Web-Based%20School%20Management%20System%20-%20vuln%2023.pdf"
        ],
        "summary": "A SQL injection vulnerability in /model/update_grade.php in Campcodes Complete Web-Based School Management System 1.0 allows an attacker to execute arbitrary SQL commands via the admission_fee parameter."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T17:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-34934",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://github.com/E1CHO/cve_hub/blob/main/Complete%20Web-Based%20School%20Management%20System/Complete%20Web-Based%20School%20Management%20System%20-%20vuln%2028.pdf"
        ],
        "summary": "A SQL injection vulnerability in /view/emarks_range_grade_update_form.php in Campcodes Complete Web-Based School Management System 1.0 allows an attacker to execute arbitrary SQL commands via the conversation_id parameter."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T17:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-34935",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://github.com/E1CHO/cve_hub/blob/main/Complete%20Web-Based%20School%20Management%20System/Complete%20Web-Based%20School%20Management%20System%20-%20vuln%2027.pdf"
        ],
        "summary": "A SQL injection vulnerability in /view/conversation_history_admin.php in Campcodes Complete Web-Based School Management System 1.0 allows an attacker to execute arbitrary SQL commands via the conversation_id parameter."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T17:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-34936",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://github.com/E1CHO/cve_hub/blob/main/Complete%20Web-Based%20School%20Management%20System/Complete%20Web-Based%20School%20Management%20System%20-%20vuln%2029.pdf"
        ],
        "summary": "A SQL injection vulnerability in /view/event1.php in Campcodes Complete Web-Based School Management System 1.0 allows an attacker to execute arbitrary SQL commands via the month parameter."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T17:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-35082",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://www.j2eefast.com/",
            "https://github.com/cxcxcxcxcxcxcxc/cxcxcxcxcxcxcxc/blob/main/cxcxcxcxcxc/about-2024/35082.txt"
        ],
        "summary": "J2EEFAST v2.7.0 was discovered to contain a SQL injection vulnerability via the findPage function in SysOperLogMapper.xml."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T17:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-35083",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://www.j2eefast.com/",
            "https://github.com/cxcxcxcxcxcxcxc/cxcxcxcxcxcxcxc/blob/main/cxcxcxcxcxc/about-2024/35083.txt"
        ],
        "summary": "J2EEFAST v2.7.0 was discovered to contain a SQL injection vulnerability via the findPage function in SysLoginInfoMapper.xml."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T17:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-35084",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://www.j2eefast.com/",
            "https://github.com/cxcxcxcxcxcxcxc/cxcxcxcxcxcxcxc/blob/main/cxcxcxcxcxc/about-2024/35084.txt"
        ],
        "summary": "J2EEFAST v2.7.0 was discovered to contain a SQL injection vulnerability via the findPage function in SysMsgPushMapper.xml."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T17:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-35085",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://www.j2eefast.com/",
            "https://github.com/cxcxcxcxcxcxcxc/cxcxcxcxcxcxcxc/blob/main/cxcxcxcxcxc/about-2024/35085.txt"
        ],
        "summary": "J2EEFAST v2.7.0 was discovered to contain a SQL injection vulnerability via the findPage function in ProcessDefinitionMapper.xml."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T17:15:00",
        "access": {},
        "assigner": "cve@mitre.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-35090",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://www.j2eefast.com/",
            "https://github.com/cxcxcxcxcxcxcxc/cxcxcxcxcxcxcxc/blob/main/cxcxcxcxcxc/about-2024/35090.txt"
        ],
        "summary": "J2EEFAST v2.7.0 was discovered to contain a SQL injection vulnerability via the findPage function in SysUreportFileMapper.xml."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T14:15:00",
        "access": {},
        "assigner": "security-advisories@github.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-35222",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://github.com/tauri-apps/tauri/security/advisories/GHSA-57fm-592m-34r7",
            "https://github.com/tauri-apps/tauri/issues/8316"
        ],
        "summary": "Tauri is a framework for building binaries for all major desktop platforms. Remote origin iFrames in Tauri applications can access the Tauri IPC endpoints without being explicitly allowed in the `dangerousRemoteDomainIpcAccess` in v1 and in the `capabilities` in v2. Valid commands with potentially unwanted consequences (\"delete project\", \"transfer credits\", etc.) could be invoked by an attacker that controls the content of an iframe running inside a Tauri app. This vulnerability has been patched in versions 1.6.7 and 2.0.0-beta.19."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T15:15:00",
        "access": {},
        "assigner": "cve-request@wordfence.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-5084",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://www.wordfence.com/threat-intel/vulnerabilities/id/eef9e2fa-d8f0-42bf-95ac-ee4cafff0b14?source=cve",
            "https://plugins.trac.wordpress.org/browser/hash-form/trunk/admin/classes/HashFormBuilder.php#L764",
            "https://plugins.trac.wordpress.org/changeset/3090341/"
        ],
        "summary": "The Hash Form – Drag & Drop Form Builder plugin for WordPress is vulnerable to arbitrary file uploads due to missing file type validation in the 'file_upload_action' function in all versions up to, and including, 1.1.0. This makes it possible for unauthenticated attackers to upload arbitrary files on the affected site's server which may make remote code execution possible."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T15:15:00",
        "access": {},
        "assigner": "cve-request@wordfence.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-5085",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://www.wordfence.com/threat-intel/vulnerabilities/id/0166a2b2-24e2-4dd6-8842-d3e8dd7bb0dc?source=cve",
            "https://plugins.trac.wordpress.org/browser/hash-form/trunk/admin/classes/HashFormEntry.php#L353",
            "https://plugins.trac.wordpress.org/changeset/3090341/"
        ],
        "summary": "The Hash Form – Drag & Drop Form Builder plugin for WordPress is vulnerable to PHP Object Injection in all versions up to, and including, 1.1.0 via deserialization of untrusted input in the 'process_entry' function. This makes it possible for unauthenticated attackers to inject a PHP Object. No known POP chain is present in the vulnerable software. If a POP chain is present via an additional plugin or theme installed on the target system, it could allow the attacker to delete arbitrary files, retrieve sensitive data, or execute code."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T12:15:00",
        "access": {},
        "assigner": "security-advisories@github.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-26139",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://github.com/OpenCTI-Platform/opencti/security/advisories/GHSA-qx4j-f4f2-vjw9"
        ],
        "summary": "OpenCTI is an open source platform allowing organizations to manage their cyber threat intelligence knowledge and observables. Due to lack of certain security controls on the profile edit functionality, an authenticated attacker with low privileges can gain administrative privileges on the web application. "
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T12:15:00",
        "access": {},
        "assigner": "security-advisories@github.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-28188",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://github.com/jupyter-server/jupyter-scheduler/security/advisories/GHSA-v9g2-g7j4-4jxc",
            "https://github.com/jupyter-server/jupyter_server/pull/1392"
        ],
        "summary": "Jupyter Scheduler is collection of extensions for programming jobs to run now or run on a schedule. The list of conda environments of `jupyter-scheduler` users maybe be exposed, potentially revealing information about projects that a specific user may be working on. This vulnerability has been patched in version(s) 1.1.6, 1.2.1, 1.8.2 and 2.5.2."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T12:15:00",
        "access": {},
        "assigner": "security-advisories@github.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-34060",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://github.com/dfir-iris/iris-evtx-module/security/advisories/GHSA-9rw6-5q9j-82fm",
            "https://github.com/dfir-iris/iris-evtx-module/commit/4e45fc94a31e1ee4641d608a387dfd9f9e68dbca"
        ],
        "summary": "IrisEVTXModule is an interface module for Evtx2Splunk and Iris in order to ingest Microsoft EVTX log files. The `iris-evtx-module` is a pipeline plugin of `iris-web` that processes EVTX files through IRIS web application. During the upload of an EVTX through this pipeline, the filename is not safely handled and may cause an Arbitrary File Write. This can lead to a remote code execution (RCE) when combined with a Server Side Template Injection (SSTI). This vulnerability has been patched in version 1.0.0."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T13:15:00",
        "access": {},
        "assigner": "cve-request@wordfence.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-1803",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://www.wordfence.com/threat-intel/vulnerabilities/id/175e08ce-aec2-427a-90e0-f955711d58b2?source=cve",
            "https://plugins.trac.wordpress.org/changeset/3055856"
        ],
        "summary": "The EmbedPress – Embed PDF, Google Docs, Vimeo, Wistia, Embed YouTube Videos, Audios, Maps & Embed Any Documents in Gutenberg & Elementor plugin for WordPress is vulnerable to unauthorized access of functionality due to insufficient authorization validation on the PDF embed block in all versions up to, and including, 3.9.12. This makes it possible for authenticated attackers, with contributor-level access and above, to embed PDF blocks."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T13:15:00",
        "access": {},
        "assigner": "security-advisories@github.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-35197",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://github.com/Byron/gitoxide/security/advisories/GHSA-49jc-r788-3fc9"
        ],
        "summary": "gitoxide is a pure Rust implementation of Git. On Windows, fetching refs that clash with legacy device names reads from the devices, and checking out paths that clash with such names writes arbitrary data to the devices. This allows a repository, when cloned, to cause indefinite blocking or the production of arbitrary message that appear to have come from the application, and potentially other harmful effects under limited circumstances. If Windows is not used, or untrusted repositories are not cloned or otherwise used, then there is no impact. A minor degradation in availability may also be possible, such as with a very large file named `CON`, though the user could interrupt the application."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T13:15:00",
        "access": {},
        "assigner": "security-advisories@github.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-35224",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://github.com/opf/openproject/security/advisories/GHSA-h26c-j8wg-frjc",
            "https://community.openproject.org/projects/openproject/work_packages/55198/relations"
        ],
        "summary": "OpenProject is the leading open source project management software. OpenProject utilizes `tablesorter` inside of the Cost Report feature. This dependency, when misconfigured, can lead to Stored XSS via `{icon}` substitution in table header values. This attack requires the permissions \"Edit work packages\" as well as \"Add attachments\". A project admin could attempt to escalate their privileges by sending this XSS to a System Admin. Otherwise, if a full System Admin is required, then this attack is significantly less impactful. By utilizing a ticket's attachment, you can store javascript in the application itself and bypass the application's CSP policy to achieve Stored XSS. This vulnerability has been patched in version(s) 14.1.0, 14.0.2 and 13.4.2.\n"
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T13:15:00",
        "access": {},
        "assigner": "cve-request@wordfence.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-4471",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://www.wordfence.com/threat-intel/vulnerabilities/id/5c517278-9d2a-4ef6-bf0e-a62f6b00dd20?source=cve",
            "https://plugins.trac.wordpress.org/browser/xpro-elementor-addons/trunk/libs/demo-export/classes/class-demo-export-admin.php#L86",
            "https://plugins.trac.wordpress.org/changeset/3090127/"
        ],
        "summary": "The 140+ Widgets | Best Addons For Elementor – FREE for WordPress is vulnerable to PHP Object Injection in versions up to, and including, 1.4.3.1 via deserialization of untrusted input in the 'export_content' function. This allows authenticated attackers, with contributor-level permissions and above, to inject a PHP Object. No POP chain is present in the vulnerable plugin. If a POP chain is present via an additional plugin or theme installed on the target system, it could allow the attacker to delete arbitrary files, retrieve sensitive data, or execute code.\r\nThanks,\r\nFrancesco"
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T13:15:00",
        "access": {},
        "assigner": "cve-coordination@incibe.es",
        "cvss": null,
        "cwe": "CWE-284",
        "id": "CVE-2024-5168",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://www.incibe.es/en/incibe-cert/notices/aviso/improper-access-control-vulnerability-prodys-quantum-audio-codec"
        ],
        "summary": "Improper access control vulnerability in Prodys' Quantum Audio codec affecting versions 2.3.4t and below. This vulnerability could allow an unauthenticated user to bypass authentication entirely and execute arbitrary API requests against the web application."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T10:15:00",
        "access": {},
        "assigner": "cve-request@wordfence.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-2861",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://www.wordfence.com/threat-intel/vulnerabilities/id/487731cd-da5a-45b6-8f39-4ae6420dd252?source=cve",
            "https://plugins.trac.wordpress.org/changeset/3090831/wp-user-avatar"
        ],
        "summary": "The ProfilePress plugin for WordPress is vulnerable to Stored Cross-Site Scripting via the ProfilePress User Panel widget in all versions up to, and including, 4.15.8 due to insufficient input sanitization and output escaping on user supplied attributes. This makes it possible for authenticated attackers, with contributor-level access and above, to inject arbitrary web scripts in pages that will execute whenever a user accesses an injected page."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T10:15:00",
        "access": {},
        "assigner": "cve-request@wordfence.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-4779",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://www.wordfence.com/threat-intel/vulnerabilities/id/b155f8ca-9d09-47d7-a7c2-7744df029c19?source=cve",
            "https://plugins.trac.wordpress.org/changeset/3090199/unlimited-elements-for-elementor/trunk/provider/functions_wordpress.class.php"
        ],
        "summary": "The Unlimited Elements For Elementor (Free Widgets, Addons, Templates) plugin for WordPress is vulnerable to SQL Injection via the ‘data[post_ids][0]’ parameter in all versions up to, and including, 1.5.107 due to insufficient escaping on the user supplied parameter and lack of sufficient preparation on the existing SQL query.  This makes it possible for authenticated attackers, with contributor-level access and above, to append additional SQL queries into already existing queries that can be used to extract sensitive information from the database."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T10:15:00",
        "access": {},
        "assigner": "security@eclipse.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-5165",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://gitlab.eclipse.org/security/cve-assignement/-/issues/23",
            "https://gitlab.eclipse.org/security/vulnerability-reports/-/issues/211",
            "https://gitlab.eclipse.org/security/vulnerability-reports/-/issues/210",
            "https://gitlab.eclipse.org/security/vulnerability-reports/-/issues/209",
            "https://gitlab.eclipse.org/security/vulnerability-reports/-/issues/207",
            "https://gitlab.eclipse.org/security/vulnerability-reports/-/issues/204",
            "https://gitlab.eclipse.org/security/vulnerability-reports/-/issues/202",
            "https://gitlab.eclipse.org/security/vulnerability-reports/-/issues/201"
        ],
        "summary": "In Eclipse Ditto versions 3.0.0 to 3.5.5, the user input of several input fields of the Eclipse  Ditto Explorer User Interface https://eclipse.dev/ditto/user-interface.html  was not properly neutralized and thus vulnerable to both Reflected and Stored XSS (Cross Site Scripting).\n\n\n\n\n\nSeveral inputs were not persisted at the backend of Eclipse Ditto, but only in local browser storage to save settings of \"environments\" of the UI and e.g. the last performed \"search queries\", resulting in a \"Reflected XSS\" vulnerability.\n\n\n\n\nHowever, several other inputs were persisted at the backend of Eclipse Ditto, leading to a \"Stored XSS\" vulnerability. Those mean that authenticated and authorized users at Eclipse Ditto can persist Things in Ditto which can - when being displayed by other users also being authorized to see those Things in the Eclipse Ditto UI - cause scripts to be executed in the browser of other users."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T11:15:00",
        "access": {},
        "assigner": "cve@gitlab.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-6502",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://gitlab.com/gitlab-org/gitlab/-/issues/433534",
            "https://hackerone.com/reports/2263638"
        ],
        "summary": "A Denial of Service (DoS) condition has been discovered in GitLab CE/EE affecting all versions before 16.10.6, version 16.11 before 16.11.3, and 17.0 before 17.0.1. It is possible for an attacker to cause a denial of service using a crafted wiki page."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T11:15:00",
        "access": {},
        "assigner": "cve@gitlab.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-7045",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://gitlab.com/gitlab-org/gitlab/-/issues/436358",
            "https://hackerone.com/reports/2286823"
        ],
        "summary": "A CSRF vulnerability exists within GitLab CE/EE from versions 13.11 before 16.10.6, from 16.11 before 16.11.3, from 17.0 before 17.0.1. By leveraging this vulnerability, an attacker could exfiltrate anti-CSRF tokens via the Kubernetes Agent Server (KAS)."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T11:15:00",
        "access": {},
        "assigner": "cve-request@wordfence.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-1814",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://www.wordfence.com/threat-intel/vulnerabilities/id/d9ed939c-dc9c-46e8-9b23-0a3e5733e8d5?source=cve",
            "https://plugins.trac.wordpress.org/changeset/3075043/ultimate-addons-for-gutenberg"
        ],
        "summary": "The Spectra – WordPress Gutenberg Blocks plugin for WordPress is vulnerable to Stored Cross-Site Scripting via the plugin's Testimonial block in all versions up to, and including, 2.12.8 due to insufficient input sanitization and output escaping on user supplied attributes. This makes it possible for authenticated attackers, with contributor-level access and above, to inject arbitrary web scripts in pages that will execute whenever a user accesses an injected page."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T11:15:00",
        "access": {},
        "assigner": "cve-request@wordfence.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-1815",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://www.wordfence.com/threat-intel/vulnerabilities/id/1cd877e6-e000-437d-ba9f-0640350277e4?source=cve",
            "https://plugins.trac.wordpress.org/changeset/3075043/ultimate-addons-for-gutenberg"
        ],
        "summary": "The Spectra – WordPress Gutenberg Blocks plugin for WordPress is vulnerable to Stored Cross-Site Scripting via the plugin's Image Gallery block in all versions up to, and including, 2.12.8 due to insufficient input sanitization and output escaping on user supplied attributes. This makes it possible for authenticated attackers, with contributor-level access and above, to inject arbitrary web scripts in pages that will execute whenever a user accesses an injected page."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T11:15:00",
        "access": {},
        "assigner": "cve@gitlab.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-1947",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://gitlab.com/gitlab-org/gitlab/-/issues/443559",
            "https://hackerone.com/reports/2380264"
        ],
        "summary": "A denial of service (DoS) condition was discovered in GitLab CE/EE affecting all versions from 13.2.4 before 16.10.6, 16.11 before 16.11.3, and 17.0 before 17.0.1. By leveraging this vulnerability an attacker could create a DoS condition by sending crafted API calls."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T11:15:00",
        "access": {},
        "assigner": "cve-request@wordfence.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-3997",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://www.wordfence.com/threat-intel/vulnerabilities/id/8736fb91-d05c-4f7e-81ff-00dfa44961f5?source=cve",
            "https://plugins.trac.wordpress.org/changeset/3074395"
        ],
        "summary": "The Prime Slider – Addons For Elementor (Revolution of a slider, Hero Slider, Ecommerce Slider) plugin for WordPress is vulnerable to Stored Cross-Site Scripting via the plugin's Pagepiling widget in all versions up to, and including, 3.14.1 due to insufficient input sanitization and output escaping on user supplied attributes. This makes it possible for authenticated attackers, with contributor-level access and above, to inject arbitrary web scripts in pages that will execute whenever a user accesses an injected page."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T11:15:00",
        "access": {},
        "assigner": "cve-request@wordfence.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-4378",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://www.wordfence.com/threat-intel/vulnerabilities/id/f891a6c8-3d06-432e-8651-bb689015af1c?source=cve",
            "https://plugins.trac.wordpress.org/browser/premium-addons-for-elementor/trunk/includes/pa-nav-menu-walker.php#L394",
            "https://plugins.trac.wordpress.org/browser/premium-addons-for-elementor/trunk/modules/premium-shape-divider/module.php#L1047",
            "https://plugins.trac.wordpress.org/changeset/3090037"
        ],
        "summary": "The Premium Addons for Elementor plugin for WordPress is vulnerable to Stored Cross-Site Scripting via the plugin's menu and shape widgets in all versions up to, and including, 4.10.30 due to insufficient input sanitization and output escaping on user supplied attributes. This makes it possible for authenticated attackers, with contributor-level access and above, to inject arbitrary web scripts in pages that will execute whenever a user accesses an injected page."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T11:15:00",
        "access": {},
        "assigner": "cve-request@wordfence.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-4575",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://www.wordfence.com/threat-intel/vulnerabilities/id/4fa4167a-686f-4fd0-a53d-eb61d57228a1?source=cve",
            "https://layerslider.com/release-log/"
        ],
        "summary": "The LayerSlider plugin for WordPress is vulnerable to Stored Cross-Site Scripting via the plugin's ls_search_form shortcode in version 7.11.0 due to insufficient input sanitization and output escaping on user supplied attributes. This makes it possible for authenticated attackers, with contributor-level access and above, to inject arbitrary web scripts in pages that will execute whenever a user accesses an injected page."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T11:15:00",
        "access": {},
        "assigner": "cve@gitlab.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-5258",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://gitlab.com/gitlab-org/gitlab/-/issues/443254"
        ],
        "summary": "An authorization vulnerability exists within GitLab from versions 16.10 before 16.10.6, 16.11 before 16.11.3, and 17.0 before 17.0.1 where an authenticated attacker could utilize a crafted naming convention to bypass pipeline authorization logic."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T05:15:00",
        "access": {},
        "assigner": "cve-request@wordfence.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-4662",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://www.wordfence.com/threat-intel/vulnerabilities/id/8706c3f6-64e0-440e-a802-5c80d9cc3643?source=cve",
            "https://oxygenbuilder.com/oxygen-4-8-3-now-available-security-update/"
        ],
        "summary": "The Oxygen Builder plugin for WordPress is vulnerable to Remote Code Execution in all versions up to, and including, 4.8.2 via post metadata. This is due to the plugin storing custom data in post metadata without an underscore prefix. This makes it possible for lower privileged users, such as contributors, to inject arbitrary PHP code via the WordPress user interface and gain elevated privileges."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T05:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-89",
        "id": "CVE-2024-5236",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://vuldb.com/?id.265987",
            "https://vuldb.com/?ctiid.265987",
            "https://vuldb.com/?submit.339812",
            "https://github.com/E1CHO/cve_hub/blob/main/Complete%20Web-Based%20School%20Management%20System%20-%20sql/Complete%20Web-Based%20School%20Management%20System%20-%20vuln%2026.pdf"
        ],
        "summary": "A vulnerability classified as critical was found in Campcodes Complete Web-Based School Management System 1.0. Affected by this vulnerability is an unknown functionality of the file /view/teacher_salary_invoice1.php. The manipulation of the argument date leads to sql injection. The attack can be launched remotely. The exploit has been disclosed to the public and may be used. The associated identifier of this vulnerability is VDB-265987."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T05:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-89",
        "id": "CVE-2024-5234",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://vuldb.com/?id.265985",
            "https://vuldb.com/?ctiid.265985",
            "https://vuldb.com/?submit.339810",
            "https://github.com/E1CHO/cve_hub/blob/main/Complete%20Web-Based%20School%20Management%20System%20-%20sql/Complete%20Web-Based%20School%20Management%20System%20-%20vuln%2024.pdf"
        ],
        "summary": "A vulnerability was found in Campcodes Complete Web-Based School Management System 1.0. It has been rated as critical. This issue affects some unknown processing of the file /view/teacher_salary_history1.php. The manipulation of the argument index leads to sql injection. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used. The identifier VDB-265985 was assigned to this vulnerability."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T06:15:00",
        "access": {},
        "assigner": "contact@wpscan.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-3594",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://wpscan.com/vulnerability/7a8a834a-e5d7-4678-9d35-4390d1200437/"
        ],
        "summary": "The IDonate  WordPress plugin through 1.9.0 does not sanitise and escape some of its settings, which could allow high privilege users such as admin to perform Stored Cross-Site Scripting attacks even when the unfiltered_html capability is disallowed (for example in multisite setup)"
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T05:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-89",
        "id": "CVE-2024-5235",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://vuldb.com/?id.265986",
            "https://vuldb.com/?ctiid.265986",
            "https://vuldb.com/?submit.339811",
            "https://github.com/E1CHO/cve_hub/blob/main/Complete%20Web-Based%20School%20Management%20System%20-%20sql/Complete%20Web-Based%20School%20Management%20System%20-%20vuln%2025.pdf"
        ],
        "summary": "A vulnerability classified as critical has been found in Campcodes Complete Web-Based School Management System 1.0. Affected is an unknown function of the file /view/teacher_salary_invoice.php. The manipulation of the argument teacher_id leads to sql injection. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used. VDB-265986 is the identifier assigned to this vulnerability."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T06:15:00",
        "access": {},
        "assigner": "cve-request@wordfence.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-3626",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://www.wordfence.com/threat-intel/vulnerabilities/id/5a56e621-2508-4500-b865-4d5e4463b91a?source=cve",
            "https://plugins.trac.wordpress.org/browser/email-subscribers/trunk/lite/includes/class-email-subscribers.php#L1063",
            "https://plugins.trac.wordpress.org/browser/email-subscribers/trunk/lite/admin/class-email-subscribers-admin.php#L849",
            "https://plugins.trac.wordpress.org/changeset?sfp_email=&sfph_mail=&reponame=&new=3072302%40email-subscribers%2Ftrunk&old=3069441%40email-subscribers%2Ftrunk&sfp_email=&sfph_mail="
        ],
        "summary": "The Email Subscribers by Icegram Express – Email Marketing, Newsletters, Automation for WordPress & WooCommerce plugin for WordPress is vulnerable to unauthorized access of data due to a missing capability check on the get_template_content function in all versions up to, and including, 5.7.17. This makes it possible for authenticated attackers, with subscriber access and above, to obtain the contents of private and password-protected posts."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T05:15:00",
        "access": {},
        "assigner": "cve-request@wordfence.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2023-6325",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://www.wordfence.com/threat-intel/vulnerabilities/id/81a293ea-abda-4c90-a109-791ca5ba89a4?source=cve",
            "https://plugins.trac.wordpress.org/browser/romethemeform/tags/1.1.2/modules/form/form.php",
            "https://plugins.trac.wordpress.org/changeset/3090708/romethemeform/trunk?contextall=1&old=3079080&old_path=%2Fromethemeform%2Ftrunk"
        ],
        "summary": "The RomethemeForm For Elementor plugin for WordPress is vulnerable to unauthorized access and modification of data due to a missing capability check on the export_entries, rtformnewform, and rtformupdate functions in all versions up to, and including, 1.1.5. This makes it possible for unauthenticated attackers to export arbitrary form submissions, create new forms, or update any post title or certain metadata."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T06:15:00",
        "access": {},
        "assigner": "contact@wpscan.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-3918",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://wpscan.com/vulnerability/2074d0f5-4165-4130-9391-37cb21e8aa1b/"
        ],
        "summary": "The Pet Manager WordPress plugin through 1.4 does not sanitise and escape some of its Pet settings, which could allow high privilege users such as Contributor to perform Stored Cross-Site Scripting attacks."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T06:15:00",
        "access": {},
        "assigner": "cve-request@wordfence.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-3711",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://www.wordfence.com/threat-intel/vulnerabilities/id/7092ce4a-bad9-4426-b94e-d9d688344272?source=cve",
            "https://plugins.trac.wordpress.org/browser/brizy/trunk/admin/main.php",
            "https://plugins.trac.wordpress.org/changeset?sfp_email=&sfph_mail=&reponame=&new=3086506%40brizy%2Ftrunk&old=3058896%40brizy%2Ftrunk&sfp_email=&sfph_mail="
        ],
        "summary": "The Brizy – Page Builder plugin for WordPress is vulnerable to unauthorized plugin setting update due to a missing capability check on the functions action_request_disable, action_change_template, and action_request_enable in all versions up to, and including, 2.4.43. This makes it possible for authenticated attackers, with contributor access or above, to enable/disable the Brizy editor and modify the template used."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T06:15:00",
        "access": {},
        "assigner": "contact@wpscan.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-3920",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://wpscan.com/vulnerability/2fb28c77-3c35-4a2f-91ed-823d0d011048/"
        ],
        "summary": "The Flattr WordPress plugin through 1.2.2 does not sanitise and escape some of its settings, which could allow high privilege users such as admin to perform Stored Cross-Site Scripting attacks even when the unfiltered_html capability is disallowed (for example in multisite setup)"
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T06:15:00",
        "access": {},
        "assigner": "contact@wpscan.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-3917",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://wpscan.com/vulnerability/88162016-9fc7-4194-9e81-44c50991f6e9/"
        ],
        "summary": "The Pet Manager WordPress plugin through 1.4 does not sanitise and escape a parameter before outputting it back in the page, leading to a Reflected Cross-Site Scripting which could be used against high privilege users such as admin"
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T05:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-89",
        "id": "CVE-2024-5233",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://vuldb.com/?id.265984",
            "https://vuldb.com/?ctiid.265984",
            "https://vuldb.com/?submit.339809",
            "https://github.com/E1CHO/cve_hub/blob/main/Complete%20Web-Based%20School%20Management%20System%20-%20sql/Complete%20Web-Based%20School%20Management%20System%20-%20vuln%2023.pdf"
        ],
        "summary": "A vulnerability was found in Campcodes Complete Web-Based School Management System 1.0. It has been declared as critical. This vulnerability affects unknown code of the file /view/teacher_salary_details3.php. The manipulation of the argument index leads to sql injection. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used. The identifier of this vulnerability is VDB-265984."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T06:15:00",
        "access": {},
        "assigner": "cve-request@wordfence.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-4347",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://www.wordfence.com/threat-intel/vulnerabilities/id/634d4062-7004-4e89-89a8-323c939aae93?source=cve",
            "https://plugins.trac.wordpress.org/browser/wp-fastest-cache/trunk/wpFastestCache.php#L1342",
            "https://plugins.trac.wordpress.org/changeset?sfp_email=&sfph_mail=&reponame=&new=3089597%40wp-fastest-cache%2Ftrunk&old=3081797%40wp-fastest-cache%2Ftrunk&sfp_email=&sfph_mail=#file1"
        ],
        "summary": "The WP Fastest Cache plugin for WordPress is vulnerable to Directory Traversal in all versions up to, and including, 1.2.6 via the specificDeleteCache function. This makes it possible for authenticated attackers to delete arbitrary files on the server, which can include wp-config.php files of the affected site or other sites in a shared hosting environment."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T06:15:00",
        "access": {},
        "assigner": "contact@wpscan.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-2220",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://wpscan.com/vulnerability/fe8c001e-8880-4570-b010-a41fc8ee0c58/"
        ],
        "summary": "The Button contact VR WordPress plugin through 4.7 does not sanitise and escape some of its settings, which could allow high privilege users such as admin to perform Stored Cross-Site Scripting attacks even when the unfiltered_html capability is disallowed (for example in multisite setup)"
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T06:15:00",
        "access": {},
        "assigner": "contact@wpscan.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-4388",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://wpscan.com/vulnerability/5c791747-f60a-40a7-94fd-e4b9bb5ea2b0/"
        ],
        "summary": "This  does not validate a path generated with user input when downloading files, allowing unauthenticated user to download arbitrary files from the server"
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T06:15:00",
        "access": {},
        "assigner": "cve-request@wordfence.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-5177",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://www.wordfence.com/threat-intel/vulnerabilities/id/9ba07137-f834-4f56-bcd5-0f6fde756681?source=cve",
            "https://plugins.trac.wordpress.org/browser/hash-elements/trunk/modules/news-module-one/widgets/news-module-one.php#L720",
            "https://plugins.trac.wordpress.org/changeset?sfp_email=&sfph_mail=&reponame=&new=3090981%40hash-elements%2Ftrunk&old=3089165%40hash-elements%2Ftrunk&sfp_email=&sfph_mail=#file18"
        ],
        "summary": "The Hash Elements plugin for WordPress is vulnerable to Stored Cross-Site Scripting via the 'url' parameter within multiple widgets in all versions up to, and including, 1.3.8 due to insufficient input sanitization and output escaping on user supplied attributes. This makes it possible for authenticated attackers, with contributor-level access and above, to inject arbitrary web scripts in pages that will execute whenever a user accesses an injected page."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T06:15:00",
        "access": {},
        "assigner": "contact@wpscan.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-4399",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://wpscan.com/vulnerability/0690327e-da60-4d71-8b3c-ac9533d82302/"
        ],
        "summary": "The  does not validate a parameter before making a request to it, which could allow unauthenticated users to perform SSRF attack"
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T06:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-89",
        "id": "CVE-2024-5237",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://vuldb.com/?id.265988",
            "https://vuldb.com/?ctiid.265988",
            "https://vuldb.com/?submit.339813",
            "https://github.com/E1CHO/cve_hub/blob/main/Complete%20Web-Based%20School%20Management%20System%20-%20sql/Complete%20Web-Based%20School%20Management%20System%20-%20vuln%2027.pdf"
        ],
        "summary": "A vulnerability, which was classified as critical, has been found in Campcodes Complete Web-Based School Management System 1.0. Affected by this issue is some unknown functionality of the file /view/timetable_grade_wise.php. The manipulation of the argument grade leads to sql injection. The attack may be launched remotely. The exploit has been disclosed to the public and may be used. The identifier of this vulnerability is VDB-265988."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T06:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "CWE-89",
        "id": "CVE-2024-5238",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://vuldb.com/?id.265989",
            "https://vuldb.com/?ctiid.265989",
            "https://vuldb.com/?submit.339814",
            "https://github.com/E1CHO/cve_hub/blob/main/Complete%20Web-Based%20School%20Management%20System%20-%20sql/Complete%20Web-Based%20School%20Management%20System%20-%20vuln%2028.pdf"
        ],
        "summary": "A vulnerability, which was classified as critical, was found in Campcodes Complete Web-Based School Management System 1.0. This affects an unknown part of the file /view/timetable_insert_form.php. The manipulation of the argument grade leads to sql injection. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used. The identifier VDB-265989 was assigned to this vulnerability."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T06:15:00",
        "access": {},
        "assigner": "cna@vuldb.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-5239",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://vuldb.com/?id.265990",
            "https://vuldb.com/?ctiid.265990",
            "https://vuldb.com/?submit.339815",
            "https://github.com/E1CHO/cve_hub/blob/main/Complete%20Web-Based%20School%20Management%20System%20-%20sql/Complete%20Web-Based%20School%20Management%20System%20-%20vuln%2029.pdf"
        ],
        "summary": "A vulnerability has been found in Campcodes Complete Web-Based School Management System 1.0 and classified as critical. This vulnerability affects unknown code of the file /view/timetable_update_form.php. The manipulation of the argument grade leads to sql injection. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used. VDB-265990 is the identifier assigned to this vulnerability."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T07:15:00",
        "access": {},
        "assigner": "cve@kernel.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-36011",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://git.kernel.org/stable/c/1f7ebb69c1d65732bcac2fda9d15421f76f01e81",
            "https://git.kernel.org/stable/c/9f3be61f55d4eedc20eedc56c0f04a5ce2b4a55a",
            "https://git.kernel.org/stable/c/d2706004a1b8b526592e823d7e52551b518a7941"
        ],
        "summary": "In the Linux kernel, the following vulnerability has been resolved:\n\nBluetooth: HCI: Fix potential null-ptr-deref\n\nFix potential null-ptr-deref in hci_le_big_sync_established_evt()."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T07:15:00",
        "access": {},
        "assigner": "cve-request@wordfence.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-2038",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://www.wordfence.com/threat-intel/vulnerabilities/id/29532f4d-e830-4c99-ad77-076eebbbe98d?source=cve",
            "https://plugins.trac.wordpress.org/browser/atarim-visual-collaboration/tags/3.18/inc/wpf_api.php",
            "https://plugins.trac.wordpress.org/changeset?old=3076514&old_path=atarim-visual-collaboration%2Ftrunk%2Fatarim-visual-collaboration.php&new=3090249&new_path=atarim-visual-collaboration%2Ftrunk%2Fatarim-visual-collaboration.php"
        ],
        "summary": "The Visual Website Collaboration, Feedback & Project Management – Atarim plugin for WordPress is vulnerable to unauthorized access in all versions up to, and including, 3.22.6. This is due to the use of hardcoded credentials to authenticate all the incoming API requests. This makes it possible for unauthenticated attackers to modify plugin settings, delete posts, modify post titles, and upload images."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T07:15:00",
        "access": {},
        "assigner": "cve@gitlab.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-2874",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://gitlab.com/gitlab-org/gitlab/-/issues/451911",
            "https://hackerone.com/reports/2426166"
        ],
        "summary": "An issue has been discovered in GitLab CE/EE affecting all versions before 16.10.6, version 16.11 before 16.11.3, and 17.0 before 17.0.1. A runner registered with a crafted description has the potential to disrupt the loading of targeted GitLab web resources."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T07:15:00",
        "access": {},
        "assigner": "cve@kernel.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-36012",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://git.kernel.org/stable/c/e3880b531b68f98d3941d83f2f6dd11cf4fd6b76",
            "https://git.kernel.org/stable/c/a85a60e62355e3bf4802dead7938966824b23940",
            "https://git.kernel.org/stable/c/4f1de02de07748da80a8178879bc7a1df37fdf56",
            "https://git.kernel.org/stable/c/10f9f426ac6e752c8d87bf4346930ba347aaabac"
        ],
        "summary": "In the Linux kernel, the following vulnerability has been resolved:\n\nBluetooth: msft: fix slab-use-after-free in msft_do_close()\n\nTying the msft->data lifetime to hdev by freeing it in\nhci_release_dev() to fix the following case:\n\n[use]\nmsft_do_close()\n  msft = hdev->msft_data;\n  if (!msft)                      ...(1) <- passed.\n    return;\n  mutex_lock(&msft->filter_lock); ...(4) <- used after freed.\n\n[free]\nmsft_unregister()\n  msft = hdev->msft_data;\n  hdev->msft_data = NULL;         ...(2)\n  kfree(msft);                    ...(3) <- msft is freed.\n\n==================================================================\nBUG: KASAN: slab-use-after-free in __mutex_lock_common\nkernel/locking/mutex.c:587 [inline]\nBUG: KASAN: slab-use-after-free in __mutex_lock+0x8f/0xc30\nkernel/locking/mutex.c:752\nRead of size 8 at addr ffff888106cbbca8 by task kworker/u5:2/309"
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T07:15:00",
        "access": {},
        "assigner": "cve@kernel.org",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-36013",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://git.kernel.org/stable/c/4d7b41c0e43995b0e992b9f8903109275744b658"
        ],
        "summary": "In the Linux kernel, the following vulnerability has been resolved:\n\nBluetooth: L2CAP: Fix slab-use-after-free in l2cap_connect()\n\nExtend a critical section to prevent chan from early freeing.\nAlso make the l2cap_connect() return type void. Nothing is using the\nreturned value but it is ugly to return a potentially freed pointer.\nMaking it void will help with backports because earlier kernels did use\nthe return value. Now the compile will break for kernels where this\npatch is not a complete fix.\n\nCall stack summary:\n\n[use]\nl2cap_bredr_sig_cmd\n  l2cap_connect\n  ? mutex_lock(&conn->chan_lock);\n  ? chan = pchan->ops->new_connection(pchan); <- alloc chan\n  ? __l2cap_chan_add(conn, chan);\n  ?   l2cap_chan_hold(chan);\n  ?   list_add(&chan->list, &conn->chan_l);   ... (1)\n  ? mutex_unlock(&conn->chan_lock);\n    chan->conf_state              ... (4) <- use after free\n\n[free]\nl2cap_conn_del\n? mutex_lock(&conn->chan_lock);\n? foreach chan in conn->chan_l:            ... (2)\n?   l2cap_chan_put(chan);\n?     l2cap_chan_destroy\n?       kfree(chan)               ... (3) <- chan freed\n? mutex_unlock(&conn->chan_lock);\n\n==================================================================\nBUG: KASAN: slab-use-after-free in instrument_atomic_read\ninclude/linux/instrumented.h:68 [inline]\nBUG: KASAN: slab-use-after-free in _test_bit\ninclude/asm-generic/bitops/instrumented-non-atomic.h:141 [inline]\nBUG: KASAN: slab-use-after-free in l2cap_connect+0xa67/0x11a0\nnet/bluetooth/l2cap_core.c:4260\nRead of size 8 at addr ffff88810bf040a0 by task kworker/u3:1/311"
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T07:15:00",
        "access": {},
        "assigner": "cve-request@wordfence.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-3648",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://www.wordfence.com/threat-intel/vulnerabilities/id/03b37c90-4bb5-4003-a440-3fb57a5c1cae?source=cve",
            "https://plugins.trac.wordpress.org/changeset/3089529/sharethis-share-buttons"
        ],
        "summary": "The ShareThis Share Buttons plugin for WordPress is vulnerable to Stored Cross-Site Scripting via the plugin's 'sharethis-inline-button' shortcode in all versions up to, and including, 2.3.0 due to insufficient input sanitization and output escaping on user supplied attributes. This makes it possible for authenticated attackers, with contributor-level access and above, to inject arbitrary web scripts in pages that will execute whenever a user accesses an injected page."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T07:15:00",
        "access": {},
        "assigner": "cve-request@wordfence.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-4043",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://www.wordfence.com/threat-intel/vulnerabilities/id/14e897f0-11e6-43b1-908c-be4ecdc7fd58?source=cve",
            "https://plugins.trac.wordpress.org/browser/wp-ultimate-post-grid/trunk/includes/public/shortcodes/general/class-wpupg-sc-text.php#L97",
            "https://plugins.trac.wordpress.org/changeset/3086319/",
            "https://wordpress.org/plugins/wp-ultimate-post-grid/#developers"
        ],
        "summary": "The WP Ultimate Post Grid plugin for WordPress is vulnerable to Stored Cross-Site Scripting via the plugin's 'wpupg-text' shortcode in all versions up to, and including, 3.9.1 due to insufficient input sanitization and output escaping on user supplied attributes. This makes it possible for authenticated attackers, with contributor-level access and above, to inject arbitrary web scripts in pages that will execute whenever a user accesses an injected page."
    },
    {
        "Modified": "2024-05-24T01:15:00",
        "Published": "2024-05-23T07:15:00",
        "access": {},
        "assigner": "cve@gitlab.com",
        "cvss": null,
        "cwe": "Unknown",
        "id": "CVE-2024-4835",
        "impact": {},
        "last-modified": "2024-05-24T01:15:00",
        "references": [
            "https://gitlab.com/gitlab-org/gitlab/-/issues/461328",
            "https://hackerone.com/reports/2497024"
        ],
        "summary": "A XSS condition exists within GitLab in versions 15.11 before 16.10.6, 16.11 before 16.11.3, and 17.0 before 17.0.1. By leveraging this condition, an attacker can craft a malicious page to exfiltrate sensitive user information."
    }
]